kepler-444b/HC32F002/mcu/common/HC32F002.h
/******************************************************************************
 * Copyright (C) 2021, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************/

/******************************************************************************
** @file HC32F002.h
**
** @brief Headerfile for HC32F002 series MCU
**
** @author MADS Team
**
** - 2022-01-26.
**
******************************************************************************/

#ifndef __HC32F002_H__
#define __HC32F002_H__

#ifdef __cplusplus
extern "C"
{
#endif

/******************************************************************************
 * Configuration of the Cortex-M0P Processor and Core Peripherals
 ******************************************************************************/
#define __MPU_PRESENT 0          /* No MPU                                       */
#define __NVIC_PRIO_BITS 2       /* M0P uses 2 Bits for the Priority Levels      */
#define __Vendor_SysTickConfig 0 /* Set to 1 if different SysTick Config is used */

    /******************************************************************************
     * Interrupt Number Definition
     ******************************************************************************/
    typedef enum IRQn
    {
        NMI_IRQn = -14,       /*  2 Non Maskable                            */
        HardFault_IRQn = -13, /*  3 Hard Fault                              */
        SVC_IRQn = -5,        /* 11 SV Call                                 */
        PendSV_IRQn = -2,     /* 14 Pend SV                                 */
        SysTick_IRQn = -1,    /* 15 System Tick                             */

        PORTA_IRQn = 0,
        PORTB_IRQn = 1,
        PORTC_IRQn = 2,
        PORTD_IRQn = 3,
        ATIM3_IRQn = 5,
        LPUART0_IRQn = 8,
        LPUART1_IRQn = 9,
        SPI0_IRQn = 10,
        I2C_IRQn = 12,
        BTIM3_4_5_IRQn = 15,
        GTIM_IRQn = 15,
        IWDT_WWDT_IRQn = 22,
        ADC_IRQn = 24,
        LVD_IRQn = 28,
        FLASH_IRQn = 30,
        CTRIM_IRQn = 31,

    } IRQn_Type;

#include <core_cm0plus.h>
#include <stdint.h>

#define SUCCESS (0)
#define ERROR (-1)

#ifndef NULL
#define NULL (0)
#endif

    /******************************************************************************/
    /*                Device Specific Peripheral Registers structures             */
    /******************************************************************************/

#if defined(__CC_ARM)
#pragma anon_unions
#endif

    typedef struct
    {
        __IO uint32_t EN : 1;
        uint32_t RESERVED1 : 1;
        __IO uint32_t CKDIV : 3;
        uint32_t RESERVED5 : 4;
        __IO uint32_t REF : 2;
        uint32_t RESERVED11 : 1;
        __IO uint32_t SAM : 2;
        uint32_t RESERVED14 : 17;
        __IO uint32_t RSV : 1;
    } stc_adc_cr0_field_t;

    typedef struct
    {
        __IO uint32_t CHSEL : 4;
        uint32_t RESERVED4 : 27;
        __IO uint32_t RSV : 1;
    } stc_adc_cr1_field_t;

    typedef struct
    {
        __IO uint32_t RESULT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_adc_result_field_t;

    typedef struct
    {
        __IO uint32_t EOC : 1;
        uint32_t RESERVED1 : 30;
        __IO uint32_t RSV : 1;
    } stc_adc_ifr_field_t;

    typedef struct
    {
        __IO uint32_t EOC : 1;
        uint32_t RESERVED1 : 30;
        __IO uint32_t RSV : 1;
    } stc_adc_ier_field_t;

    typedef struct
    {
        __IO uint32_t EOC : 1;
        uint32_t RESERVED1 : 30;
        __IO uint32_t RSV : 1;
    } stc_adc_icr_field_t;

    typedef struct
    {
        __IO uint32_t TRIGSEL : 4;
        uint32_t RESERVED4 : 27;
        __IO uint32_t RSV : 1;
    } stc_adc_exttrigger_field_t;

    typedef struct
    {
        __IO uint32_t START : 1;
        uint32_t RESERVED1 : 30;
        __IO uint32_t RSV : 1;
    } stc_adc_start_field_t;

    typedef struct
    {
        __IO uint32_t START : 1;
        uint32_t RESERVED1 : 30;
        __IO uint32_t RSV : 1;
    } stc_adc_allstart_field_t;

    typedef struct
    {
        __IO uint32_t ARR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode0_arr_field_t;

    typedef struct
    {
        __IO uint32_t CNT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode0_cnt_field_t;

    typedef struct
    {
        __IO uint32_t CNT32 : 32;
    } stc_atim3mode0_cnt32_field_t;

    typedef struct
    {
        __IO uint32_t CEN : 1;
        __IO uint32_t MD : 1;
        __IO uint32_t CT : 1;
        __IO uint32_t TOG : 1;
        __IO uint32_t PRS : 3;
        uint32_t RESERVED7 : 1;
        __IO uint32_t GATE : 1;
        __IO uint32_t GATEP : 1;
        __IO uint32_t UI : 1;
        uint32_t RESERVED11 : 1;
        __IO uint32_t MODE : 2;
        uint32_t RESERVED14 : 17;
        __IO uint32_t RSV : 1;
    } stc_atim3mode0_m0cr_field_t;

    typedef struct
    {
        __IO uint32_t UI : 1;
        uint32_t RESERVED1 : 30;
        __IO uint32_t RSV : 1;
    } stc_atim3mode0_ifr_field_t;

    typedef struct
    {
        __IO uint32_t UI : 1;
        uint32_t RESERVED1 : 30;
        __IO uint32_t RSV : 1;
    } stc_atim3mode0_iclr_field_t;

    typedef struct
    {
        uint32_t RESERVED0 : 12;
        __IO uint32_t MO : 1;
        uint32_t RESERVED13 : 18;
        __IO uint32_t RSV : 1;
    } stc_atim3mode0_dtr_field_t;

    typedef struct
    {
        __IO uint32_t CNT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode1_cnt_field_t;

    typedef struct
    {
        __IO uint32_t CEN : 1;
        uint32_t RESERVED1 : 1;
        __IO uint32_t CT : 1;
        uint32_t RESERVED3 : 1;
        __IO uint32_t PRS : 3;
        uint32_t RESERVED7 : 1;
        __IO uint32_t EDG1ST : 1;
        __IO uint32_t EDG2ND : 1;
        __IO uint32_t UI : 1;
        uint32_t RESERVED11 : 1;
        __IO uint32_t MODE : 2;
        __IO uint32_t ONESHOT : 1;
        uint32_t RESERVED15 : 16;
        __IO uint32_t RSV : 1;
    } stc_atim3mode1_m1cr_field_t;

    typedef struct
    {
        __IO uint32_t UI : 1;
        uint32_t RESERVED1 : 1;
        __IO uint32_t PWC : 1;
        uint32_t RESERVED3 : 28;
        __IO uint32_t RSV : 1;
    } stc_atim3mode1_ifr_field_t;

    typedef struct
    {
        __IO uint32_t UI : 1;
        uint32_t RESERVED1 : 1;
        __IO uint32_t CA0 : 1;
        uint32_t RESERVED3 : 28;
        __IO uint32_t RSV : 1;
    } stc_atim3mode1_iclr_field_t;

    typedef struct
    {
        uint32_t RESERVED0 : 5;
        __IO uint32_t TS : 3;
        uint32_t RESERVED8 : 3;
        __IO uint32_t IA0S : 1;
        __IO uint32_t IB0S : 1;
        uint32_t RESERVED13 : 18;
        __IO uint32_t RSV : 1;
    } stc_atim3mode1_mscr_field_t;

    typedef struct
    {
        __IO uint32_t FLTA0 : 3;
        uint32_t RESERVED3 : 1;
        __IO uint32_t FLTB0 : 3;
        uint32_t RESERVED7 : 21;
        __IO uint32_t FLTET : 3;
        __IO uint32_t ETP : 1;
    } stc_atim3mode1_fltr_field_t;

    typedef struct
    {
        uint32_t RESERVED0 : 8;
        __IO uint32_t CIEA : 1;
        uint32_t RESERVED9 : 22;
        __IO uint32_t RSV : 1;
    } stc_atim3mode1_cr0_field_t;

    typedef struct
    {
        __IO uint32_t CCR0A : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode1_ccr0a_field_t;

    typedef struct
    {
        __IO uint32_t ARR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_arr_field_t;

    typedef struct
    {
        __IO uint32_t CNT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_cnt_field_t;

    typedef struct
    {
        __IO uint32_t CTEN : 1;
        __IO uint32_t COMP : 1;
        __IO uint32_t CT : 1;
        __IO uint32_t PWM2S : 1;
        __IO uint32_t PRS : 3;
        __IO uint32_t BUFP : 1;
        __IO uint32_t CRG : 1;
        __IO uint32_t CFG : 1;
        __IO uint32_t UI : 1;
        __IO uint32_t UD : 1;
        __IO uint32_t MODE : 2;
        __IO uint32_t ONESHOT : 1;
        __IO uint32_t CSG : 1;
        __IO uint32_t OCCS : 1;
        __IO uint32_t URS : 1;
        __IO uint32_t TD : 1;
        __IO uint32_t TI : 1;
        __IO uint32_t BI : 1;
        __IO uint32_t CIS : 2;
        __IO uint32_t OCC : 1;
        __IO uint32_t TG : 1;
        __IO uint32_t UG : 1;
        __IO uint32_t BG : 1;
        __IO uint32_t DIR : 1;
        __IO uint32_t OV : 1;
        __IO uint32_t UND : 1;
        uint32_t RESERVED30 : 1;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_m23cr_field_t;

    typedef struct
    {
        __IO uint32_t UI : 1;
        uint32_t RESERVED1 : 1;
        __IO uint32_t CA0 : 1;
        __IO uint32_t CA1 : 1;
        __IO uint32_t CA2 : 1;
        __IO uint32_t CB0 : 1;
        __IO uint32_t CB1 : 1;
        __IO uint32_t CB2 : 1;
        __IO uint32_t CA0E : 1;
        __IO uint32_t CA1E : 1;
        __IO uint32_t CA2E : 1;
        __IO uint32_t CB0E : 1;
        __IO uint32_t CB1E : 1;
        __IO uint32_t CB2E : 1;
        __IO uint32_t BI : 1;
        __IO uint32_t TI : 1;
        __IO uint32_t OV : 1;
        __IO uint32_t UND : 1;
        __IO uint32_t CA3 : 1;
        uint32_t RESERVED19 : 12;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_ifr_field_t;

    typedef struct
    {
        __IO uint32_t UI : 1;
        uint32_t RESERVED1 : 1;
        __IO uint32_t CA0 : 1;
        __IO uint32_t CA1 : 1;
        __IO uint32_t CA2 : 1;
        __IO uint32_t CB0 : 1;
        __IO uint32_t CB1 : 1;
        __IO uint32_t CB2 : 1;
        __IO uint32_t CA0E : 1;
        __IO uint32_t CA1E : 1;
        __IO uint32_t CA2E : 1;
        __IO uint32_t CB0E : 1;
        __IO uint32_t CB1E : 1;
        __IO uint32_t CB2E : 1;
        __IO uint32_t BI : 1;
        __IO uint32_t TI : 1;
        __IO uint32_t OV : 1;
        __IO uint32_t UND : 1;
        __IO uint32_t CA3 : 1;
        uint32_t RESERVED19 : 12;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_iclr_field_t;

    typedef struct
    {
        __IO uint32_t MMS : 3;
        __IO uint32_t CCDS : 1;
        __IO uint32_t MSM : 1;
        __IO uint32_t TS : 3;
        __IO uint32_t SMS : 3;
        __IO uint32_t IA0S : 1;
        __IO uint32_t IB0S : 1;
        uint32_t RESERVED13 : 18;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_mscr_field_t;

    typedef struct
    {
        __IO uint32_t OCMA0FLTA0 : 3;
        __IO uint32_t CCPA0 : 1;
        __IO uint32_t OCMB0FLTB0 : 3;
        __IO uint32_t CCPB0 : 1;
        __IO uint32_t OCMA1FLTA1 : 3;
        __IO uint32_t CCPA1 : 1;
        __IO uint32_t OCMB1FLTB1 : 3;
        __IO uint32_t CCPB1 : 1;
        __IO uint32_t OCMA2FLTA2 : 3;
        __IO uint32_t CCPA2 : 1;
        __IO uint32_t OCMB2FLTB2 : 3;
        __IO uint32_t CCPB2 : 1;
        __IO uint32_t FLTBK : 3;
        __IO uint32_t BKP : 1;
        __IO uint32_t FLTET : 3;
        __IO uint32_t ETP : 1;
    } stc_atim3mode23_fltr_field_t;

    typedef struct
    {
        __IO uint32_t UEV : 1;
        __IO uint32_t CMA0 : 1;
        __IO uint32_t CMA1 : 1;
        __IO uint32_t CMA2 : 1;
        __IO uint32_t CMB0 : 1;
        __IO uint32_t CMB1 : 1;
        __IO uint32_t CMB2 : 1;
        __IO uint32_t ADT : 1;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_adtr_field_t;

    typedef struct
    {
        __IO uint32_t BKSACFACRA : 2;
        __IO uint32_t BKSBCFBCRB : 2;
        __IO uint32_t CSA : 1;
        __IO uint32_t CSB : 1;
        __IO uint32_t BUFEA : 1;
        __IO uint32_t BUFEB : 1;
        __IO uint32_t CIEA : 1;
        __IO uint32_t CIEB : 1;
        __IO uint32_t CDEA : 1;
        __IO uint32_t CDEB : 1;
        __IO uint32_t CISB : 2;
        __IO uint32_t CCGA : 1;
        __IO uint32_t CCGB : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_crch0_field_t;

    typedef struct
    {
        __IO uint32_t BKSACFACRA : 2;
        __IO uint32_t BKSBCFBCRB : 2;
        __IO uint32_t CSA : 1;
        __IO uint32_t CSB : 1;
        __IO uint32_t BUFEA : 1;
        __IO uint32_t BUFEB : 1;
        __IO uint32_t CIEA : 1;
        __IO uint32_t CIEB : 1;
        __IO uint32_t CDEA : 1;
        __IO uint32_t CDEB : 1;
        __IO uint32_t CISB : 2;
        __IO uint32_t CCGA : 1;
        __IO uint32_t CCGB : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_crch1_field_t;

    typedef struct
    {
        __IO uint32_t BKSACFACRA : 2;
        __IO uint32_t BKSBCFBCRB : 2;
        __IO uint32_t CSA : 1;
        __IO uint32_t CSB : 1;
        __IO uint32_t BUFEA : 1;
        __IO uint32_t BUFEB : 1;
        __IO uint32_t CIEA : 1;
        __IO uint32_t CIEB : 1;
        __IO uint32_t CDEA : 1;
        __IO uint32_t CDEB : 1;
        __IO uint32_t CISB : 2;
        __IO uint32_t CCGA : 1;
        __IO uint32_t CCGB : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_crch2_field_t;

    typedef struct
    {
        __IO uint32_t DTR : 8;
        __IO uint32_t BKSEL : 1;
        __IO uint32_t DT : 1;
        __IO uint32_t BK : 1;
        __IO uint32_t AO : 1;
        __IO uint32_t MO : 1;
        __IO uint32_t SAFE : 1;
        __IO uint32_t VC : 1;
        uint32_t RESERVED15 : 16;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_dtr_field_t;

    typedef struct
    {
        __IO uint32_t RCR : 8;
        __IO uint32_t OV : 1;
        __IO uint32_t UD : 1;
        uint32_t RESERVED10 : 21;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_rcr_field_t;

    typedef struct
    {
        __IO uint32_t CCR0A : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_ccr0a_field_t;

    typedef struct
    {
        __IO uint32_t CCR0B : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_ccr0b_field_t;

    typedef struct
    {
        __IO uint32_t CCR1A : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_ccr1a_field_t;

    typedef struct
    {
        __IO uint32_t CCR1B : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_ccr1b_field_t;

    typedef struct
    {
        __IO uint32_t CCR2A : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_ccr2a_field_t;

    typedef struct
    {
        __IO uint32_t CCR2B : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_ccr2b_field_t;

    typedef struct
    {
        __IO uint32_t CCR3 : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_ccr3_field_t;

    typedef struct
    {
        __IO uint32_t BUF : 1;
        __IO uint32_t CI : 1;
        __IO uint32_t CD : 1;
        __IO uint32_t CIS : 2;
        __IO uint32_t C3 : 1;
        uint32_t RESERVED6 : 25;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_crch3_field_t;

    typedef struct
    {
        __IO uint32_t ARR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_btim_arr_field_t;

    typedef struct
    {
        __IO uint32_t CNT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_btim_cnt_field_t;

    typedef struct
    {
        __IO uint32_t CEN : 1;
        __IO uint32_t MD : 2;
        __IO uint32_t TOGEN : 1;
        __IO uint32_t PRS : 4;
        __IO uint32_t OST : 1;
        __IO uint32_t TRS : 2;
        __IO uint32_t ETP : 1;
        uint32_t RESERVED12 : 19;
        __IO uint32_t RSV : 1;
    } stc_btim_cr_field_t;

    typedef struct
    {
        __IO uint32_t UI : 1;
        __IO uint32_t TI : 1;
        uint32_t RESERVED2 : 29;
        __IO uint32_t RSV : 1;
    } stc_btim_ier_field_t;

    typedef struct
    {
        __IO uint32_t UI : 1;
        __IO uint32_t TI : 1;
        uint32_t RESERVED2 : 29;
        __IO uint32_t RSV : 1;
    } stc_btim_ifr_field_t;

    typedef struct
    {
        __IO uint32_t UI : 1;
        __IO uint32_t TI : 1;
        uint32_t RESERVED2 : 29;
        __IO uint32_t RSV : 1;
    } stc_btim_icr_field_t;

    typedef struct
    {
        __IO uint32_t UI3 : 1;
        __IO uint32_t TI3 : 1;
        __IO uint32_t UI4 : 1;
        __IO uint32_t TI4 : 1;
        __IO uint32_t UI5 : 1;
        __IO uint32_t TI5 : 1;
        uint32_t RESERVED6 : 25;
        __IO uint32_t RSV : 1;
    } stc_btim_aifr_field_t;

    typedef struct
    {
        __IO uint32_t UI3 : 1;
        __IO uint32_t TI3 : 1;
        __IO uint32_t UI4 : 1;
        __IO uint32_t TI4 : 1;
        __IO uint32_t UI5 : 1;
        __IO uint32_t TI5 : 1;
        uint32_t RESERVED6 : 25;
        __IO uint32_t RSV : 1;
    } stc_btim_aicr_field_t;

    typedef struct
    {
        __IO uint32_t ARR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_ctrim_arr_field_t;

    typedef struct
    {
        __IO uint32_t CNT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_ctrim_cnt_field_t;

    typedef struct
    {
        __IO uint32_t STEP : 3;
        uint32_t RESERVED3 : 1;
        __IO uint32_t ETRFLT : 3;
        uint32_t RESERVED7 : 1;
        __IO uint32_t SRC : 3;
        uint32_t RESERVED11 : 20;
        __IO uint32_t RSV : 1;
    } stc_ctrim_cr0_field_t;

    typedef struct
    {
        __IO uint32_t EN : 1;
        __IO uint32_t MD : 2;
        __IO uint32_t AUTO : 1;
        __IO uint32_t PRS : 4;
        __IO uint32_t OST : 1;
        uint32_t RESERVED9 : 22;
        __IO uint32_t RSV : 1;
    } stc_ctrim_cr1_field_t;

    typedef struct
    {
        __IO uint32_t UD : 1;
        __IO uint32_t END : 1;
        __IO uint32_t PS : 1;
        __IO uint32_t MISS : 1;
        __IO uint32_t OV : 1;
        uint32_t RESERVED5 : 26;
        __IO uint32_t RSV : 1;
    } stc_ctrim_ier_field_t;

    typedef struct
    {
        __IO uint32_t UD : 1;
        __IO uint32_t END : 1;
        __IO uint32_t PS : 1;
        __IO uint32_t MISS : 1;
        __IO uint32_t OV : 1;
        __IO uint32_t DIR : 1;
        __IO uint32_t OK : 1;
        uint32_t RESERVED7 : 24;
        __IO uint32_t RSV : 1;
    } stc_ctrim_isr_field_t;

    typedef struct
    {
        __IO uint32_t UD : 1;
        __IO uint32_t END : 1;
        __IO uint32_t PS : 1;
        __IO uint32_t MISS : 1;
        __IO uint32_t OV : 1;
        __IO uint32_t OK : 1;
        uint32_t RESERVED6 : 25;
        __IO uint32_t RSV : 1;
    } stc_ctrim_icr_field_t;

    typedef struct
    {
        __IO uint32_t FCAP : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_ctrim_fcap_field_t;

    typedef struct
    {
        __IO uint32_t TVAL : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_ctrim_tval_field_t;

    typedef struct
    {
        __IO uint32_t FLIM : 8;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_ctrim_flim_field_t;

    typedef struct
    {
        __IO uint32_t OP : 2;
        uint32_t RESERVED2 : 2;
        __IO uint32_t BUSY : 1;
        __IO uint32_t PCIE : 1;
        __IO uint32_t FLASHIE : 1;
        uint32_t RESERVED7 : 2;
        __IO uint32_t LPMODE : 1;
        uint32_t RESERVED10 : 21;
        __IO uint32_t RSV : 1;
    } stc_flash_cr_field_t;

    typedef struct
    {
        __IO uint32_t PC : 1;
        __IO uint32_t FLASH : 1;
        uint32_t RESERVED2 : 29;
        __IO uint32_t RSV : 1;
    } stc_flash_ifr_field_t;

    typedef struct
    {
        __IO uint32_t PC : 1;
        __IO uint32_t FLASH : 1;
        uint32_t RESERVED2 : 29;
        __IO uint32_t RSV : 1;
    } stc_flash_iclr_field_t;

    typedef struct
    {
        __IO uint32_t BYPASS : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_flash_bypass_field_t;

    typedef struct
    {
        __IO uint32_t SLOCK : 9;
        uint32_t RESERVED9 : 22;
        __IO uint32_t RSV : 1;
    } stc_flash_slock_field_t;

    typedef struct
    {
        __IO uint32_t WAIT : 2;
        uint32_t RESERVED2 : 29;
        __IO uint32_t RSV : 1;
    } stc_flash_wait_field_t;

    typedef struct
    {
        __IO uint32_t STATE : 2;
        uint32_t RESERVED2 : 29;
        __IO uint32_t RSV : 1;
    } stc_flash_lockstate_field_t;

    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_gpio_ads_field_t;

    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_gpio_dir_field_t;

    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_gpio_opendrain_field_t;

    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_gpio_pu_field_t;

    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_gpio_in_field_t;

    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_gpio_out_field_t;

    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_gpio_brr_field_t;

