kepler-444b/HC32F002/mcu/common/HC32F002.h
    typedef struct
    {
        __IO uint32_t BSPIN0 : 1;
        __IO uint32_t BSPIN1 : 1;
        __IO uint32_t BSPIN2 : 1;
        __IO uint32_t BSPIN3 : 1;
        __IO uint32_t BSPIN4 : 1;
        __IO uint32_t BSPIN5 : 1;
        __IO uint32_t BSPIN6 : 1;
        __IO uint32_t BSPIN7 : 1;
        uint32_t RESERVED8 : 8;
        __IO uint32_t BRPIN0 : 1;
        __IO uint32_t BRPIN1 : 1;
        __IO uint32_t BRPIN2 : 1;
        __IO uint32_t BRPIN3 : 1;
        __IO uint32_t BRPIN4 : 1;
        __IO uint32_t BRPIN5 : 1;
        __IO uint32_t BRPIN6 : 1;
        __IO uint32_t BRPIN7 : 1;
        uint32_t RESERVED24 : 7;
        __IO uint32_t RSV : 1;
    } stc_gpio_bsrr_field_t;

    typedef struct
    {
        __IO uint32_t AFSEL0 : 4;
        __IO uint32_t AFSEL1 : 4;
        __IO uint32_t AFSEL2 : 4;
        __IO uint32_t AFSEL3 : 4;
        __IO uint32_t AFSEL4 : 4;
        __IO uint32_t AFSEL5 : 4;
        __IO uint32_t AFSEL6 : 4;
        __IO uint32_t AFSEL7 : 4;
    } stc_gpio_afrl_field_t;

    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_gpio_highie_field_t;

    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_gpio_lowie_field_t;

    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_gpio_riseie_field_t;

    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_gpio_fallie_field_t;

    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_gpio_ifr_field_t;

    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_gpio_icr_field_t;

    typedef struct
    {
        __IO uint32_t TCLKSRC : 2;
        uint32_t RESERVED2 : 1;
        __IO uint32_t TCLKDIV : 2;
        uint32_t RESERVED5 : 26;
        __IO uint32_t RSV : 1;
    } stc_gpioaux_cr1_field_t;

    typedef struct
    {
        uint32_t RESERVED0 : 4;
        __IO uint32_t ATIM3CH0A : 2;
        uint32_t RESERVED6 : 2;
        __IO uint32_t GTIMCH1 : 2;
        uint32_t RESERVED10 : 21;
        __IO uint32_t RSV : 1;
    } stc_gpioaux_cr4_field_t;

    typedef struct
    {
        __IO uint32_t ARR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_gtim_arr_field_t;

    typedef struct
    {
        __IO uint32_t CNT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_gtim_cnt_field_t;

    typedef struct
    {
        __IO uint32_t CC0M : 3;
        uint32_t RESERVED3 : 1;
        __IO uint32_t CC1M : 3;
        uint32_t RESERVED7 : 1;
        __IO uint32_t CC2M : 3;
        uint32_t RESERVED11 : 1;
        __IO uint32_t CC3M : 3;
        uint32_t RESERVED15 : 16;
        __IO uint32_t RSV : 1;
    } stc_gtim_cmmr_field_t;

    typedef struct
    {
        uint32_t RESERVED0 : 4;
        __IO uint32_t ETRFLT : 3;
        uint32_t RESERVED7 : 24;
        __IO uint32_t RSV : 1;
    } stc_gtim_cr1_field_t;

    typedef struct
    {
        __IO uint32_t CEN : 1;
        __IO uint32_t MD : 2;
        __IO uint32_t TOGEN : 1;
        __IO uint32_t PRS : 4;
        __IO uint32_t OST : 1;
        __IO uint32_t TRS : 2;
        __IO uint32_t ETP : 1;
        uint32_t RESERVED12 : 19;
        __IO uint32_t RSV : 1;
    } stc_gtim_cr0_field_t;

    typedef struct
    {
        __IO uint32_t UI : 1;
        __IO uint32_t TI : 1;
        __IO uint32_t CC0 : 1;
        __IO uint32_t CC1 : 1;
        __IO uint32_t CC2 : 1;
        __IO uint32_t CC3 : 1;
        uint32_t RESERVED6 : 25;
        __IO uint32_t RSV : 1;
    } stc_gtim_ier_field_t;

    typedef struct
    {
        __IO uint32_t UI : 1;
        __IO uint32_t TI : 1;
        __IO uint32_t CC0 : 1;
        __IO uint32_t CC1 : 1;
        __IO uint32_t CC2 : 1;
        __IO uint32_t CC3 : 1;
        uint32_t RESERVED6 : 25;
        __IO uint32_t RSV : 1;
    } stc_gtim_ifr_field_t;

    typedef struct
    {
        __IO uint32_t UI : 1;
        __IO uint32_t TI : 1;
        __IO uint32_t CC0 : 1;
        __IO uint32_t CC1 : 1;
        __IO uint32_t CC2 : 1;
        __IO uint32_t CC3 : 1;
        uint32_t RESERVED6 : 25;
        __IO uint32_t RSV : 1;
    } stc_gtim_icr_field_t;

    typedef struct
    {
        __IO uint32_t CCR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_gtim_ccr0_field_t;

    typedef struct
    {
        __IO uint32_t CCR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_gtim_ccr1_field_t;

    typedef struct
    {
        __IO uint32_t CCR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_gtim_ccr2_field_t;

    typedef struct
    {
        __IO uint32_t CCR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_gtim_ccr3_field_t;

    typedef struct
    {
        __IO uint32_t EN : 1;
        uint32_t RESERVED1 : 30;
        __IO uint32_t RSV : 1;
    } stc_i2c_brren_field_t;

    typedef struct
    {
        __IO uint32_t BRR : 8;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_i2c_brr_field_t;

    typedef struct
    {
        __IO uint32_t FLT : 1;
        uint32_t RESERVED1 : 1;
        __IO uint32_t AA : 1;
        __IO uint32_t SI : 1;
        __IO uint32_t STO : 1;
        __IO uint32_t STA : 1;
        __IO uint32_t EN : 1;
        uint32_t RESERVED7 : 24;
        __IO uint32_t RSV : 1;
    } stc_i2c_cr_field_t;

    typedef struct
    {
        __IO uint32_t DR : 8;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_i2c_dr_field_t;

    typedef struct
    {
        __IO uint32_t GC : 1;
        __IO uint32_t ADDR0 : 7;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_i2c_addr0_field_t;

    typedef struct
    {
        __IO uint32_t STAT : 8;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_i2c_stat_field_t;

    typedef struct
    {
        uint32_t RESERVED0 : 1;
        __IO uint32_t ADDR : 7;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_i2c_addr1_field_t;

    typedef struct
    {
        uint32_t RESERVED0 : 1;
        __IO uint32_t ADDR : 7;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_i2c_addr2_field_t;

    typedef struct
    {
        __IO uint32_t AD0F : 1;
        __IO uint32_t AD1F : 1;
        __IO uint32_t AD2F : 1;
        uint32_t RESERVED3 : 28;
        __IO uint32_t RSV : 1;
    } stc_i2c_match_field_t;

    typedef struct
    {
        __IO uint32_t KR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_iwdt_kr_field_t;

    typedef struct
    {
        __IO uint32_t PRS : 4;
        __IO uint32_t IE : 1;
        __IO uint32_t ACTION : 1;
        __IO uint32_t PAUSE : 1;
        uint32_t RESERVED7 : 24;
        __IO uint32_t RSV : 1;
    } stc_iwdt_cr_field_t;

    typedef struct
    {
        __IO uint32_t ARR : 12;
        uint32_t RESERVED12 : 19;
        __IO uint32_t RSV : 1;
    } stc_iwdt_arr_field_t;

    typedef struct
    {
        __IO uint32_t PRSF : 1;
        __IO uint32_t ARRF : 1;
        __IO uint32_t WINRF : 1;
        __IO uint32_t OV : 1;
        __IO uint32_t RUN : 1;
        uint32_t RESERVED5 : 26;
        __IO uint32_t RSV : 1;
    } stc_iwdt_sr_field_t;

    typedef struct
    {
        __IO uint32_t WINR : 12;
        uint32_t RESERVED12 : 19;
        __IO uint32_t RSV : 1;
    } stc_iwdt_winr_field_t;

    typedef struct
    {
        __IO uint32_t DR : 8;
        __IO uint32_t DR8 : 1;
        uint32_t RESERVED9 : 22;
        __IO uint32_t RSV : 1;
    } stc_lpuart_dr_field_t;

    typedef struct
    {
        __IO uint32_t RCIE : 1;
        __IO uint32_t TCIE : 1;
        __IO uint32_t DR8CFG : 2;
        __IO uint32_t RXEN : 1;
        __IO uint32_t ADRDET : 1;
        __IO uint32_t MODE : 2;
        __IO uint32_t TXEIE : 1;
        __IO uint32_t OVER : 2;
        __IO uint32_t CLKSRC : 2;
        __IO uint32_t PEIE : 1;
        __IO uint32_t STOP : 2;
        uint32_t RESERVED16 : 2;
        __IO uint32_t RTSEN : 1;
        __IO uint32_t CTSEN : 1;
        __IO uint32_t CTSIE : 1;
        __IO uint32_t FEIE : 1;
        __IO uint32_t HDSEL : 1;
        uint32_t RESERVED23 : 8;
        __IO uint32_t RSV : 1;
    } stc_lpuart_cr_field_t;

    typedef struct
    {
        __IO uint32_t ADDR : 8;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_lpuart_addr_field_t;

    typedef struct
    {
        __IO uint32_t MASK : 8;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_lpuart_addrmask_field_t;

    typedef struct
    {
        __IO uint32_t RC : 1;
        __IO uint32_t TC : 1;
        __IO uint32_t FE : 1;
        __IO uint32_t TXE : 1;
        __IO uint32_t PE : 1;
        __IO uint32_t CTSIF : 1;
        __IO uint32_t CTS : 1;
        uint32_t RESERVED7 : 24;
        __IO uint32_t RSV : 1;
    } stc_lpuart_isr_field_t;

    typedef struct
    {
        __IO uint32_t RC : 1;
        __IO uint32_t TC : 1;
        __IO uint32_t FE : 1;
        uint32_t RESERVED3 : 1;
        __IO uint32_t PE : 1;
        __IO uint32_t CTSIF : 1;
        uint32_t RESERVED6 : 25;
        __IO uint32_t RSV : 1;
    } stc_lpuart_icr_field_t;

    typedef struct
    {
        __IO uint32_t SCNT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_lpuart_brr_field_t;

    typedef struct
    {
        __IO uint32_t EN : 1;
        __IO uint32_t ACT : 1;
        __IO uint32_t SOURCE : 2;
        __IO uint32_t VTDS : 4;
        __IO uint32_t FLTEN : 1;
        __IO uint32_t FLTTIME : 3;
        __IO uint32_t FTEN : 1;
        __IO uint32_t RTEN : 1;
        __IO uint32_t HTEN : 1;
        __IO uint32_t IE : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_lvd_cr_field_t;

    typedef struct
    {
        __IO uint32_t INTF : 1;
        __IO uint32_t FLTV : 1;
        uint32_t RESERVED2 : 29;
        __IO uint32_t RSV : 1;
    } stc_lvd_sr_field_t;

    typedef struct
    {
        __IO uint32_t EN : 1;
        __IO uint32_t BRR : 3;
        __IO uint32_t CPHA : 1;
        __IO uint32_t CPOL : 1;
        __IO uint32_t MSTR : 1;
        __IO uint32_t LSBF : 1;
        __IO uint32_t WIDTH : 4;
        __IO uint32_t SSM : 1;
        __IO uint32_t CM : 2;
        uint32_t RESERVED15 : 16;
        __IO uint32_t RSV : 1;
    } stc_spi_cr0_field_t;

    typedef struct
    {
        __IO uint32_t TXEIE : 1;
        __IO uint32_t RXNEIE : 1;
        __IO uint32_t SSFIE : 1;
        __IO uint32_t SSRIE : 1;
        __IO uint32_t UDFIE : 1;
        __IO uint32_t OVFIE : 1;
        __IO uint32_t SSERRIE : 1;
        __IO uint32_t MODFIE : 1;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_spi_cr1_field_t;

    typedef struct
    {
        __IO uint32_t HDOE : 1;
        uint32_t RESERVED1 : 30;
        __IO uint32_t RSV : 1;
    } stc_spi_hdoe_field_t;

    typedef struct
    {
        __IO uint32_t SSI : 1;
        uint32_t RESERVED1 : 30;
        __IO uint32_t RSV : 1;
    } stc_spi_ssi_field_t;

    typedef struct
    {
        __IO uint32_t TXE : 1;
        __IO uint32_t RXNE : 1;
        __IO uint32_t SSF : 1;
        __IO uint32_t SSR : 1;
        __IO uint32_t UDF : 1;
        __IO uint32_t OVF : 1;
        __IO uint32_t SSERR : 1;
        __IO uint32_t MODF : 1;
        __IO uint32_t BUSY : 1;
        __IO uint32_t SSLVL : 1;
        uint32_t RESERVED10 : 21;
        __IO uint32_t RSV : 1;
    } stc_spi_sr_field_t;

    typedef struct
    {
        __IO uint32_t TXE : 1;
        __IO uint32_t RXNE : 1;
        __IO uint32_t SSF : 1;
        __IO uint32_t SSR : 1;
        __IO uint32_t UDF : 1;
        __IO uint32_t OVF : 1;
        __IO uint32_t SSERR : 1;
        __IO uint32_t MODF : 1;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_spi_icr_field_t;

    typedef struct
    {
        __IO uint32_t DR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_spi_dr_field_t;

    typedef struct
    {
        __IO uint32_t CLKSRC : 3;
        __IO uint32_t HCLKPRS : 3;
        __IO uint32_t PCLKPRS : 2;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_cr0_field_t;

    typedef struct
    {
        __IO uint32_t SWDIO : 1;
        __IO uint32_t LOCKUP : 1;
        __IO uint32_t WAKEUPCLK : 1;
        __IO uint32_t RESIO : 1;
        uint32_t RESERVED4 : 4;
        __IO uint32_t GTIMCFG : 1;
        uint32_t RESERVED9 : 22;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_cr1_field_t;

    typedef struct
    {
        __IO uint32_t RCHEN : 1;
        uint32_t RESERVED1 : 1;
        __IO uint32_t RCLEN : 1;
        uint32_t RESERVED3 : 2;
        __IO uint32_t EXTCLKEN : 1;
        uint32_t RESERVED6 : 25;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_cr2_field_t;

    typedef struct
    {
        __IO uint32_t CR3 : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_cr3_field_t;

    typedef struct
    {
        __IO uint32_t TRIM : 9;
        __IO uint32_t DIV : 4;
        uint32_t RESERVED13 : 2;
        __IO uint32_t STABLE : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_rch_field_t;

    typedef struct
    {
        __IO uint32_t TRIM : 10;
        __IO uint32_t WAITCYCLE : 2;
        uint32_t RESERVED12 : 3;
        __IO uint32_t STABLE : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_rcl_field_t;

    typedef struct
    {
        uint32_t RESERVED0 : 2;
        __IO uint32_t LPUART0 : 1;
        __IO uint32_t LPUART1 : 1;
        __IO uint32_t I2C : 1;
        uint32_t RESERVED5 : 1;
        __IO uint32_t SPI : 1;
        uint32_t RESERVED7 : 4;
        __IO uint32_t ATIM3 : 1;
        uint32_t RESERVED12 : 3;
        __IO uint32_t IWDT : 1;
        __IO uint32_t ADC : 1;
        uint32_t RESERVED17 : 4;
        __IO uint32_t CTRIM : 1;
        uint32_t RESERVED22 : 9;
        __IO uint32_t FLASH : 1;
    } stc_sysctrl_periclken0_field_t;

    typedef struct
    {
        __IO uint32_t PA : 1;
        __IO uint32_t PB : 1;
        __IO uint32_t PC : 1;
        __IO uint32_t PD : 1;
        uint32_t RESERVED4 : 6;
        __IO uint32_t WWDT : 1;
        uint32_t RESERVED11 : 3;
        __IO uint32_t GTIM : 1;
        uint32_t RESERVED15 : 16;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_periclken1_field_t;

    typedef struct
    {
        uint32_t RESERVED0 : 2;
        __IO uint32_t LPUART0 : 1;
        __IO uint32_t LPUART1 : 1;
        __IO uint32_t I2C : 1;
        uint32_t RESERVED5 : 1;
        __IO uint32_t SPI : 1;
        uint32_t RESERVED7 : 4;
        __IO uint32_t ATIM3 : 1;
        uint32_t RESERVED12 : 4;
        __IO uint32_t ADC : 1;
        uint32_t RESERVED17 : 4;
        __IO uint32_t CTRIM : 1;
        uint32_t RESERVED22 : 9;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_perireset0_field_t;

    typedef struct
    {
        __IO uint32_t PA : 1;
        __IO uint32_t PB : 1;
        __IO uint32_t PC : 1;
        __IO uint32_t PD : 1;
        uint32_t RESERVED4 : 6;
        __IO uint32_t WWDT : 1;
        uint32_t RESERVED11 : 3;
        __IO uint32_t GTIM : 1;
        uint32_t RESERVED15 : 16;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_perireset1_field_t;

    typedef struct
    {
        __IO uint32_t VCC : 1;
        __IO uint32_t VCORE : 1;
        __IO uint32_t LVD : 1;
        __IO uint32_t IWDT : 1;
        __IO uint32_t WWDT : 1;
        __IO uint32_t LOCKUP : 1;
        __IO uint32_t SYSREQ : 1;
        __IO uint32_t RSTB : 1;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_resetflag_field_t;

    typedef struct
    {
        uint32_t RESERVED0 : 7;
        __IO uint32_t CTRIM : 1;
        __IO uint32_t IWDT : 1;
        uint32_t RESERVED9 : 2;
        __IO uint32_t ATIM3 : 1;
        uint32_t RESERVED12 : 2;
        __IO uint32_t GTIM : 1;
        uint32_t RESERVED15 : 1;
        __IO uint32_t WWDT : 1;
        uint32_t RESERVED17 : 14;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_debugactive_field_t;

    typedef struct
    {
        __IO uint32_t WCNT : 7;
        __IO uint32_t EN : 1;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_wwdt_cr0_field_t;

    typedef struct
    {
        __IO uint32_t WINR : 7;
        uint32_t RESERVED7 : 2;
        __IO uint32_t IE : 1;
        uint32_t RESERVED10 : 1;
        __IO uint32_t PRS : 3;
        uint32_t RESERVED14 : 17;
        __IO uint32_t RSV : 1;
    } stc_wwdt_cr1_field_t;

    typedef struct
    {
        __IO uint32_t POV : 1;
        uint32_t RESERVED1 : 30;
        __IO uint32_t RSV : 1;
    } stc_wwdt_sr_field_t;

    typedef struct
    {
        uint8_t RESERVED0[4];
        union
        {
            __IO uint32_t CR0;
            stc_adc_cr0_field_t CR0_f;
        };
        union
        {
            __IO uint32_t CR1;
            stc_adc_cr1_field_t CR1_f;
        };
        uint8_t RESERVED2[148];
        union
        {
            __IO uint32_t RESULT;
            stc_adc_result_field_t RESULT_f;
        };
        uint8_t RESERVED3[12];
        union
        {
            __IO uint32_t IFR;
            stc_adc_ifr_field_t IFR_f;
        };
        union
        {
            __IO uint32_t IER;
            stc_adc_ier_field_t IER_f;
        };
        union
        {
            __IO uint32_t ICR;
            stc_adc_icr_field_t ICR_f;
        };
        union
        {
            __IO uint32_t EXTTRIGGER;
            stc_adc_exttrigger_field_t EXTTRIGGER_f;
        };
        union
        {
            __IO uint32_t START;
            stc_adc_start_field_t START_f;
        };
        uint8_t RESERVED8[8];
        union
        {
            __IO uint32_t ALLSTART;
            stc_adc_allstart_field_t ALLSTART_f;
        };
    } ADC_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t ARR;
            stc_atim3mode0_arr_field_t ARR_f;
        };
        union
        {
            __IO uint32_t CNT;
            stc_atim3mode0_cnt_field_t CNT_f;
        };
        union
        {
            __IO uint32_t CNT32;
            stc_atim3mode0_cnt32_field_t CNT32_f;
        };
        union
        {
            __IO uint32_t M0CR;
            stc_atim3mode0_m0cr_field_t M0CR_f;
        };
        union
        {
            __IO uint32_t IFR;
            stc_atim3mode0_ifr_field_t IFR_f;
        };
        union
        {
            __IO uint32_t ICLR;
            stc_atim3mode0_iclr_field_t ICLR_f;
        };
        uint8_t RESERVED6[24];
        union
        {
            __IO uint32_t DTR;
            stc_atim3mode0_dtr_field_t DTR_f;
        };
    } ATIM3MODE0_TypeDef;

    typedef struct
    {
        uint8_t RESERVED0[4];
        union
        {
            __IO uint32_t CNT;
            stc_atim3mode1_cnt_field_t CNT_f;
        };
        uint8_t RESERVED1[4];
        union
        {
            __IO uint32_t M1CR;
            stc_atim3mode1_m1cr_field_t M1CR_f;
        };
        union
        {
            __IO uint32_t IFR;
            stc_atim3mode1_ifr_field_t IFR_f;
        };
        union
        {
            __IO uint32_t ICLR;
            stc_atim3mode1_iclr_field_t ICLR_f;
        };
        union
        {
            __IO uint32_t MSCR;
            stc_atim3mode1_mscr_field_t MSCR_f;
        };
        union
        {
            __IO uint32_t FLTR;
            stc_atim3mode1_fltr_field_t FLTR_f;
        };
        uint8_t RESERVED6[4];
        union
        {
            __IO uint32_t CR0;
            stc_atim3mode1_cr0_field_t CR0_f;
        };
        uint8_t RESERVED7[20];
        union
        {
            __IO uint32_t CCR0A;
            stc_atim3mode1_ccr0a_field_t CCR0A_f;
        };
    } ATIM3MODE1_TypeDef;

