kepler-444b/HC32F002/mcu/common/HC32F002.h
    typedef struct
    {
        union
        {
            __IO uint32_t ARR;
            stc_atim3mode23_arr_field_t ARR_f;
        };
        union
        {
            __IO uint32_t CNT;
            stc_atim3mode23_cnt_field_t CNT_f;
        };
        uint8_t RESERVED2[4];
        union
        {
            __IO uint32_t M23CR;
            stc_atim3mode23_m23cr_field_t M23CR_f;
        };
        union
        {
            __IO uint32_t IFR;
            stc_atim3mode23_ifr_field_t IFR_f;
        };
        union
        {
            __IO uint32_t ICLR;
            stc_atim3mode23_iclr_field_t ICLR_f;
        };
        union
        {
            __IO uint32_t MSCR;
            stc_atim3mode23_mscr_field_t MSCR_f;
        };
        union
        {
            __IO uint32_t FLTR;
            stc_atim3mode23_fltr_field_t FLTR_f;
        };
        union
        {
            __IO uint32_t ADTR;
            stc_atim3mode23_adtr_field_t ADTR_f;
        };
        union
        {
            __IO uint32_t CRCH0;
            stc_atim3mode23_crch0_field_t CRCH0_f;
        };
        union
        {
            __IO uint32_t CRCH1;
            stc_atim3mode23_crch1_field_t CRCH1_f;
        };
        union
        {
            __IO uint32_t CRCH2;
            stc_atim3mode23_crch2_field_t CRCH2_f;
        };
        union
        {
            __IO uint32_t DTR;
            stc_atim3mode23_dtr_field_t DTR_f;
        };
        union
        {
            __IO uint32_t RCR;
            stc_atim3mode23_rcr_field_t RCR_f;
        };
        uint8_t RESERVED13[4];
        union
        {
            __IO uint32_t CCR0A;
            stc_atim3mode23_ccr0a_field_t CCR0A_f;
        };
        union
        {
            __IO uint32_t CCR0B;
            stc_atim3mode23_ccr0b_field_t CCR0B_f;
        };
        union
        {
            __IO uint32_t CCR1A;
            stc_atim3mode23_ccr1a_field_t CCR1A_f;
        };
        union
        {
            __IO uint32_t CCR1B;
            stc_atim3mode23_ccr1b_field_t CCR1B_f;
        };
        union
        {
            __IO uint32_t CCR2A;
            stc_atim3mode23_ccr2a_field_t CCR2A_f;
        };
        union
        {
            __IO uint32_t CCR2B;
            stc_atim3mode23_ccr2b_field_t CCR2B_f;
        };
        union
        {
            __IO uint32_t CCR3;
            stc_atim3mode23_ccr3_field_t CCR3_f;
        };
        union
        {
            __IO uint32_t CRCH3;
            stc_atim3mode23_crch3_field_t CRCH3_f;
        };
    } ATIM3MODE23_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t ARR;
            stc_btim_arr_field_t ARR_f;
        };
        union
        {
            __IO uint32_t CNT;
            stc_btim_cnt_field_t CNT_f;
        };
        uint8_t RESERVED2[8];
        union
        {
            __IO uint32_t CR;
            stc_btim_cr_field_t CR_f;
        };
        union
        {
            __IO uint32_t IER;
            stc_btim_ier_field_t IER_f;
        };
        union
        {
            __IO uint32_t IFR;
            stc_btim_ifr_field_t IFR_f;
        };
        union
        {
            __IO uint32_t ICR;
            stc_btim_icr_field_t ICR_f;
        };
        uint8_t RESERVED6[40];
        union
        {
            __IO uint32_t AIFR;
            stc_btim_aifr_field_t AIFR_f;
        };
        union
        {
            __IO uint32_t AICR;
            stc_btim_aicr_field_t AICR_f;
        };
    } BTIM_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t ARR;
            stc_ctrim_arr_field_t ARR_f;
        };
        union
        {
            __IO uint32_t CNT;
            stc_ctrim_cnt_field_t CNT_f;
        };
        uint8_t RESERVED2[4];
        union
        {
            __IO uint32_t CR0;
            stc_ctrim_cr0_field_t CR0_f;
        };
        union
        {
            __IO uint32_t CR1;
            stc_ctrim_cr1_field_t CR1_f;
        };
        union
        {
            __IO uint32_t IER;
            stc_ctrim_ier_field_t IER_f;
        };
        union
        {
            __IO uint32_t ISR;
            stc_ctrim_isr_field_t ISR_f;
        };
        union
        {
            __IO uint32_t ICR;
            stc_ctrim_icr_field_t ICR_f;
        };
        union
        {
            __IO uint32_t FCAP;
            stc_ctrim_fcap_field_t FCAP_f;
        };
        union
        {
            __IO uint32_t TVAL;
            stc_ctrim_tval_field_t TVAL_f;
        };
        union
        {
            __IO uint32_t FLIM;
            stc_ctrim_flim_field_t FLIM_f;
        };
    } CTRIM_TypeDef;

    typedef struct
    {
        uint8_t RESERVED0[32];
        union
        {
            __IO uint32_t CR;
            stc_flash_cr_field_t CR_f;
        };
        union
        {
            __IO uint32_t IFR;
            stc_flash_ifr_field_t IFR_f;
        };
        union
        {
            __IO uint32_t ICLR;
            stc_flash_iclr_field_t ICLR_f;
        };
        union
        {
            __IO uint32_t BYPASS;
            stc_flash_bypass_field_t BYPASS_f;
        };
        union
        {
            __IO uint32_t SLOCK;
            stc_flash_slock_field_t SLOCK_f;
        };
        uint8_t RESERVED5[28];
        union
        {
            __IO uint32_t WAIT;
            stc_flash_wait_field_t WAIT_f;
        };
        union
        {
            __IO uint32_t LOCKSTATE;
            stc_flash_lockstate_field_t LOCKSTATE_f;
        };
    } FLASH_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t ADS;
            stc_gpio_ads_field_t ADS_f;
        };
        union
        {
            __IO uint32_t DIR;
            stc_gpio_dir_field_t DIR_f;
        };
        union
        {
            __IO uint32_t OPENDRAIN;
            stc_gpio_opendrain_field_t OPENDRAIN_f;
        };
        uint8_t RESERVED3[12];
        union
        {
            __IO uint32_t PU;
            stc_gpio_pu_field_t PU_f;
        };
        union
        {
            __IO uint32_t IN;
            stc_gpio_in_field_t IN_f;
        };
        union
        {
            __IO uint32_t OUT;
            stc_gpio_out_field_t OUT_f;
        };
        union
        {
            __IO uint32_t BRR;
            stc_gpio_brr_field_t BRR_f;
        };
        union
        {
            __IO uint32_t BSRR;
            stc_gpio_bsrr_field_t BSRR_f;
        };
        uint8_t RESERVED8[4];
        union
        {
            __IO uint32_t AFRL;
            stc_gpio_afrl_field_t AFRL_f;
        };
        uint8_t RESERVED9[4];
        union
        {
            __IO uint32_t HIGHIE;
            stc_gpio_highie_field_t HIGHIE_f;
        };
        union
        {
            __IO uint32_t LOWIE;
            stc_gpio_lowie_field_t LOWIE_f;
        };
        union
        {
            __IO uint32_t RISEIE;
            stc_gpio_riseie_field_t RISEIE_f;
        };
        union
        {
            __IO uint32_t FALLIE;
            stc_gpio_fallie_field_t FALLIE_f;
        };
        union
        {
            __IO uint32_t IFR;
            stc_gpio_ifr_field_t IFR_f;
        };
        union
        {
            __IO uint32_t ICR;
            stc_gpio_icr_field_t ICR_f;
        };
    } GPIO_TypeDef;

    typedef struct
    {
        uint8_t RESERVED0[4];
        union
        {
            __IO uint32_t CR1;
            stc_gpioaux_cr1_field_t CR1_f;
        };
        uint8_t RESERVED1[8];
        union
        {
            __IO uint32_t CR4;
            stc_gpioaux_cr4_field_t CR4_f;
        };
    } GPIOAUX_TypeDef;

    typedef struct
    {
        uint8_t RESERVED0[768];
        union
        {
            __IO uint32_t ARR;
            stc_gtim_arr_field_t ARR_f;
        };
        union
        {
            __IO uint32_t CNT;
            stc_gtim_cnt_field_t CNT_f;
        };
        union
        {
            __IO uint32_t CMMR;
            stc_gtim_cmmr_field_t CMMR_f;
        };
        union
        {
            __IO uint32_t CR1;
            stc_gtim_cr1_field_t CR1_f;
        };
        union
        {
            __IO uint32_t CR0;
            stc_gtim_cr0_field_t CR0_f;
        };
        union
        {
            __IO uint32_t IER;
            stc_gtim_ier_field_t IER_f;
        };
        union
        {
            __IO uint32_t IFR;
            stc_gtim_ifr_field_t IFR_f;
        };
        union
        {
            __IO uint32_t ICR;
            stc_gtim_icr_field_t ICR_f;
        };
        union
        {
            __IO uint32_t CCR0;
            stc_gtim_ccr0_field_t CCR0_f;
        };
        union
        {
            __IO uint32_t CCR1;
            stc_gtim_ccr1_field_t CCR1_f;
        };
        union
        {
            __IO uint32_t CCR2;
            stc_gtim_ccr2_field_t CCR2_f;
        };
        union
        {
            __IO uint32_t CCR3;
            stc_gtim_ccr3_field_t CCR3_f;
        };
    } GTIM_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t BRREN;
            stc_i2c_brren_field_t BRREN_f;
        };
        union
        {
            __IO uint32_t BRR;
            stc_i2c_brr_field_t BRR_f;
        };
        union
        {
            __IO uint32_t CR;
            stc_i2c_cr_field_t CR_f;
        };
        union
        {
            __IO uint32_t DR;
            stc_i2c_dr_field_t DR_f;
        };
        union
        {
            __IO uint32_t ADDR0;
            stc_i2c_addr0_field_t ADDR0_f;
        };
        union
        {
            __IO uint32_t STAT;
            stc_i2c_stat_field_t STAT_f;
        };
        uint8_t RESERVED6[8];
        union
        {
            __IO uint32_t ADDR1;
            stc_i2c_addr1_field_t ADDR1_f;
        };
        union
        {
            __IO uint32_t ADDR2;
            stc_i2c_addr2_field_t ADDR2_f;
        };
        union
        {
            __IO uint32_t MATCH;
            stc_i2c_match_field_t MATCH_f;
        };
    } I2C_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t KR;
            stc_iwdt_kr_field_t KR_f;
        };
        union
        {
            __IO uint32_t CR;
            stc_iwdt_cr_field_t CR_f;
        };
        union
        {
            __IO uint32_t ARR;
            stc_iwdt_arr_field_t ARR_f;
        };
        union
        {
            __IO uint32_t SR;
            stc_iwdt_sr_field_t SR_f;
        };
        union
        {
            __IO uint32_t WINR;
            stc_iwdt_winr_field_t WINR_f;
        };
    } IWDT_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t DR;
            stc_lpuart_dr_field_t DR_f;
        };
        union
        {
            __IO uint32_t CR;
            stc_lpuart_cr_field_t CR_f;
        };
        union
        {
            __IO uint32_t ADDR;
            stc_lpuart_addr_field_t ADDR_f;
        };
        union
        {
            __IO uint32_t ADDRMASK;
            stc_lpuart_addrmask_field_t ADDRMASK_f;
        };
        union
        {
            __IO uint32_t ISR;
            stc_lpuart_isr_field_t ISR_f;
        };
        union
        {
            __IO uint32_t ICR;
            stc_lpuart_icr_field_t ICR_f;
        };
        union
        {
            __IO uint32_t BRR;
            stc_lpuart_brr_field_t BRR_f;
        };
    } LPUART_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t CR;
            stc_lvd_cr_field_t CR_f;
        };
        union
        {
            __IO uint32_t SR;
            stc_lvd_sr_field_t SR_f;
        };
    } LVD_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t CR0;
            stc_spi_cr0_field_t CR0_f;
        };
        union
        {
            __IO uint32_t CR1;
            stc_spi_cr1_field_t CR1_f;
        };
        union
        {
            __IO uint32_t HDOE;
            stc_spi_hdoe_field_t HDOE_f;
        };
        union
        {
            __IO uint32_t SSI;
            stc_spi_ssi_field_t SSI_f;
        };
        union
        {
            __IO uint32_t SR;
            stc_spi_sr_field_t SR_f;
        };
        union
        {
            __IO uint32_t ICR;
            stc_spi_icr_field_t ICR_f;
        };
        union
        {
            __IO uint32_t DR;
            stc_spi_dr_field_t DR_f;
        };
    } SPI_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t CR0;
            stc_sysctrl_cr0_field_t CR0_f;
        };
        union
        {
            __IO uint32_t CR1;
            stc_sysctrl_cr1_field_t CR1_f;
        };
        union
        {
            __IO uint32_t CR2;
            stc_sysctrl_cr2_field_t CR2_f;
        };
        union
        {
            __IO uint32_t CR3;
            stc_sysctrl_cr3_field_t CR3_f;
        };
        union
        {
            __IO uint32_t RCH;
            stc_sysctrl_rch_field_t RCH_f;
        };
        uint8_t RESERVED5[4];
        union
        {
            __IO uint32_t RCL;
            stc_sysctrl_rcl_field_t RCL_f;
        };
        uint8_t RESERVED6[20];
        union
        {
            __IO uint32_t PERICLKEN0;
            stc_sysctrl_periclken0_field_t PERICLKEN0_f;
        };
        union
        {
            __IO uint32_t PERICLKEN1;
            stc_sysctrl_periclken1_field_t PERICLKEN1_f;
        };
        union
        {
            __IO uint32_t PERIRESET0;
            stc_sysctrl_perireset0_field_t PERIRESET0_f;
        };
        union
        {
            __IO uint32_t PERIRESET1;
            stc_sysctrl_perireset1_field_t PERIRESET1_f;
        };
        union
        {
            __IO uint32_t RESETFLAG;
            stc_sysctrl_resetflag_field_t RESETFLAG_f;
        };
        union
        {
            __IO uint32_t DEBUGACTIVE;
            stc_sysctrl_debugactive_field_t DEBUGACTIVE_f;
        };
    } SYSCTRL_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t CR0;
            stc_wwdt_cr0_field_t CR0_f;
        };
        union
        {
            __IO uint32_t CR1;
            stc_wwdt_cr1_field_t CR1_f;
        };
        union
        {
            __IO uint32_t SR;
            stc_wwdt_sr_field_t SR_f;
        };
    } WWDT_TypeDef;

