kepler-444b/HC32F002/mcu/common/HC32F002.h
#define PERIPH_BASE (0x40000000UL)
#define ADC_BASE (PERIPH_BASE + 0x00002400UL)
#define ATIM3MODE0_BASE (PERIPH_BASE + 0x00005800UL)
#define ATIM3MODE1_BASE (PERIPH_BASE + 0x00005800UL)
#define ATIM3MODE23_BASE (PERIPH_BASE + 0x00005800UL)
#define BTIM3_BASE (PERIPH_BASE + 0x00007400UL)
#define BTIM4_BASE (PERIPH_BASE + 0x00007500UL)
#define BTIM5_BASE (PERIPH_BASE + 0x00007600UL)
#define CTRIM_BASE (PERIPH_BASE + 0x00005000UL)
#define FLASH_BASE (PERIPH_BASE + 0x00020000UL)
#define GPIOA_BASE (PERIPH_BASE + 0x00020C00UL)
#define GPIOAUX_BASE (PERIPH_BASE + 0x00020CA0UL)
#define GPIOB_BASE (PERIPH_BASE + 0x00020D00UL)
#define GPIOC_BASE (PERIPH_BASE + 0x00020E00UL)
#define GPIOD_BASE (PERIPH_BASE + 0x00020F00UL)
#define GTIM_BASE (PERIPH_BASE + 0x00007400UL)
#define I2C_BASE (PERIPH_BASE + 0x00000400UL)
#define IWDT_BASE (PERIPH_BASE + 0x00000F80UL)
#define LPUART0_BASE (PERIPH_BASE + 0x00000000UL)
#define LPUART1_BASE (PERIPH_BASE + 0x00004000UL)
#define LVD_BASE (PERIPH_BASE + 0x00002680UL)
#define SPI_BASE (PERIPH_BASE + 0x00000800UL)
#define SYSCTRL_BASE (PERIPH_BASE + 0x00002000UL)
#define WWDT_BASE (PERIPH_BASE + 0x00006800UL)

#define ADC ((ADC_TypeDef *)0x40002400UL)
#define ATIM3MODE0 ((ATIM3MODE0_TypeDef *)0x40005800UL)
#define ATIM3MODE1 ((ATIM3MODE1_TypeDef *)0x40005800UL)
#define ATIM3MODE23 ((ATIM3MODE23_TypeDef *)0x40005800UL)
#define BTIM3 ((BTIM_TypeDef *)0x40007400UL)
#define BTIM4 ((BTIM_TypeDef *)0x40007500UL)
#define BTIM5 ((BTIM_TypeDef *)0x40007600UL)
#define CTRIM ((CTRIM_TypeDef *)0x40005000UL)
#define FLASH ((FLASH_TypeDef *)0x40020000UL)
#define GPIOA ((GPIO_TypeDef *)0x40020C00UL)
#define GPIOAUX ((GPIOAUX_TypeDef *)0x40020CA0UL)
#define GPIOB ((GPIO_TypeDef *)0x40020D00UL)
#define GPIOC ((GPIO_TypeDef *)0x40020E00UL)
#define GPIOD ((GPIO_TypeDef *)0x40020F00UL)
#define GTIM ((GTIM_TypeDef *)0x40007400UL)
#define I2C ((I2C_TypeDef *)0x40000400UL)
#define IWDT ((IWDT_TypeDef *)0x40000F80UL)
#define LPUART0 ((LPUART_TypeDef *)0x40000000UL)
#define LPUART1 ((LPUART_TypeDef *)0x40004000UL)
#define LVD ((LVD_TypeDef *)0x40002680UL)
#define SPI ((SPI_TypeDef *)0x40000800UL)
#define SYSCTRL ((SYSCTRL_TypeDef *)0x40002000UL)
#define WWDT ((WWDT_TypeDef *)0x40006800UL)

//********************    Bits Define For Peripheral ADC    ********************//
// ADC_CR0
#define ADC_CR0_EN_Pos (0U)
#define ADC_CR0_EN_Msk (0x1UL << ADC_CR0_EN_Pos)
#define ADC_CR0_EN ADC_CR0_EN_Msk
#define ADC_CR0_CKDIV_Pos (2U)
#define ADC_CR0_CKDIV_Msk (0x7UL << ADC_CR0_CKDIV_Pos)
#define ADC_CR0_CKDIV ADC_CR0_CKDIV_Msk
#define ADC_CR0_REF_Pos (9U)
#define ADC_CR0_REF_Msk (0x3UL << ADC_CR0_REF_Pos)
#define ADC_CR0_REF ADC_CR0_REF_Msk
#define ADC_CR0_SAM_Pos (12U)
#define ADC_CR0_SAM_Msk (0x3UL << ADC_CR0_SAM_Pos)
#define ADC_CR0_SAM ADC_CR0_SAM_Msk

// ADC_CR1
#define ADC_CR1_CHSEL_Pos (0U)
#define ADC_CR1_CHSEL_Msk (0xFUL << ADC_CR1_CHSEL_Pos)
#define ADC_CR1_CHSEL ADC_CR1_CHSEL_Msk

// ADC_RESULT
#define ADC_RESULT_RESULT_Pos (0U)
#define ADC_RESULT_RESULT_Msk (0xFFFFUL << ADC_RESULT_RESULT_Pos)
#define ADC_RESULT_RESULT ADC_RESULT_RESULT_Msk

// ADC_IFR
#define ADC_IFR_EOC_Pos (0U)
#define ADC_IFR_EOC_Msk (0x1UL << ADC_IFR_EOC_Pos)
#define ADC_IFR_EOC ADC_IFR_EOC_Msk

// ADC_IER
#define ADC_IER_EOC_Pos (0U)
#define ADC_IER_EOC_Msk (0x1UL << ADC_IER_EOC_Pos)
#define ADC_IER_EOC ADC_IER_EOC_Msk

// ADC_ICR
#define ADC_ICR_EOC_Pos (0U)
#define ADC_ICR_EOC_Msk (0x1UL << ADC_ICR_EOC_Pos)
#define ADC_ICR_EOC ADC_ICR_EOC_Msk

// ADC_EXTTRIGGER
#define ADC_EXTTRIGGER_TRIGSEL_Pos (0U)
#define ADC_EXTTRIGGER_TRIGSEL_Msk (0xFUL << ADC_EXTTRIGGER_TRIGSEL_Pos)
#define ADC_EXTTRIGGER_TRIGSEL ADC_EXTTRIGGER_TRIGSEL_Msk

// ADC_START
#define ADC_START_START_Pos (0U)
#define ADC_START_START_Msk (0x1UL << ADC_START_START_Pos)
#define ADC_START_START ADC_START_START_Msk

// ADC_ALLSTART
#define ADC_ALLSTART_START_Pos (0U)
#define ADC_ALLSTART_START_Msk (0x1UL << ADC_ALLSTART_START_Pos)
#define ADC_ALLSTART_START ADC_ALLSTART_START_Msk

//********************    Bits Define For Peripheral ATIM3MODE0    ********************//
// ATIM3MODE0_ARR
#define ATIM3MODE0_ARR_ARR_Pos (0U)
#define ATIM3MODE0_ARR_ARR_Msk (0xFFFFUL << ATIM3MODE0_ARR_ARR_Pos)
#define ATIM3MODE0_ARR_ARR ATIM3MODE0_ARR_ARR_Msk

// ATIM3MODE0_CNT
#define ATIM3MODE0_CNT_CNT_Pos (0U)
#define ATIM3MODE0_CNT_CNT_Msk (0xFFFFUL << ATIM3MODE0_CNT_CNT_Pos)
#define ATIM3MODE0_CNT_CNT ATIM3MODE0_CNT_CNT_Msk

// ATIM3MODE0_CNT32
#define ATIM3MODE0_CNT32_CNT32_Pos (0U)
#define ATIM3MODE0_CNT32_CNT32_Msk (0xFFFFFFFFUL << ATIM3MODE0_CNT32_CNT32_Pos)
#define ATIM3MODE0_CNT32_CNT32 ATIM3MODE0_CNT32_CNT32_Msk

// ATIM3MODE0_M0CR
#define ATIM3MODE0_M0CR_CEN_Pos (0U)
#define ATIM3MODE0_M0CR_CEN_Msk (0x1UL << ATIM3MODE0_M0CR_CEN_Pos)
#define ATIM3MODE0_M0CR_CEN ATIM3MODE0_M0CR_CEN_Msk
#define ATIM3MODE0_M0CR_MD_Pos (1U)
#define ATIM3MODE0_M0CR_MD_Msk (0x1UL << ATIM3MODE0_M0CR_MD_Pos)
#define ATIM3MODE0_M0CR_MD ATIM3MODE0_M0CR_MD_Msk
#define ATIM3MODE0_M0CR_CT_Pos (2U)
#define ATIM3MODE0_M0CR_CT_Msk (0x1UL << ATIM3MODE0_M0CR_CT_Pos)
#define ATIM3MODE0_M0CR_CT ATIM3MODE0_M0CR_CT_Msk
#define ATIM3MODE0_M0CR_TOG_Pos (3U)
#define ATIM3MODE0_M0CR_TOG_Msk (0x1UL << ATIM3MODE0_M0CR_TOG_Pos)
#define ATIM3MODE0_M0CR_TOG ATIM3MODE0_M0CR_TOG_Msk
#define ATIM3MODE0_M0CR_PRS_Pos (4U)
#define ATIM3MODE0_M0CR_PRS_Msk (0x7UL << ATIM3MODE0_M0CR_PRS_Pos)
#define ATIM3MODE0_M0CR_PRS ATIM3MODE0_M0CR_PRS_Msk
#define ATIM3MODE0_M0CR_GATE_Pos (8U)
#define ATIM3MODE0_M0CR_GATE_Msk (0x1UL << ATIM3MODE0_M0CR_GATE_Pos)
#define ATIM3MODE0_M0CR_GATE ATIM3MODE0_M0CR_GATE_Msk
#define ATIM3MODE0_M0CR_GATEP_Pos (9U)
#define ATIM3MODE0_M0CR_GATEP_Msk (0x1UL << ATIM3MODE0_M0CR_GATEP_Pos)
#define ATIM3MODE0_M0CR_GATEP ATIM3MODE0_M0CR_GATEP_Msk
#define ATIM3MODE0_M0CR_UI_Pos (10U)
#define ATIM3MODE0_M0CR_UI_Msk (0x1UL << ATIM3MODE0_M0CR_UI_Pos)
#define ATIM3MODE0_M0CR_UI ATIM3MODE0_M0CR_UI_Msk
#define ATIM3MODE0_M0CR_MODE_Pos (12U)
#define ATIM3MODE0_M0CR_MODE_Msk (0x3UL << ATIM3MODE0_M0CR_MODE_Pos)
#define ATIM3MODE0_M0CR_MODE ATIM3MODE0_M0CR_MODE_Msk

// ATIM3MODE0_IFR
#define ATIM3MODE0_IFR_UI_Pos (0U)
#define ATIM3MODE0_IFR_UI_Msk (0x1UL << ATIM3MODE0_IFR_UI_Pos)
#define ATIM3MODE0_IFR_UI ATIM3MODE0_IFR_UI_Msk

// ATIM3MODE0_ICLR
#define ATIM3MODE0_ICLR_UI_Pos (0U)
#define ATIM3MODE0_ICLR_UI_Msk (0x1UL << ATIM3MODE0_ICLR_UI_Pos)
#define ATIM3MODE0_ICLR_UI ATIM3MODE0_ICLR_UI_Msk

// ATIM3MODE0_DTR
#define ATIM3MODE0_DTR_MO_Pos (12U)
#define ATIM3MODE0_DTR_MO_Msk (0x1UL << ATIM3MODE0_DTR_MO_Pos)
#define ATIM3MODE0_DTR_MO ATIM3MODE0_DTR_MO_Msk

//********************    Bits Define For Peripheral ATIM3MODE1    ********************//
// ATIM3MODE1_CNT
#define ATIM3MODE1_CNT_CNT_Pos (0U)
#define ATIM3MODE1_CNT_CNT_Msk (0xFFFFUL << ATIM3MODE1_CNT_CNT_Pos)
#define ATIM3MODE1_CNT_CNT ATIM3MODE1_CNT_CNT_Msk

