kepler-444b/HC32F002/mcu/common/HC32F002.h
// ATIM3MODE1_M1CR
#define ATIM3MODE1_M1CR_CEN_Pos (0U)
#define ATIM3MODE1_M1CR_CEN_Msk (0x1UL << ATIM3MODE1_M1CR_CEN_Pos)
#define ATIM3MODE1_M1CR_CEN ATIM3MODE1_M1CR_CEN_Msk
#define ATIM3MODE1_M1CR_CT_Pos (2U)
#define ATIM3MODE1_M1CR_CT_Msk (0x1UL << ATIM3MODE1_M1CR_CT_Pos)
#define ATIM3MODE1_M1CR_CT ATIM3MODE1_M1CR_CT_Msk
#define ATIM3MODE1_M1CR_PRS_Pos (4U)
#define ATIM3MODE1_M1CR_PRS_Msk (0x7UL << ATIM3MODE1_M1CR_PRS_Pos)
#define ATIM3MODE1_M1CR_PRS ATIM3MODE1_M1CR_PRS_Msk
#define ATIM3MODE1_M1CR_EDG1ST_Pos (8U)
#define ATIM3MODE1_M1CR_EDG1ST_Msk (0x1UL << ATIM3MODE1_M1CR_EDG1ST_Pos)
#define ATIM3MODE1_M1CR_EDG1ST ATIM3MODE1_M1CR_EDG1ST_Msk
#define ATIM3MODE1_M1CR_EDG2ND_Pos (9U)
#define ATIM3MODE1_M1CR_EDG2ND_Msk (0x1UL << ATIM3MODE1_M1CR_EDG2ND_Pos)
#define ATIM3MODE1_M1CR_EDG2ND ATIM3MODE1_M1CR_EDG2ND_Msk
#define ATIM3MODE1_M1CR_UI_Pos (10U)
#define ATIM3MODE1_M1CR_UI_Msk (0x1UL << ATIM3MODE1_M1CR_UI_Pos)
#define ATIM3MODE1_M1CR_UI ATIM3MODE1_M1CR_UI_Msk
#define ATIM3MODE1_M1CR_MODE_Pos (12U)
#define ATIM3MODE1_M1CR_MODE_Msk (0x3UL << ATIM3MODE1_M1CR_MODE_Pos)
#define ATIM3MODE1_M1CR_MODE ATIM3MODE1_M1CR_MODE_Msk
#define ATIM3MODE1_M1CR_ONESHOT_Pos (14U)
#define ATIM3MODE1_M1CR_ONESHOT_Msk (0x1UL << ATIM3MODE1_M1CR_ONESHOT_Pos)
#define ATIM3MODE1_M1CR_ONESHOT ATIM3MODE1_M1CR_ONESHOT_Msk

// ATIM3MODE1_IFR
#define ATIM3MODE1_IFR_UI_Pos (0U)
#define ATIM3MODE1_IFR_UI_Msk (0x1UL << ATIM3MODE1_IFR_UI_Pos)
#define ATIM3MODE1_IFR_UI ATIM3MODE1_IFR_UI_Msk
#define ATIM3MODE1_IFR_PWC_Pos (2U)
#define ATIM3MODE1_IFR_PWC_Msk (0x1UL << ATIM3MODE1_IFR_PWC_Pos)
#define ATIM3MODE1_IFR_PWC ATIM3MODE1_IFR_PWC_Msk

// ATIM3MODE1_ICLR
#define ATIM3MODE1_ICLR_UI_Pos (0U)
#define ATIM3MODE1_ICLR_UI_Msk (0x1UL << ATIM3MODE1_ICLR_UI_Pos)
#define ATIM3MODE1_ICLR_UI ATIM3MODE1_ICLR_UI_Msk
#define ATIM3MODE1_ICLR_CA0_Pos (2U)
#define ATIM3MODE1_ICLR_CA0_Msk (0x1UL << ATIM3MODE1_ICLR_CA0_Pos)
#define ATIM3MODE1_ICLR_CA0 ATIM3MODE1_ICLR_CA0_Msk

// ATIM3MODE1_MSCR
#define ATIM3MODE1_MSCR_TS_Pos (5U)
#define ATIM3MODE1_MSCR_TS_Msk (0x7UL << ATIM3MODE1_MSCR_TS_Pos)
#define ATIM3MODE1_MSCR_TS ATIM3MODE1_MSCR_TS_Msk
#define ATIM3MODE1_MSCR_IA0S_Pos (11U)
#define ATIM3MODE1_MSCR_IA0S_Msk (0x1UL << ATIM3MODE1_MSCR_IA0S_Pos)
#define ATIM3MODE1_MSCR_IA0S ATIM3MODE1_MSCR_IA0S_Msk
#define ATIM3MODE1_MSCR_IB0S_Pos (12U)
#define ATIM3MODE1_MSCR_IB0S_Msk (0x1UL << ATIM3MODE1_MSCR_IB0S_Pos)
#define ATIM3MODE1_MSCR_IB0S ATIM3MODE1_MSCR_IB0S_Msk

// ATIM3MODE1_FLTR
#define ATIM3MODE1_FLTR_FLTA0_Pos (0U)
#define ATIM3MODE1_FLTR_FLTA0_Msk (0x7UL << ATIM3MODE1_FLTR_FLTA0_Pos)
#define ATIM3MODE1_FLTR_FLTA0 ATIM3MODE1_FLTR_FLTA0_Msk
#define ATIM3MODE1_FLTR_FLTB0_Pos (4U)
#define ATIM3MODE1_FLTR_FLTB0_Msk (0x7UL << ATIM3MODE1_FLTR_FLTB0_Pos)
#define ATIM3MODE1_FLTR_FLTB0 ATIM3MODE1_FLTR_FLTB0_Msk
#define ATIM3MODE1_FLTR_FLTET_Pos (28U)
#define ATIM3MODE1_FLTR_FLTET_Msk (0x7UL << ATIM3MODE1_FLTR_FLTET_Pos)
#define ATIM3MODE1_FLTR_FLTET ATIM3MODE1_FLTR_FLTET_Msk
#define ATIM3MODE1_FLTR_ETP_Pos (31U)
#define ATIM3MODE1_FLTR_ETP_Msk (0x1UL << ATIM3MODE1_FLTR_ETP_Pos)
#define ATIM3MODE1_FLTR_ETP ATIM3MODE1_FLTR_ETP_Msk

// ATIM3MODE1_CR0
#define ATIM3MODE1_CR0_CIEA_Pos (8U)
#define ATIM3MODE1_CR0_CIEA_Msk (0x1UL << ATIM3MODE1_CR0_CIEA_Pos)
#define ATIM3MODE1_CR0_CIEA ATIM3MODE1_CR0_CIEA_Msk

// ATIM3MODE1_CCR0A
#define ATIM3MODE1_CCR0A_CCR0A_Pos (0U)
#define ATIM3MODE1_CCR0A_CCR0A_Msk (0xFFFFUL << ATIM3MODE1_CCR0A_CCR0A_Pos)
#define ATIM3MODE1_CCR0A_CCR0A ATIM3MODE1_CCR0A_CCR0A_Msk

//********************    Bits Define For Peripheral ATIM3MODE23    ********************//
// ATIM3MODE23_ARR
#define ATIM3MODE23_ARR_ARR_Pos (0U)
#define ATIM3MODE23_ARR_ARR_Msk (0xFFFFUL << ATIM3MODE23_ARR_ARR_Pos)
#define ATIM3MODE23_ARR_ARR ATIM3MODE23_ARR_ARR_Msk

// ATIM3MODE23_CNT
#define ATIM3MODE23_CNT_CNT_Pos (0U)
#define ATIM3MODE23_CNT_CNT_Msk (0xFFFFUL << ATIM3MODE23_CNT_CNT_Pos)
#define ATIM3MODE23_CNT_CNT ATIM3MODE23_CNT_CNT_Msk

// ATIM3MODE23_M23CR
#define ATIM3MODE23_M23CR_CTEN_Pos (0U)
#define ATIM3MODE23_M23CR_CTEN_Msk (0x1UL << ATIM3MODE23_M23CR_CTEN_Pos)
#define ATIM3MODE23_M23CR_CTEN ATIM3MODE23_M23CR_CTEN_Msk
#define ATIM3MODE23_M23CR_COMP_Pos (1U)
#define ATIM3MODE23_M23CR_COMP_Msk (0x1UL << ATIM3MODE23_M23CR_COMP_Pos)
#define ATIM3MODE23_M23CR_COMP ATIM3MODE23_M23CR_COMP_Msk
#define ATIM3MODE23_M23CR_CT_Pos (2U)
#define ATIM3MODE23_M23CR_CT_Msk (0x1UL << ATIM3MODE23_M23CR_CT_Pos)
#define ATIM3MODE23_M23CR_CT ATIM3MODE23_M23CR_CT_Msk
#define ATIM3MODE23_M23CR_PWM2S_Pos (3U)
#define ATIM3MODE23_M23CR_PWM2S_Msk (0x1UL << ATIM3MODE23_M23CR_PWM2S_Pos)
#define ATIM3MODE23_M23CR_PWM2S ATIM3MODE23_M23CR_PWM2S_Msk
#define ATIM3MODE23_M23CR_PRS_Pos (4U)
#define ATIM3MODE23_M23CR_PRS_Msk (0x7UL << ATIM3MODE23_M23CR_PRS_Pos)
#define ATIM3MODE23_M23CR_PRS ATIM3MODE23_M23CR_PRS_Msk
#define ATIM3MODE23_M23CR_BUFP_Pos (7U)
#define ATIM3MODE23_M23CR_BUFP_Msk (0x1UL << ATIM3MODE23_M23CR_BUFP_Pos)
#define ATIM3MODE23_M23CR_BUFP ATIM3MODE23_M23CR_BUFP_Msk
#define ATIM3MODE23_M23CR_CRG_Pos (8U)
#define ATIM3MODE23_M23CR_CRG_Msk (0x1UL << ATIM3MODE23_M23CR_CRG_Pos)
#define ATIM3MODE23_M23CR_CRG ATIM3MODE23_M23CR_CRG_Msk
#define ATIM3MODE23_M23CR_CFG_Pos (9U)
#define ATIM3MODE23_M23CR_CFG_Msk (0x1UL << ATIM3MODE23_M23CR_CFG_Pos)
#define ATIM3MODE23_M23CR_CFG ATIM3MODE23_M23CR_CFG_Msk
#define ATIM3MODE23_M23CR_UI_Pos (10U)
#define ATIM3MODE23_M23CR_UI_Msk (0x1UL << ATIM3MODE23_M23CR_UI_Pos)
#define ATIM3MODE23_M23CR_UI ATIM3MODE23_M23CR_UI_Msk
#define ATIM3MODE23_M23CR_UD_Pos (11U)
#define ATIM3MODE23_M23CR_UD_Msk (0x1UL << ATIM3MODE23_M23CR_UD_Pos)
#define ATIM3MODE23_M23CR_UD ATIM3MODE23_M23CR_UD_Msk
#define ATIM3MODE23_M23CR_MODE_Pos (12U)
#define ATIM3MODE23_M23CR_MODE_Msk (0x3UL << ATIM3MODE23_M23CR_MODE_Pos)
#define ATIM3MODE23_M23CR_MODE ATIM3MODE23_M23CR_MODE_Msk
#define ATIM3MODE23_M23CR_ONESHOT_Pos (14U)
#define ATIM3MODE23_M23CR_ONESHOT_Msk (0x1UL << ATIM3MODE23_M23CR_ONESHOT_Pos)
#define ATIM3MODE23_M23CR_ONESHOT ATIM3MODE23_M23CR_ONESHOT_Msk
#define ATIM3MODE23_M23CR_CSG_Pos (15U)
#define ATIM3MODE23_M23CR_CSG_Msk (0x1UL << ATIM3MODE23_M23CR_CSG_Pos)
#define ATIM3MODE23_M23CR_CSG ATIM3MODE23_M23CR_CSG_Msk
#define ATIM3MODE23_M23CR_OCCS_Pos (16U)
#define ATIM3MODE23_M23CR_OCCS_Msk (0x1UL << ATIM3MODE23_M23CR_OCCS_Pos)
#define ATIM3MODE23_M23CR_OCCS ATIM3MODE23_M23CR_OCCS_Msk
#define ATIM3MODE23_M23CR_URS_Pos (17U)
#define ATIM3MODE23_M23CR_URS_Msk (0x1UL << ATIM3MODE23_M23CR_URS_Pos)
#define ATIM3MODE23_M23CR_URS ATIM3MODE23_M23CR_URS_Msk
#define ATIM3MODE23_M23CR_TD_Pos (18U)
#define ATIM3MODE23_M23CR_TD_Msk (0x1UL << ATIM3MODE23_M23CR_TD_Pos)
#define ATIM3MODE23_M23CR_TD ATIM3MODE23_M23CR_TD_Msk
#define ATIM3MODE23_M23CR_TI_Pos (19U)
#define ATIM3MODE23_M23CR_TI_Msk (0x1UL << ATIM3MODE23_M23CR_TI_Pos)
#define ATIM3MODE23_M23CR_TI ATIM3MODE23_M23CR_TI_Msk
#define ATIM3MODE23_M23CR_BI_Pos (20U)
#define ATIM3MODE23_M23CR_BI_Msk (0x1UL << ATIM3MODE23_M23CR_BI_Pos)
#define ATIM3MODE23_M23CR_BI ATIM3MODE23_M23CR_BI_Msk
#define ATIM3MODE23_M23CR_CIS_Pos (21U)
#define ATIM3MODE23_M23CR_CIS_Msk (0x3UL << ATIM3MODE23_M23CR_CIS_Pos)
#define ATIM3MODE23_M23CR_CIS ATIM3MODE23_M23CR_CIS_Msk
#define ATIM3MODE23_M23CR_OCC_Pos (23U)
#define ATIM3MODE23_M23CR_OCC_Msk (0x1UL << ATIM3MODE23_M23CR_OCC_Pos)
#define ATIM3MODE23_M23CR_OCC ATIM3MODE23_M23CR_OCC_Msk
#define ATIM3MODE23_M23CR_TG_Pos (24U)
#define ATIM3MODE23_M23CR_TG_Msk (0x1UL << ATIM3MODE23_M23CR_TG_Pos)
#define ATIM3MODE23_M23CR_TG ATIM3MODE23_M23CR_TG_Msk
#define ATIM3MODE23_M23CR_UG_Pos (25U)
#define ATIM3MODE23_M23CR_UG_Msk (0x1UL << ATIM3MODE23_M23CR_UG_Pos)
#define ATIM3MODE23_M23CR_UG ATIM3MODE23_M23CR_UG_Msk
#define ATIM3MODE23_M23CR_BG_Pos (26U)
#define ATIM3MODE23_M23CR_BG_Msk (0x1UL << ATIM3MODE23_M23CR_BG_Pos)
#define ATIM3MODE23_M23CR_BG ATIM3MODE23_M23CR_BG_Msk
#define ATIM3MODE23_M23CR_DIR_Pos (27U)
#define ATIM3MODE23_M23CR_DIR_Msk (0x1UL << ATIM3MODE23_M23CR_DIR_Pos)
#define ATIM3MODE23_M23CR_DIR ATIM3MODE23_M23CR_DIR_Msk
#define ATIM3MODE23_M23CR_OV_Pos (28U)
#define ATIM3MODE23_M23CR_OV_Msk (0x1UL << ATIM3MODE23_M23CR_OV_Pos)
#define ATIM3MODE23_M23CR_OV ATIM3MODE23_M23CR_OV_Msk
#define ATIM3MODE23_M23CR_UND_Pos (29U)
#define ATIM3MODE23_M23CR_UND_Msk (0x1UL << ATIM3MODE23_M23CR_UND_Pos)
#define ATIM3MODE23_M23CR_UND ATIM3MODE23_M23CR_UND_Msk

// ATIM3MODE23_IFR
#define ATIM3MODE23_IFR_UI_Pos (0U)
#define ATIM3MODE23_IFR_UI_Msk (0x1UL << ATIM3MODE23_IFR_UI_Pos)
#define ATIM3MODE23_IFR_UI ATIM3MODE23_IFR_UI_Msk
#define ATIM3MODE23_IFR_CA0_Pos (2U)
#define ATIM3MODE23_IFR_CA0_Msk (0x1UL << ATIM3MODE23_IFR_CA0_Pos)
#define ATIM3MODE23_IFR_CA0 ATIM3MODE23_IFR_CA0_Msk
#define ATIM3MODE23_IFR_CA1_Pos (3U)
#define ATIM3MODE23_IFR_CA1_Msk (0x1UL << ATIM3MODE23_IFR_CA1_Pos)
#define ATIM3MODE23_IFR_CA1 ATIM3MODE23_IFR_CA1_Msk
#define ATIM3MODE23_IFR_CA2_Pos (4U)
#define ATIM3MODE23_IFR_CA2_Msk (0x1UL << ATIM3MODE23_IFR_CA2_Pos)
#define ATIM3MODE23_IFR_CA2 ATIM3MODE23_IFR_CA2_Msk
#define ATIM3MODE23_IFR_CB0_Pos (5U)
#define ATIM3MODE23_IFR_CB0_Msk (0x1UL << ATIM3MODE23_IFR_CB0_Pos)
#define ATIM3MODE23_IFR_CB0 ATIM3MODE23_IFR_CB0_Msk
#define ATIM3MODE23_IFR_CB1_Pos (6U)
#define ATIM3MODE23_IFR_CB1_Msk (0x1UL << ATIM3MODE23_IFR_CB1_Pos)
#define ATIM3MODE23_IFR_CB1 ATIM3MODE23_IFR_CB1_Msk
#define ATIM3MODE23_IFR_CB2_Pos (7U)
#define ATIM3MODE23_IFR_CB2_Msk (0x1UL << ATIM3MODE23_IFR_CB2_Pos)
#define ATIM3MODE23_IFR_CB2 ATIM3MODE23_IFR_CB2_Msk
#define ATIM3MODE23_IFR_CA0E_Pos (8U)
#define ATIM3MODE23_IFR_CA0E_Msk (0x1UL << ATIM3MODE23_IFR_CA0E_Pos)
#define ATIM3MODE23_IFR_CA0E ATIM3MODE23_IFR_CA0E_Msk
#define ATIM3MODE23_IFR_CA1E_Pos (9U)
#define ATIM3MODE23_IFR_CA1E_Msk (0x1UL << ATIM3MODE23_IFR_CA1E_Pos)
#define ATIM3MODE23_IFR_CA1E ATIM3MODE23_IFR_CA1E_Msk
#define ATIM3MODE23_IFR_CA2E_Pos (10U)
#define ATIM3MODE23_IFR_CA2E_Msk (0x1UL << ATIM3MODE23_IFR_CA2E_Pos)
#define ATIM3MODE23_IFR_CA2E ATIM3MODE23_IFR_CA2E_Msk
#define ATIM3MODE23_IFR_CB0E_Pos (11U)
#define ATIM3MODE23_IFR_CB0E_Msk (0x1UL << ATIM3MODE23_IFR_CB0E_Pos)
#define ATIM3MODE23_IFR_CB0E ATIM3MODE23_IFR_CB0E_Msk
#define ATIM3MODE23_IFR_CB1E_Pos (12U)
#define ATIM3MODE23_IFR_CB1E_Msk (0x1UL << ATIM3MODE23_IFR_CB1E_Pos)
#define ATIM3MODE23_IFR_CB1E ATIM3MODE23_IFR_CB1E_Msk
#define ATIM3MODE23_IFR_CB2E_Pos (13U)
#define ATIM3MODE23_IFR_CB2E_Msk (0x1UL << ATIM3MODE23_IFR_CB2E_Pos)
#define ATIM3MODE23_IFR_CB2E ATIM3MODE23_IFR_CB2E_Msk
#define ATIM3MODE23_IFR_BI_Pos (14U)
#define ATIM3MODE23_IFR_BI_Msk (0x1UL << ATIM3MODE23_IFR_BI_Pos)
#define ATIM3MODE23_IFR_BI ATIM3MODE23_IFR_BI_Msk
#define ATIM3MODE23_IFR_TI_Pos (15U)
#define ATIM3MODE23_IFR_TI_Msk (0x1UL << ATIM3MODE23_IFR_TI_Pos)
#define ATIM3MODE23_IFR_TI ATIM3MODE23_IFR_TI_Msk
#define ATIM3MODE23_IFR_OV_Pos (16U)
#define ATIM3MODE23_IFR_OV_Msk (0x1UL << ATIM3MODE23_IFR_OV_Pos)
#define ATIM3MODE23_IFR_OV ATIM3MODE23_IFR_OV_Msk
#define ATIM3MODE23_IFR_UND_Pos (17U)
#define ATIM3MODE23_IFR_UND_Msk (0x1UL << ATIM3MODE23_IFR_UND_Pos)
#define ATIM3MODE23_IFR_UND ATIM3MODE23_IFR_UND_Msk
#define ATIM3MODE23_IFR_CA3_Pos (18U)
#define ATIM3MODE23_IFR_CA3_Msk (0x1UL << ATIM3MODE23_IFR_CA3_Pos)
#define ATIM3MODE23_IFR_CA3 ATIM3MODE23_IFR_CA3_Msk

// ATIM3MODE23_ICLR
#define ATIM3MODE23_ICLR_UI_Pos (0U)
#define ATIM3MODE23_ICLR_UI_Msk (0x1UL << ATIM3MODE23_ICLR_UI_Pos)
#define ATIM3MODE23_ICLR_UI ATIM3MODE23_ICLR_UI_Msk
#define ATIM3MODE23_ICLR_CA0_Pos (2U)
#define ATIM3MODE23_ICLR_CA0_Msk (0x1UL << ATIM3MODE23_ICLR_CA0_Pos)
#define ATIM3MODE23_ICLR_CA0 ATIM3MODE23_ICLR_CA0_Msk
#define ATIM3MODE23_ICLR_CA1_Pos (3U)
#define ATIM3MODE23_ICLR_CA1_Msk (0x1UL << ATIM3MODE23_ICLR_CA1_Pos)
#define ATIM3MODE23_ICLR_CA1 ATIM3MODE23_ICLR_CA1_Msk
#define ATIM3MODE23_ICLR_CA2_Pos (4U)
#define ATIM3MODE23_ICLR_CA2_Msk (0x1UL << ATIM3MODE23_ICLR_CA2_Pos)
#define ATIM3MODE23_ICLR_CA2 ATIM3MODE23_ICLR_CA2_Msk
#define ATIM3MODE23_ICLR_CB0_Pos (5U)
#define ATIM3MODE23_ICLR_CB0_Msk (0x1UL << ATIM3MODE23_ICLR_CB0_Pos)
#define ATIM3MODE23_ICLR_CB0 ATIM3MODE23_ICLR_CB0_Msk
#define ATIM3MODE23_ICLR_CB1_Pos (6U)
#define ATIM3MODE23_ICLR_CB1_Msk (0x1UL << ATIM3MODE23_ICLR_CB1_Pos)
#define ATIM3MODE23_ICLR_CB1 ATIM3MODE23_ICLR_CB1_Msk
#define ATIM3MODE23_ICLR_CB2_Pos (7U)
#define ATIM3MODE23_ICLR_CB2_Msk (0x1UL << ATIM3MODE23_ICLR_CB2_Pos)
#define ATIM3MODE23_ICLR_CB2 ATIM3MODE23_ICLR_CB2_Msk
#define ATIM3MODE23_ICLR_CA0E_Pos (8U)
#define ATIM3MODE23_ICLR_CA0E_Msk (0x1UL << ATIM3MODE23_ICLR_CA0E_Pos)
#define ATIM3MODE23_ICLR_CA0E ATIM3MODE23_ICLR_CA0E_Msk
#define ATIM3MODE23_ICLR_CA1E_Pos (9U)
#define ATIM3MODE23_ICLR_CA1E_Msk (0x1UL << ATIM3MODE23_ICLR_CA1E_Pos)
#define ATIM3MODE23_ICLR_CA1E ATIM3MODE23_ICLR_CA1E_Msk
#define ATIM3MODE23_ICLR_CA2E_Pos (10U)
#define ATIM3MODE23_ICLR_CA2E_Msk (0x1UL << ATIM3MODE23_ICLR_CA2E_Pos)
#define ATIM3MODE23_ICLR_CA2E ATIM3MODE23_ICLR_CA2E_Msk
#define ATIM3MODE23_ICLR_CB0E_Pos (11U)
#define ATIM3MODE23_ICLR_CB0E_Msk (0x1UL << ATIM3MODE23_ICLR_CB0E_Pos)
#define ATIM3MODE23_ICLR_CB0E ATIM3MODE23_ICLR_CB0E_Msk
#define ATIM3MODE23_ICLR_CB1E_Pos (12U)
#define ATIM3MODE23_ICLR_CB1E_Msk (0x1UL << ATIM3MODE23_ICLR_CB1E_Pos)
#define ATIM3MODE23_ICLR_CB1E ATIM3MODE23_ICLR_CB1E_Msk
#define ATIM3MODE23_ICLR_CB2E_Pos (13U)
#define ATIM3MODE23_ICLR_CB2E_Msk (0x1UL << ATIM3MODE23_ICLR_CB2E_Pos)
#define ATIM3MODE23_ICLR_CB2E ATIM3MODE23_ICLR_CB2E_Msk
#define ATIM3MODE23_ICLR_BI_Pos (14U)
#define ATIM3MODE23_ICLR_BI_Msk (0x1UL << ATIM3MODE23_ICLR_BI_Pos)
#define ATIM3MODE23_ICLR_BI ATIM3MODE23_ICLR_BI_Msk
#define ATIM3MODE23_ICLR_TI_Pos (15U)
#define ATIM3MODE23_ICLR_TI_Msk (0x1UL << ATIM3MODE23_ICLR_TI_Pos)
#define ATIM3MODE23_ICLR_TI ATIM3MODE23_ICLR_TI_Msk
#define ATIM3MODE23_ICLR_OV_Pos (16U)
#define ATIM3MODE23_ICLR_OV_Msk (0x1UL << ATIM3MODE23_ICLR_OV_Pos)
#define ATIM3MODE23_ICLR_OV ATIM3MODE23_ICLR_OV_Msk
#define ATIM3MODE23_ICLR_UND_Pos (17U)
#define ATIM3MODE23_ICLR_UND_Msk (0x1UL << ATIM3MODE23_ICLR_UND_Pos)
#define ATIM3MODE23_ICLR_UND ATIM3MODE23_ICLR_UND_Msk
#define ATIM3MODE23_ICLR_CA3_Pos (18U)
#define ATIM3MODE23_ICLR_CA3_Msk (0x1UL << ATIM3MODE23_ICLR_CA3_Pos)
#define ATIM3MODE23_ICLR_CA3 ATIM3MODE23_ICLR_CA3_Msk

// ATIM3MODE23_MSCR
#define ATIM3MODE23_MSCR_MMS_Pos (0U)
#define ATIM3MODE23_MSCR_MMS_Msk (0x7UL << ATIM3MODE23_MSCR_MMS_Pos)
#define ATIM3MODE23_MSCR_MMS ATIM3MODE23_MSCR_MMS_Msk
#define ATIM3MODE23_MSCR_CCDS_Pos (3U)
#define ATIM3MODE23_MSCR_CCDS_Msk (0x1UL << ATIM3MODE23_MSCR_CCDS_Pos)
#define ATIM3MODE23_MSCR_CCDS ATIM3MODE23_MSCR_CCDS_Msk
#define ATIM3MODE23_MSCR_MSM_Pos (4U)
#define ATIM3MODE23_MSCR_MSM_Msk (0x1UL << ATIM3MODE23_MSCR_MSM_Pos)
#define ATIM3MODE23_MSCR_MSM ATIM3MODE23_MSCR_MSM_Msk
#define ATIM3MODE23_MSCR_TS_Pos (5U)
#define ATIM3MODE23_MSCR_TS_Msk (0x7UL << ATIM3MODE23_MSCR_TS_Pos)
#define ATIM3MODE23_MSCR_TS ATIM3MODE23_MSCR_TS_Msk
#define ATIM3MODE23_MSCR_SMS_Pos (8U)
#define ATIM3MODE23_MSCR_SMS_Msk (0x7UL << ATIM3MODE23_MSCR_SMS_Pos)
#define ATIM3MODE23_MSCR_SMS ATIM3MODE23_MSCR_SMS_Msk
#define ATIM3MODE23_MSCR_IA0S_Pos (11U)
#define ATIM3MODE23_MSCR_IA0S_Msk (0x1UL << ATIM3MODE23_MSCR_IA0S_Pos)
#define ATIM3MODE23_MSCR_IA0S ATIM3MODE23_MSCR_IA0S_Msk
#define ATIM3MODE23_MSCR_IB0S_Pos (12U)
#define ATIM3MODE23_MSCR_IB0S_Msk (0x1UL << ATIM3MODE23_MSCR_IB0S_Pos)
#define ATIM3MODE23_MSCR_IB0S ATIM3MODE23_MSCR_IB0S_Msk

// ATIM3MODE23_FLTR
#define ATIM3MODE23_FLTR_OCMA0FLTA0_Pos (0U)
#define ATIM3MODE23_FLTR_OCMA0FLTA0_Msk (0x7UL << ATIM3MODE23_FLTR_OCMA0FLTA0_Pos)
#define ATIM3MODE23_FLTR_OCMA0FLTA0 ATIM3MODE23_FLTR_OCMA0FLTA0_Msk
#define ATIM3MODE23_FLTR_CCPA0_Pos (3U)
#define ATIM3MODE23_FLTR_CCPA0_Msk (0x1UL << ATIM3MODE23_FLTR_CCPA0_Pos)
#define ATIM3MODE23_FLTR_CCPA0 ATIM3MODE23_FLTR_CCPA0_Msk
#define ATIM3MODE23_FLTR_OCMB0FLTB0_Pos (4U)
#define ATIM3MODE23_FLTR_OCMB0FLTB0_Msk (0x7UL << ATIM3MODE23_FLTR_OCMB0FLTB0_Pos)
#define ATIM3MODE23_FLTR_OCMB0FLTB0 ATIM3MODE23_FLTR_OCMB0FLTB0_Msk
#define ATIM3MODE23_FLTR_CCPB0_Pos (7U)
#define ATIM3MODE23_FLTR_CCPB0_Msk (0x1UL << ATIM3MODE23_FLTR_CCPB0_Pos)
#define ATIM3MODE23_FLTR_CCPB0 ATIM3MODE23_FLTR_CCPB0_Msk
#define ATIM3MODE23_FLTR_OCMA1FLTA1_Pos (8U)
#define ATIM3MODE23_FLTR_OCMA1FLTA1_Msk (0x7UL << ATIM3MODE23_FLTR_OCMA1FLTA1_Pos)
#define ATIM3MODE23_FLTR_OCMA1FLTA1 ATIM3MODE23_FLTR_OCMA1FLTA1_Msk
#define ATIM3MODE23_FLTR_CCPA1_Pos (11U)
#define ATIM3MODE23_FLTR_CCPA1_Msk (0x1UL << ATIM3MODE23_FLTR_CCPA1_Pos)
#define ATIM3MODE23_FLTR_CCPA1 ATIM3MODE23_FLTR_CCPA1_Msk
#define ATIM3MODE23_FLTR_OCMB1FLTB1_Pos (12U)
#define ATIM3MODE23_FLTR_OCMB1FLTB1_Msk (0x7UL << ATIM3MODE23_FLTR_OCMB1FLTB1_Pos)
#define ATIM3MODE23_FLTR_OCMB1FLTB1 ATIM3MODE23_FLTR_OCMB1FLTB1_Msk
#define ATIM3MODE23_FLTR_CCPB1_Pos (15U)
#define ATIM3MODE23_FLTR_CCPB1_Msk (0x1UL << ATIM3MODE23_FLTR_CCPB1_Pos)
#define ATIM3MODE23_FLTR_CCPB1 ATIM3MODE23_FLTR_CCPB1_Msk
#define ATIM3MODE23_FLTR_OCMA2FLTA2_Pos (16U)
#define ATIM3MODE23_FLTR_OCMA2FLTA2_Msk (0x7UL << ATIM3MODE23_FLTR_OCMA2FLTA2_Pos)
#define ATIM3MODE23_FLTR_OCMA2FLTA2 ATIM3MODE23_FLTR_OCMA2FLTA2_Msk
#define ATIM3MODE23_FLTR_CCPA2_Pos (19U)
#define ATIM3MODE23_FLTR_CCPA2_Msk (0x1UL << ATIM3MODE23_FLTR_CCPA2_Pos)
#define ATIM3MODE23_FLTR_CCPA2 ATIM3MODE23_FLTR_CCPA2_Msk
#define ATIM3MODE23_FLTR_OCMB2FLTB2_Pos (20U)
#define ATIM3MODE23_FLTR_OCMB2FLTB2_Msk (0x7UL << ATIM3MODE23_FLTR_OCMB2FLTB2_Pos)
#define ATIM3MODE23_FLTR_OCMB2FLTB2 ATIM3MODE23_FLTR_OCMB2FLTB2_Msk
#define ATIM3MODE23_FLTR_CCPB2_Pos (23U)
#define ATIM3MODE23_FLTR_CCPB2_Msk (0x1UL << ATIM3MODE23_FLTR_CCPB2_Pos)
#define ATIM3MODE23_FLTR_CCPB2 ATIM3MODE23_FLTR_CCPB2_Msk
#define ATIM3MODE23_FLTR_FLTBK_Pos (24U)
#define ATIM3MODE23_FLTR_FLTBK_Msk (0x7UL << ATIM3MODE23_FLTR_FLTBK_Pos)
#define ATIM3MODE23_FLTR_FLTBK ATIM3MODE23_FLTR_FLTBK_Msk
#define ATIM3MODE23_FLTR_BKP_Pos (27U)
#define ATIM3MODE23_FLTR_BKP_Msk (0x1UL << ATIM3MODE23_FLTR_BKP_Pos)
#define ATIM3MODE23_FLTR_BKP ATIM3MODE23_FLTR_BKP_Msk
#define ATIM3MODE23_FLTR_FLTET_Pos (28U)
#define ATIM3MODE23_FLTR_FLTET_Msk (0x7UL << ATIM3MODE23_FLTR_FLTET_Pos)
#define ATIM3MODE23_FLTR_FLTET ATIM3MODE23_FLTR_FLTET_Msk
#define ATIM3MODE23_FLTR_ETP_Pos (31U)
#define ATIM3MODE23_FLTR_ETP_Msk (0x1UL << ATIM3MODE23_FLTR_ETP_Pos)
#define ATIM3MODE23_FLTR_ETP ATIM3MODE23_FLTR_ETP_Msk

