kepler-444b/HC32F002/mcu/common/HC32F002.h
// ATIM3MODE23_ADTR
#define ATIM3MODE23_ADTR_UEV_Pos (0U)
#define ATIM3MODE23_ADTR_UEV_Msk (0x1UL << ATIM3MODE23_ADTR_UEV_Pos)
#define ATIM3MODE23_ADTR_UEV ATIM3MODE23_ADTR_UEV_Msk
#define ATIM3MODE23_ADTR_CMA0_Pos (1U)
#define ATIM3MODE23_ADTR_CMA0_Msk (0x1UL << ATIM3MODE23_ADTR_CMA0_Pos)
#define ATIM3MODE23_ADTR_CMA0 ATIM3MODE23_ADTR_CMA0_Msk
#define ATIM3MODE23_ADTR_CMA1_Pos (2U)
#define ATIM3MODE23_ADTR_CMA1_Msk (0x1UL << ATIM3MODE23_ADTR_CMA1_Pos)
#define ATIM3MODE23_ADTR_CMA1 ATIM3MODE23_ADTR_CMA1_Msk
#define ATIM3MODE23_ADTR_CMA2_Pos (3U)
#define ATIM3MODE23_ADTR_CMA2_Msk (0x1UL << ATIM3MODE23_ADTR_CMA2_Pos)
#define ATIM3MODE23_ADTR_CMA2 ATIM3MODE23_ADTR_CMA2_Msk
#define ATIM3MODE23_ADTR_CMB0_Pos (4U)
#define ATIM3MODE23_ADTR_CMB0_Msk (0x1UL << ATIM3MODE23_ADTR_CMB0_Pos)
#define ATIM3MODE23_ADTR_CMB0 ATIM3MODE23_ADTR_CMB0_Msk
#define ATIM3MODE23_ADTR_CMB1_Pos (5U)
#define ATIM3MODE23_ADTR_CMB1_Msk (0x1UL << ATIM3MODE23_ADTR_CMB1_Pos)
#define ATIM3MODE23_ADTR_CMB1 ATIM3MODE23_ADTR_CMB1_Msk
#define ATIM3MODE23_ADTR_CMB2_Pos (6U)
#define ATIM3MODE23_ADTR_CMB2_Msk (0x1UL << ATIM3MODE23_ADTR_CMB2_Pos)
#define ATIM3MODE23_ADTR_CMB2 ATIM3MODE23_ADTR_CMB2_Msk
#define ATIM3MODE23_ADTR_ADT_Pos (7U)
#define ATIM3MODE23_ADTR_ADT_Msk (0x1UL << ATIM3MODE23_ADTR_ADT_Pos)
#define ATIM3MODE23_ADTR_ADT ATIM3MODE23_ADTR_ADT_Msk

// ATIM3MODE23_CRCH0
#define ATIM3MODE23_CRCH0_BKSACFACRA_Pos (0U)
#define ATIM3MODE23_CRCH0_BKSACFACRA_Msk (0x3UL << ATIM3MODE23_CRCH0_BKSACFACRA_Pos)
#define ATIM3MODE23_CRCH0_BKSACFACRA ATIM3MODE23_CRCH0_BKSACFACRA_Msk
#define ATIM3MODE23_CRCH0_BKSBCFBCRB_Pos (2U)
#define ATIM3MODE23_CRCH0_BKSBCFBCRB_Msk (0x3UL << ATIM3MODE23_CRCH0_BKSBCFBCRB_Pos)
#define ATIM3MODE23_CRCH0_BKSBCFBCRB ATIM3MODE23_CRCH0_BKSBCFBCRB_Msk
#define ATIM3MODE23_CRCH0_CSA_Pos (4U)
#define ATIM3MODE23_CRCH0_CSA_Msk (0x1UL << ATIM3MODE23_CRCH0_CSA_Pos)
#define ATIM3MODE23_CRCH0_CSA ATIM3MODE23_CRCH0_CSA_Msk
#define ATIM3MODE23_CRCH0_CSB_Pos (5U)
#define ATIM3MODE23_CRCH0_CSB_Msk (0x1UL << ATIM3MODE23_CRCH0_CSB_Pos)
#define ATIM3MODE23_CRCH0_CSB ATIM3MODE23_CRCH0_CSB_Msk
#define ATIM3MODE23_CRCH0_BUFEA_Pos (6U)
#define ATIM3MODE23_CRCH0_BUFEA_Msk (0x1UL << ATIM3MODE23_CRCH0_BUFEA_Pos)
#define ATIM3MODE23_CRCH0_BUFEA ATIM3MODE23_CRCH0_BUFEA_Msk
#define ATIM3MODE23_CRCH0_BUFEB_Pos (7U)
#define ATIM3MODE23_CRCH0_BUFEB_Msk (0x1UL << ATIM3MODE23_CRCH0_BUFEB_Pos)
#define ATIM3MODE23_CRCH0_BUFEB ATIM3MODE23_CRCH0_BUFEB_Msk
#define ATIM3MODE23_CRCH0_CIEA_Pos (8U)
#define ATIM3MODE23_CRCH0_CIEA_Msk (0x1UL << ATIM3MODE23_CRCH0_CIEA_Pos)
#define ATIM3MODE23_CRCH0_CIEA ATIM3MODE23_CRCH0_CIEA_Msk
#define ATIM3MODE23_CRCH0_CIEB_Pos (9U)
#define ATIM3MODE23_CRCH0_CIEB_Msk (0x1UL << ATIM3MODE23_CRCH0_CIEB_Pos)
#define ATIM3MODE23_CRCH0_CIEB ATIM3MODE23_CRCH0_CIEB_Msk
#define ATIM3MODE23_CRCH0_CDEA_Pos (10U)
#define ATIM3MODE23_CRCH0_CDEA_Msk (0x1UL << ATIM3MODE23_CRCH0_CDEA_Pos)
#define ATIM3MODE23_CRCH0_CDEA ATIM3MODE23_CRCH0_CDEA_Msk
#define ATIM3MODE23_CRCH0_CDEB_Pos (11U)
#define ATIM3MODE23_CRCH0_CDEB_Msk (0x1UL << ATIM3MODE23_CRCH0_CDEB_Pos)
#define ATIM3MODE23_CRCH0_CDEB ATIM3MODE23_CRCH0_CDEB_Msk
#define ATIM3MODE23_CRCH0_CISB_Pos (12U)
#define ATIM3MODE23_CRCH0_CISB_Msk (0x3UL << ATIM3MODE23_CRCH0_CISB_Pos)
#define ATIM3MODE23_CRCH0_CISB ATIM3MODE23_CRCH0_CISB_Msk
#define ATIM3MODE23_CRCH0_CCGA_Pos (14U)
#define ATIM3MODE23_CRCH0_CCGA_Msk (0x1UL << ATIM3MODE23_CRCH0_CCGA_Pos)
#define ATIM3MODE23_CRCH0_CCGA ATIM3MODE23_CRCH0_CCGA_Msk
#define ATIM3MODE23_CRCH0_CCGB_Pos (15U)
#define ATIM3MODE23_CRCH0_CCGB_Msk (0x1UL << ATIM3MODE23_CRCH0_CCGB_Pos)
#define ATIM3MODE23_CRCH0_CCGB ATIM3MODE23_CRCH0_CCGB_Msk

// ATIM3MODE23_CRCH1
#define ATIM3MODE23_CRCH1_BKSACFACRA_Pos (0U)
#define ATIM3MODE23_CRCH1_BKSACFACRA_Msk (0x3UL << ATIM3MODE23_CRCH1_BKSACFACRA_Pos)
#define ATIM3MODE23_CRCH1_BKSACFACRA ATIM3MODE23_CRCH1_BKSACFACRA_Msk
#define ATIM3MODE23_CRCH1_BKSBCFBCRB_Pos (2U)
#define ATIM3MODE23_CRCH1_BKSBCFBCRB_Msk (0x3UL << ATIM3MODE23_CRCH1_BKSBCFBCRB_Pos)
#define ATIM3MODE23_CRCH1_BKSBCFBCRB ATIM3MODE23_CRCH1_BKSBCFBCRB_Msk
#define ATIM3MODE23_CRCH1_CSA_Pos (4U)
#define ATIM3MODE23_CRCH1_CSA_Msk (0x1UL << ATIM3MODE23_CRCH1_CSA_Pos)
#define ATIM3MODE23_CRCH1_CSA ATIM3MODE23_CRCH1_CSA_Msk
#define ATIM3MODE23_CRCH1_CSB_Pos (5U)
#define ATIM3MODE23_CRCH1_CSB_Msk (0x1UL << ATIM3MODE23_CRCH1_CSB_Pos)
#define ATIM3MODE23_CRCH1_CSB ATIM3MODE23_CRCH1_CSB_Msk
#define ATIM3MODE23_CRCH1_BUFEA_Pos (6U)
#define ATIM3MODE23_CRCH1_BUFEA_Msk (0x1UL << ATIM3MODE23_CRCH1_BUFEA_Pos)
#define ATIM3MODE23_CRCH1_BUFEA ATIM3MODE23_CRCH1_BUFEA_Msk
#define ATIM3MODE23_CRCH1_BUFEB_Pos (7U)
#define ATIM3MODE23_CRCH1_BUFEB_Msk (0x1UL << ATIM3MODE23_CRCH1_BUFEB_Pos)
#define ATIM3MODE23_CRCH1_BUFEB ATIM3MODE23_CRCH1_BUFEB_Msk
#define ATIM3MODE23_CRCH1_CIEA_Pos (8U)
#define ATIM3MODE23_CRCH1_CIEA_Msk (0x1UL << ATIM3MODE23_CRCH1_CIEA_Pos)
#define ATIM3MODE23_CRCH1_CIEA ATIM3MODE23_CRCH1_CIEA_Msk
#define ATIM3MODE23_CRCH1_CIEB_Pos (9U)
#define ATIM3MODE23_CRCH1_CIEB_Msk (0x1UL << ATIM3MODE23_CRCH1_CIEB_Pos)
#define ATIM3MODE23_CRCH1_CIEB ATIM3MODE23_CRCH1_CIEB_Msk
#define ATIM3MODE23_CRCH1_CDEA_Pos (10U)
#define ATIM3MODE23_CRCH1_CDEA_Msk (0x1UL << ATIM3MODE23_CRCH1_CDEA_Pos)
#define ATIM3MODE23_CRCH1_CDEA ATIM3MODE23_CRCH1_CDEA_Msk
#define ATIM3MODE23_CRCH1_CDEB_Pos (11U)
#define ATIM3MODE23_CRCH1_CDEB_Msk (0x1UL << ATIM3MODE23_CRCH1_CDEB_Pos)
#define ATIM3MODE23_CRCH1_CDEB ATIM3MODE23_CRCH1_CDEB_Msk
#define ATIM3MODE23_CRCH1_CISB_Pos (12U)
#define ATIM3MODE23_CRCH1_CISB_Msk (0x3UL << ATIM3MODE23_CRCH1_CISB_Pos)
#define ATIM3MODE23_CRCH1_CISB ATIM3MODE23_CRCH1_CISB_Msk
#define ATIM3MODE23_CRCH1_CCGA_Pos (14U)
#define ATIM3MODE23_CRCH1_CCGA_Msk (0x1UL << ATIM3MODE23_CRCH1_CCGA_Pos)
#define ATIM3MODE23_CRCH1_CCGA ATIM3MODE23_CRCH1_CCGA_Msk
#define ATIM3MODE23_CRCH1_CCGB_Pos (15U)
#define ATIM3MODE23_CRCH1_CCGB_Msk (0x1UL << ATIM3MODE23_CRCH1_CCGB_Pos)
#define ATIM3MODE23_CRCH1_CCGB ATIM3MODE23_CRCH1_CCGB_Msk

// ATIM3MODE23_CRCH2
#define ATIM3MODE23_CRCH2_BKSACFACRA_Pos (0U)
#define ATIM3MODE23_CRCH2_BKSACFACRA_Msk (0x3UL << ATIM3MODE23_CRCH2_BKSACFACRA_Pos)
#define ATIM3MODE23_CRCH2_BKSACFACRA ATIM3MODE23_CRCH2_BKSACFACRA_Msk
#define ATIM3MODE23_CRCH2_BKSBCFBCRB_Pos (2U)
#define ATIM3MODE23_CRCH2_BKSBCFBCRB_Msk (0x3UL << ATIM3MODE23_CRCH2_BKSBCFBCRB_Pos)
#define ATIM3MODE23_CRCH2_BKSBCFBCRB ATIM3MODE23_CRCH2_BKSBCFBCRB_Msk
#define ATIM3MODE23_CRCH2_CSA_Pos (4U)
#define ATIM3MODE23_CRCH2_CSA_Msk (0x1UL << ATIM3MODE23_CRCH2_CSA_Pos)
#define ATIM3MODE23_CRCH2_CSA ATIM3MODE23_CRCH2_CSA_Msk
#define ATIM3MODE23_CRCH2_CSB_Pos (5U)
#define ATIM3MODE23_CRCH2_CSB_Msk (0x1UL << ATIM3MODE23_CRCH2_CSB_Pos)
#define ATIM3MODE23_CRCH2_CSB ATIM3MODE23_CRCH2_CSB_Msk
#define ATIM3MODE23_CRCH2_BUFEA_Pos (6U)
#define ATIM3MODE23_CRCH2_BUFEA_Msk (0x1UL << ATIM3MODE23_CRCH2_BUFEA_Pos)
#define ATIM3MODE23_CRCH2_BUFEA ATIM3MODE23_CRCH2_BUFEA_Msk
#define ATIM3MODE23_CRCH2_BUFEB_Pos (7U)
#define ATIM3MODE23_CRCH2_BUFEB_Msk (0x1UL << ATIM3MODE23_CRCH2_BUFEB_Pos)
#define ATIM3MODE23_CRCH2_BUFEB ATIM3MODE23_CRCH2_BUFEB_Msk
#define ATIM3MODE23_CRCH2_CIEA_Pos (8U)
#define ATIM3MODE23_CRCH2_CIEA_Msk (0x1UL << ATIM3MODE23_CRCH2_CIEA_Pos)
#define ATIM3MODE23_CRCH2_CIEA ATIM3MODE23_CRCH2_CIEA_Msk
#define ATIM3MODE23_CRCH2_CIEB_Pos (9U)
#define ATIM3MODE23_CRCH2_CIEB_Msk (0x1UL << ATIM3MODE23_CRCH2_CIEB_Pos)
#define ATIM3MODE23_CRCH2_CIEB ATIM3MODE23_CRCH2_CIEB_Msk
#define ATIM3MODE23_CRCH2_CDEA_Pos (10U)
#define ATIM3MODE23_CRCH2_CDEA_Msk (0x1UL << ATIM3MODE23_CRCH2_CDEA_Pos)
#define ATIM3MODE23_CRCH2_CDEA ATIM3MODE23_CRCH2_CDEA_Msk
#define ATIM3MODE23_CRCH2_CDEB_Pos (11U)
#define ATIM3MODE23_CRCH2_CDEB_Msk (0x1UL << ATIM3MODE23_CRCH2_CDEB_Pos)
#define ATIM3MODE23_CRCH2_CDEB ATIM3MODE23_CRCH2_CDEB_Msk
#define ATIM3MODE23_CRCH2_CISB_Pos (12U)
#define ATIM3MODE23_CRCH2_CISB_Msk (0x3UL << ATIM3MODE23_CRCH2_CISB_Pos)
#define ATIM3MODE23_CRCH2_CISB ATIM3MODE23_CRCH2_CISB_Msk
#define ATIM3MODE23_CRCH2_CCGA_Pos (14U)
#define ATIM3MODE23_CRCH2_CCGA_Msk (0x1UL << ATIM3MODE23_CRCH2_CCGA_Pos)
#define ATIM3MODE23_CRCH2_CCGA ATIM3MODE23_CRCH2_CCGA_Msk
#define ATIM3MODE23_CRCH2_CCGB_Pos (15U)
#define ATIM3MODE23_CRCH2_CCGB_Msk (0x1UL << ATIM3MODE23_CRCH2_CCGB_Pos)
#define ATIM3MODE23_CRCH2_CCGB ATIM3MODE23_CRCH2_CCGB_Msk

// ATIM3MODE23_DTR
#define ATIM3MODE23_DTR_DTR_Pos (0U)
#define ATIM3MODE23_DTR_DTR_Msk (0xFFUL << ATIM3MODE23_DTR_DTR_Pos)
#define ATIM3MODE23_DTR_DTR ATIM3MODE23_DTR_DTR_Msk
#define ATIM3MODE23_DTR_BKSEL_Pos (8U)
#define ATIM3MODE23_DTR_BKSEL_Msk (0x1UL << ATIM3MODE23_DTR_BKSEL_Pos)
#define ATIM3MODE23_DTR_BKSEL ATIM3MODE23_DTR_BKSEL_Msk
#define ATIM3MODE23_DTR_DT_Pos (9U)
#define ATIM3MODE23_DTR_DT_Msk (0x1UL << ATIM3MODE23_DTR_DT_Pos)
#define ATIM3MODE23_DTR_DT ATIM3MODE23_DTR_DT_Msk
#define ATIM3MODE23_DTR_BK_Pos (10U)
#define ATIM3MODE23_DTR_BK_Msk (0x1UL << ATIM3MODE23_DTR_BK_Pos)
#define ATIM3MODE23_DTR_BK ATIM3MODE23_DTR_BK_Msk
#define ATIM3MODE23_DTR_AO_Pos (11U)
#define ATIM3MODE23_DTR_AO_Msk (0x1UL << ATIM3MODE23_DTR_AO_Pos)
#define ATIM3MODE23_DTR_AO ATIM3MODE23_DTR_AO_Msk
#define ATIM3MODE23_DTR_MO_Pos (12U)
#define ATIM3MODE23_DTR_MO_Msk (0x1UL << ATIM3MODE23_DTR_MO_Pos)
#define ATIM3MODE23_DTR_MO ATIM3MODE23_DTR_MO_Msk
#define ATIM3MODE23_DTR_SAFE_Pos (13U)
#define ATIM3MODE23_DTR_SAFE_Msk (0x1UL << ATIM3MODE23_DTR_SAFE_Pos)
#define ATIM3MODE23_DTR_SAFE ATIM3MODE23_DTR_SAFE_Msk
#define ATIM3MODE23_DTR_VC_Pos (14U)
#define ATIM3MODE23_DTR_VC_Msk (0x1UL << ATIM3MODE23_DTR_VC_Pos)
#define ATIM3MODE23_DTR_VC ATIM3MODE23_DTR_VC_Msk

// ATIM3MODE23_RCR
#define ATIM3MODE23_RCR_RCR_Pos (0U)
#define ATIM3MODE23_RCR_RCR_Msk (0xFFUL << ATIM3MODE23_RCR_RCR_Pos)
#define ATIM3MODE23_RCR_RCR ATIM3MODE23_RCR_RCR_Msk
#define ATIM3MODE23_RCR_OV_Pos (8U)
#define ATIM3MODE23_RCR_OV_Msk (0x1UL << ATIM3MODE23_RCR_OV_Pos)
#define ATIM3MODE23_RCR_OV ATIM3MODE23_RCR_OV_Msk
#define ATIM3MODE23_RCR_UD_Pos (9U)
#define ATIM3MODE23_RCR_UD_Msk (0x1UL << ATIM3MODE23_RCR_UD_Pos)
#define ATIM3MODE23_RCR_UD ATIM3MODE23_RCR_UD_Msk

// ATIM3MODE23_CCR0A
#define ATIM3MODE23_CCR0A_CCR0A_Pos (0U)
#define ATIM3MODE23_CCR0A_CCR0A_Msk (0xFFFFUL << ATIM3MODE23_CCR0A_CCR0A_Pos)
#define ATIM3MODE23_CCR0A_CCR0A ATIM3MODE23_CCR0A_CCR0A_Msk

// ATIM3MODE23_CCR0B
#define ATIM3MODE23_CCR0B_CCR0B_Pos (0U)
#define ATIM3MODE23_CCR0B_CCR0B_Msk (0xFFFFUL << ATIM3MODE23_CCR0B_CCR0B_Pos)
#define ATIM3MODE23_CCR0B_CCR0B ATIM3MODE23_CCR0B_CCR0B_Msk

