kepler-444b/HC32F002/mcu/common/HC32F002.h
// ATIM3MODE23_CCR1A
#define ATIM3MODE23_CCR1A_CCR1A_Pos (0U)
#define ATIM3MODE23_CCR1A_CCR1A_Msk (0xFFFFUL << ATIM3MODE23_CCR1A_CCR1A_Pos)
#define ATIM3MODE23_CCR1A_CCR1A ATIM3MODE23_CCR1A_CCR1A_Msk

// ATIM3MODE23_CCR1B
#define ATIM3MODE23_CCR1B_CCR1B_Pos (0U)
#define ATIM3MODE23_CCR1B_CCR1B_Msk (0xFFFFUL << ATIM3MODE23_CCR1B_CCR1B_Pos)
#define ATIM3MODE23_CCR1B_CCR1B ATIM3MODE23_CCR1B_CCR1B_Msk

// ATIM3MODE23_CCR2A
#define ATIM3MODE23_CCR2A_CCR2A_Pos (0U)
#define ATIM3MODE23_CCR2A_CCR2A_Msk (0xFFFFUL << ATIM3MODE23_CCR2A_CCR2A_Pos)
#define ATIM3MODE23_CCR2A_CCR2A ATIM3MODE23_CCR2A_CCR2A_Msk

// ATIM3MODE23_CCR2B
#define ATIM3MODE23_CCR2B_CCR2B_Pos (0U)
#define ATIM3MODE23_CCR2B_CCR2B_Msk (0xFFFFUL << ATIM3MODE23_CCR2B_CCR2B_Pos)
#define ATIM3MODE23_CCR2B_CCR2B ATIM3MODE23_CCR2B_CCR2B_Msk

// ATIM3MODE23_CCR3
#define ATIM3MODE23_CCR3_CCR3_Pos (0U)
#define ATIM3MODE23_CCR3_CCR3_Msk (0xFFFFUL << ATIM3MODE23_CCR3_CCR3_Pos)
#define ATIM3MODE23_CCR3_CCR3 ATIM3MODE23_CCR3_CCR3_Msk

// ATIM3MODE23_CRCH3
#define ATIM3MODE23_CRCH3_BUF_Pos (0U)
#define ATIM3MODE23_CRCH3_BUF_Msk (0x1UL << ATIM3MODE23_CRCH3_BUF_Pos)
#define ATIM3MODE23_CRCH3_BUF ATIM3MODE23_CRCH3_BUF_Msk
#define ATIM3MODE23_CRCH3_CI_Pos (1U)
#define ATIM3MODE23_CRCH3_CI_Msk (0x1UL << ATIM3MODE23_CRCH3_CI_Pos)
#define ATIM3MODE23_CRCH3_CI ATIM3MODE23_CRCH3_CI_Msk
#define ATIM3MODE23_CRCH3_CD_Pos (2U)
#define ATIM3MODE23_CRCH3_CD_Msk (0x1UL << ATIM3MODE23_CRCH3_CD_Pos)
#define ATIM3MODE23_CRCH3_CD ATIM3MODE23_CRCH3_CD_Msk
#define ATIM3MODE23_CRCH3_CIS_Pos (3U)
#define ATIM3MODE23_CRCH3_CIS_Msk (0x3UL << ATIM3MODE23_CRCH3_CIS_Pos)
#define ATIM3MODE23_CRCH3_CIS ATIM3MODE23_CRCH3_CIS_Msk
#define ATIM3MODE23_CRCH3_C3_Pos (5U)
#define ATIM3MODE23_CRCH3_C3_Msk (0x1UL << ATIM3MODE23_CRCH3_C3_Pos)
#define ATIM3MODE23_CRCH3_C3 ATIM3MODE23_CRCH3_C3_Msk

//********************    Bits Define For Peripheral BTIM    ********************//
// BTIM_ARR
#define BTIM_ARR_ARR_Pos (0U)
#define BTIM_ARR_ARR_Msk (0xFFFFUL << BTIM_ARR_ARR_Pos)
#define BTIM_ARR_ARR BTIM_ARR_ARR_Msk

// BTIM_CNT
#define BTIM_CNT_CNT_Pos (0U)
#define BTIM_CNT_CNT_Msk (0xFFFFUL << BTIM_CNT_CNT_Pos)
#define BTIM_CNT_CNT BTIM_CNT_CNT_Msk

// BTIM_CR
#define BTIM_CR_CEN_Pos (0U)
#define BTIM_CR_CEN_Msk (0x1UL << BTIM_CR_CEN_Pos)
#define BTIM_CR_CEN BTIM_CR_CEN_Msk
#define BTIM_CR_MD_Pos (1U)
#define BTIM_CR_MD_Msk (0x3UL << BTIM_CR_MD_Pos)
#define BTIM_CR_MD BTIM_CR_MD_Msk
#define BTIM_CR_TOGEN_Pos (3U)
#define BTIM_CR_TOGEN_Msk (0x1UL << BTIM_CR_TOGEN_Pos)
#define BTIM_CR_TOGEN BTIM_CR_TOGEN_Msk
#define BTIM_CR_PRS_Pos (4U)
#define BTIM_CR_PRS_Msk (0xFUL << BTIM_CR_PRS_Pos)
#define BTIM_CR_PRS BTIM_CR_PRS_Msk
#define BTIM_CR_OST_Pos (8U)
#define BTIM_CR_OST_Msk (0x1UL << BTIM_CR_OST_Pos)
#define BTIM_CR_OST BTIM_CR_OST_Msk
#define BTIM_CR_TRS_Pos (9U)
#define BTIM_CR_TRS_Msk (0x3UL << BTIM_CR_TRS_Pos)
#define BTIM_CR_TRS BTIM_CR_TRS_Msk
#define BTIM_CR_ETP_Pos (11U)
#define BTIM_CR_ETP_Msk (0x1UL << BTIM_CR_ETP_Pos)
#define BTIM_CR_ETP BTIM_CR_ETP_Msk

// BTIM_IER
#define BTIM_IER_UI_Pos (0U)
#define BTIM_IER_UI_Msk (0x1UL << BTIM_IER_UI_Pos)
#define BTIM_IER_UI BTIM_IER_UI_Msk
#define BTIM_IER_TI_Pos (1U)
#define BTIM_IER_TI_Msk (0x1UL << BTIM_IER_TI_Pos)
#define BTIM_IER_TI BTIM_IER_TI_Msk

// BTIM_IFR
#define BTIM_IFR_UI_Pos (0U)
#define BTIM_IFR_UI_Msk (0x1UL << BTIM_IFR_UI_Pos)
#define BTIM_IFR_UI BTIM_IFR_UI_Msk
#define BTIM_IFR_TI_Pos (1U)
#define BTIM_IFR_TI_Msk (0x1UL << BTIM_IFR_TI_Pos)
#define BTIM_IFR_TI BTIM_IFR_TI_Msk

// BTIM_ICR
#define BTIM_ICR_UI_Pos (0U)
#define BTIM_ICR_UI_Msk (0x1UL << BTIM_ICR_UI_Pos)
#define BTIM_ICR_UI BTIM_ICR_UI_Msk
#define BTIM_ICR_TI_Pos (1U)
#define BTIM_ICR_TI_Msk (0x1UL << BTIM_ICR_TI_Pos)
#define BTIM_ICR_TI BTIM_ICR_TI_Msk

// BTIM_AIFR
#define BTIM_AIFR_UI3_Pos (0U)
#define BTIM_AIFR_UI3_Msk (0x1UL << BTIM_AIFR_UI3_Pos)
#define BTIM_AIFR_UI3 BTIM_AIFR_UI3_Msk
#define BTIM_AIFR_TI3_Pos (1U)
#define BTIM_AIFR_TI3_Msk (0x1UL << BTIM_AIFR_TI3_Pos)
#define BTIM_AIFR_TI3 BTIM_AIFR_TI3_Msk
#define BTIM_AIFR_UI4_Pos (2U)
#define BTIM_AIFR_UI4_Msk (0x1UL << BTIM_AIFR_UI4_Pos)
#define BTIM_AIFR_UI4 BTIM_AIFR_UI4_Msk
#define BTIM_AIFR_TI4_Pos (3U)
#define BTIM_AIFR_TI4_Msk (0x1UL << BTIM_AIFR_TI4_Pos)
#define BTIM_AIFR_TI4 BTIM_AIFR_TI4_Msk
#define BTIM_AIFR_UI5_Pos (4U)
#define BTIM_AIFR_UI5_Msk (0x1UL << BTIM_AIFR_UI5_Pos)
#define BTIM_AIFR_UI5 BTIM_AIFR_UI5_Msk
#define BTIM_AIFR_TI5_Pos (5U)
#define BTIM_AIFR_TI5_Msk (0x1UL << BTIM_AIFR_TI5_Pos)
#define BTIM_AIFR_TI5 BTIM_AIFR_TI5_Msk

// BTIM_AICR
#define BTIM_AICR_UI3_Pos (0U)
#define BTIM_AICR_UI3_Msk (0x1UL << BTIM_AICR_UI3_Pos)
#define BTIM_AICR_UI3 BTIM_AICR_UI3_Msk
#define BTIM_AICR_TI3_Pos (1U)
#define BTIM_AICR_TI3_Msk (0x1UL << BTIM_AICR_TI3_Pos)
#define BTIM_AICR_TI3 BTIM_AICR_TI3_Msk
#define BTIM_AICR_UI4_Pos (2U)
#define BTIM_AICR_UI4_Msk (0x1UL << BTIM_AICR_UI4_Pos)
#define BTIM_AICR_UI4 BTIM_AICR_UI4_Msk
#define BTIM_AICR_TI4_Pos (3U)
#define BTIM_AICR_TI4_Msk (0x1UL << BTIM_AICR_TI4_Pos)
#define BTIM_AICR_TI4 BTIM_AICR_TI4_Msk
#define BTIM_AICR_UI5_Pos (4U)
#define BTIM_AICR_UI5_Msk (0x1UL << BTIM_AICR_UI5_Pos)
#define BTIM_AICR_UI5 BTIM_AICR_UI5_Msk
#define BTIM_AICR_TI5_Pos (5U)
#define BTIM_AICR_TI5_Msk (0x1UL << BTIM_AICR_TI5_Pos)
#define BTIM_AICR_TI5 BTIM_AICR_TI5_Msk

//********************    Bits Define For Peripheral CTRIM    ********************//
// CTRIM_ARR
#define CTRIM_ARR_ARR_Pos (0U)
#define CTRIM_ARR_ARR_Msk (0xFFFFUL << CTRIM_ARR_ARR_Pos)
#define CTRIM_ARR_ARR CTRIM_ARR_ARR_Msk

// CTRIM_CNT
#define CTRIM_CNT_CNT_Pos (0U)
#define CTRIM_CNT_CNT_Msk (0xFFFFUL << CTRIM_CNT_CNT_Pos)
#define CTRIM_CNT_CNT CTRIM_CNT_CNT_Msk

// CTRIM_CR0
#define CTRIM_CR0_STEP_Pos (0U)
#define CTRIM_CR0_STEP_Msk (0x7UL << CTRIM_CR0_STEP_Pos)
#define CTRIM_CR0_STEP CTRIM_CR0_STEP_Msk
#define CTRIM_CR0_ETRFLT_Pos (4U)
#define CTRIM_CR0_ETRFLT_Msk (0x7UL << CTRIM_CR0_ETRFLT_Pos)
#define CTRIM_CR0_ETRFLT CTRIM_CR0_ETRFLT_Msk
#define CTRIM_CR0_SRC_Pos (8U)
#define CTRIM_CR0_SRC_Msk (0x7UL << CTRIM_CR0_SRC_Pos)
#define CTRIM_CR0_SRC CTRIM_CR0_SRC_Msk

// CTRIM_CR1
#define CTRIM_CR1_EN_Pos (0U)
#define CTRIM_CR1_EN_Msk (0x1UL << CTRIM_CR1_EN_Pos)
#define CTRIM_CR1_EN CTRIM_CR1_EN_Msk
#define CTRIM_CR1_MD_Pos (1U)
#define CTRIM_CR1_MD_Msk (0x3UL << CTRIM_CR1_MD_Pos)
#define CTRIM_CR1_MD CTRIM_CR1_MD_Msk
#define CTRIM_CR1_AUTO_Pos (3U)
#define CTRIM_CR1_AUTO_Msk (0x1UL << CTRIM_CR1_AUTO_Pos)
#define CTRIM_CR1_AUTO CTRIM_CR1_AUTO_Msk
#define CTRIM_CR1_PRS_Pos (4U)
#define CTRIM_CR1_PRS_Msk (0xFUL << CTRIM_CR1_PRS_Pos)
#define CTRIM_CR1_PRS CTRIM_CR1_PRS_Msk
#define CTRIM_CR1_OST_Pos (8U)
#define CTRIM_CR1_OST_Msk (0x1UL << CTRIM_CR1_OST_Pos)
#define CTRIM_CR1_OST CTRIM_CR1_OST_Msk

