kepler-444b/HC32F002/mcu/common/HC32F002.h
// CTRIM_IER
#define CTRIM_IER_UD_Pos (0U)
#define CTRIM_IER_UD_Msk (0x1UL << CTRIM_IER_UD_Pos)
#define CTRIM_IER_UD CTRIM_IER_UD_Msk
#define CTRIM_IER_END_Pos (1U)
#define CTRIM_IER_END_Msk (0x1UL << CTRIM_IER_END_Pos)
#define CTRIM_IER_END CTRIM_IER_END_Msk
#define CTRIM_IER_PS_Pos (2U)
#define CTRIM_IER_PS_Msk (0x1UL << CTRIM_IER_PS_Pos)
#define CTRIM_IER_PS CTRIM_IER_PS_Msk
#define CTRIM_IER_MISS_Pos (3U)
#define CTRIM_IER_MISS_Msk (0x1UL << CTRIM_IER_MISS_Pos)
#define CTRIM_IER_MISS CTRIM_IER_MISS_Msk
#define CTRIM_IER_OV_Pos (4U)
#define CTRIM_IER_OV_Msk (0x1UL << CTRIM_IER_OV_Pos)
#define CTRIM_IER_OV CTRIM_IER_OV_Msk

// CTRIM_ISR
#define CTRIM_ISR_UD_Pos (0U)
#define CTRIM_ISR_UD_Msk (0x1UL << CTRIM_ISR_UD_Pos)
#define CTRIM_ISR_UD CTRIM_ISR_UD_Msk
#define CTRIM_ISR_END_Pos (1U)
#define CTRIM_ISR_END_Msk (0x1UL << CTRIM_ISR_END_Pos)
#define CTRIM_ISR_END CTRIM_ISR_END_Msk
#define CTRIM_ISR_PS_Pos (2U)
#define CTRIM_ISR_PS_Msk (0x1UL << CTRIM_ISR_PS_Pos)
#define CTRIM_ISR_PS CTRIM_ISR_PS_Msk
#define CTRIM_ISR_MISS_Pos (3U)
#define CTRIM_ISR_MISS_Msk (0x1UL << CTRIM_ISR_MISS_Pos)
#define CTRIM_ISR_MISS CTRIM_ISR_MISS_Msk
#define CTRIM_ISR_OV_Pos (4U)
#define CTRIM_ISR_OV_Msk (0x1UL << CTRIM_ISR_OV_Pos)
#define CTRIM_ISR_OV CTRIM_ISR_OV_Msk
#define CTRIM_ISR_DIR_Pos (5U)
#define CTRIM_ISR_DIR_Msk (0x1UL << CTRIM_ISR_DIR_Pos)
#define CTRIM_ISR_DIR CTRIM_ISR_DIR_Msk
#define CTRIM_ISR_OK_Pos (6U)
#define CTRIM_ISR_OK_Msk (0x1UL << CTRIM_ISR_OK_Pos)
#define CTRIM_ISR_OK CTRIM_ISR_OK_Msk

// CTRIM_ICR
#define CTRIM_ICR_UD_Pos (0U)
#define CTRIM_ICR_UD_Msk (0x1UL << CTRIM_ICR_UD_Pos)
#define CTRIM_ICR_UD CTRIM_ICR_UD_Msk
#define CTRIM_ICR_END_Pos (1U)
#define CTRIM_ICR_END_Msk (0x1UL << CTRIM_ICR_END_Pos)
#define CTRIM_ICR_END CTRIM_ICR_END_Msk
#define CTRIM_ICR_PS_Pos (2U)
#define CTRIM_ICR_PS_Msk (0x1UL << CTRIM_ICR_PS_Pos)
#define CTRIM_ICR_PS CTRIM_ICR_PS_Msk
#define CTRIM_ICR_MISS_Pos (3U)
#define CTRIM_ICR_MISS_Msk (0x1UL << CTRIM_ICR_MISS_Pos)
#define CTRIM_ICR_MISS CTRIM_ICR_MISS_Msk
#define CTRIM_ICR_OV_Pos (4U)
#define CTRIM_ICR_OV_Msk (0x1UL << CTRIM_ICR_OV_Pos)
#define CTRIM_ICR_OV CTRIM_ICR_OV_Msk
#define CTRIM_ICR_OK_Pos (5U)
#define CTRIM_ICR_OK_Msk (0x1UL << CTRIM_ICR_OK_Pos)
#define CTRIM_ICR_OK CTRIM_ICR_OK_Msk

// CTRIM_FCAP
#define CTRIM_FCAP_FCAP_Pos (0U)
#define CTRIM_FCAP_FCAP_Msk (0xFFFFUL << CTRIM_FCAP_FCAP_Pos)
#define CTRIM_FCAP_FCAP CTRIM_FCAP_FCAP_Msk

// CTRIM_TVAL
#define CTRIM_TVAL_TVAL_Pos (0U)
#define CTRIM_TVAL_TVAL_Msk (0xFFFFUL << CTRIM_TVAL_TVAL_Pos)
#define CTRIM_TVAL_TVAL CTRIM_TVAL_TVAL_Msk

// CTRIM_FLIM
#define CTRIM_FLIM_FLIM_Pos (0U)
#define CTRIM_FLIM_FLIM_Msk (0xFFUL << CTRIM_FLIM_FLIM_Pos)
#define CTRIM_FLIM_FLIM CTRIM_FLIM_FLIM_Msk

//********************    Bits Define For Peripheral FLASH    ********************//
// FLASH_CR
#define FLASH_CR_OP_Pos (0U)
#define FLASH_CR_OP_Msk (0x3UL << FLASH_CR_OP_Pos)
#define FLASH_CR_OP FLASH_CR_OP_Msk
#define FLASH_CR_BUSY_Pos (4U)
#define FLASH_CR_BUSY_Msk (0x1UL << FLASH_CR_BUSY_Pos)
#define FLASH_CR_BUSY FLASH_CR_BUSY_Msk
#define FLASH_CR_PCIE_Pos (5U)
#define FLASH_CR_PCIE_Msk (0x1UL << FLASH_CR_PCIE_Pos)
#define FLASH_CR_PCIE FLASH_CR_PCIE_Msk
#define FLASH_CR_FLASHIE_Pos (6U)
#define FLASH_CR_FLASHIE_Msk (0x1UL << FLASH_CR_FLASHIE_Pos)
#define FLASH_CR_FLASHIE FLASH_CR_FLASHIE_Msk
#define FLASH_CR_LPMODE_Pos (9U)
#define FLASH_CR_LPMODE_Msk (0x1UL << FLASH_CR_LPMODE_Pos)
#define FLASH_CR_LPMODE FLASH_CR_LPMODE_Msk

// FLASH_IFR
#define FLASH_IFR_PC_Pos (0U)
#define FLASH_IFR_PC_Msk (0x1UL << FLASH_IFR_PC_Pos)
#define FLASH_IFR_PC FLASH_IFR_PC_Msk
#define FLASH_IFR_FLASH_Pos (1U)
#define FLASH_IFR_FLASH_Msk (0x1UL << FLASH_IFR_FLASH_Pos)
#define FLASH_IFR_FLASH FLASH_IFR_FLASH_Msk

// FLASH_ICLR
#define FLASH_ICLR_PC_Pos (0U)
#define FLASH_ICLR_PC_Msk (0x1UL << FLASH_ICLR_PC_Pos)
#define FLASH_ICLR_PC FLASH_ICLR_PC_Msk
#define FLASH_ICLR_FLASH_Pos (1U)
#define FLASH_ICLR_FLASH_Msk (0x1UL << FLASH_ICLR_FLASH_Pos)
#define FLASH_ICLR_FLASH FLASH_ICLR_FLASH_Msk

// FLASH_BYPASS
#define FLASH_BYPASS_BYPASS_Pos (0U)
#define FLASH_BYPASS_BYPASS_Msk (0xFFFFUL << FLASH_BYPASS_BYPASS_Pos)
#define FLASH_BYPASS_BYPASS FLASH_BYPASS_BYPASS_Msk

// FLASH_SLOCK
#define FLASH_SLOCK_SLOCK_Pos (0U)
#define FLASH_SLOCK_SLOCK_Msk (0x1FFUL << FLASH_SLOCK_SLOCK_Pos)
#define FLASH_SLOCK_SLOCK FLASH_SLOCK_SLOCK_Msk

// FLASH_WAIT
#define FLASH_WAIT_WAIT_Pos (0U)
#define FLASH_WAIT_WAIT_Msk (0x3UL << FLASH_WAIT_WAIT_Pos)
#define FLASH_WAIT_WAIT FLASH_WAIT_WAIT_Msk

// FLASH_LOCKSTATE
#define FLASH_LOCKSTATE_STATE_Pos (0U)
#define FLASH_LOCKSTATE_STATE_Msk (0x3UL << FLASH_LOCKSTATE_STATE_Pos)
#define FLASH_LOCKSTATE_STATE FLASH_LOCKSTATE_STATE_Msk

//********************    Bits Define For Peripheral GPIO    ********************//
// GPIO_ADS
#define GPIO_ADS_PIN0_Pos (0U)
#define GPIO_ADS_PIN0_Msk (0x1UL << GPIO_ADS_PIN0_Pos)
#define GPIO_ADS_PIN0 GPIO_ADS_PIN0_Msk
#define GPIO_ADS_PIN1_Pos (1U)
#define GPIO_ADS_PIN1_Msk (0x1UL << GPIO_ADS_PIN1_Pos)
#define GPIO_ADS_PIN1 GPIO_ADS_PIN1_Msk
#define GPIO_ADS_PIN2_Pos (2U)
#define GPIO_ADS_PIN2_Msk (0x1UL << GPIO_ADS_PIN2_Pos)
#define GPIO_ADS_PIN2 GPIO_ADS_PIN2_Msk
#define GPIO_ADS_PIN3_Pos (3U)
#define GPIO_ADS_PIN3_Msk (0x1UL << GPIO_ADS_PIN3_Pos)
#define GPIO_ADS_PIN3 GPIO_ADS_PIN3_Msk
#define GPIO_ADS_PIN4_Pos (4U)
#define GPIO_ADS_PIN4_Msk (0x1UL << GPIO_ADS_PIN4_Pos)
#define GPIO_ADS_PIN4 GPIO_ADS_PIN4_Msk
#define GPIO_ADS_PIN5_Pos (5U)
#define GPIO_ADS_PIN5_Msk (0x1UL << GPIO_ADS_PIN5_Pos)
#define GPIO_ADS_PIN5 GPIO_ADS_PIN5_Msk
#define GPIO_ADS_PIN6_Pos (6U)
#define GPIO_ADS_PIN6_Msk (0x1UL << GPIO_ADS_PIN6_Pos)
#define GPIO_ADS_PIN6 GPIO_ADS_PIN6_Msk
#define GPIO_ADS_PIN7_Pos (7U)
#define GPIO_ADS_PIN7_Msk (0x1UL << GPIO_ADS_PIN7_Pos)
#define GPIO_ADS_PIN7 GPIO_ADS_PIN7_Msk

// GPIO_DIR
#define GPIO_DIR_PIN0_Pos (0U)
#define GPIO_DIR_PIN0_Msk (0x1UL << GPIO_DIR_PIN0_Pos)
#define GPIO_DIR_PIN0 GPIO_DIR_PIN0_Msk
#define GPIO_DIR_PIN1_Pos (1U)
#define GPIO_DIR_PIN1_Msk (0x1UL << GPIO_DIR_PIN1_Pos)
#define GPIO_DIR_PIN1 GPIO_DIR_PIN1_Msk
#define GPIO_DIR_PIN2_Pos (2U)
#define GPIO_DIR_PIN2_Msk (0x1UL << GPIO_DIR_PIN2_Pos)
#define GPIO_DIR_PIN2 GPIO_DIR_PIN2_Msk
#define GPIO_DIR_PIN3_Pos (3U)
#define GPIO_DIR_PIN3_Msk (0x1UL << GPIO_DIR_PIN3_Pos)
#define GPIO_DIR_PIN3 GPIO_DIR_PIN3_Msk
#define GPIO_DIR_PIN4_Pos (4U)
#define GPIO_DIR_PIN4_Msk (0x1UL << GPIO_DIR_PIN4_Pos)
#define GPIO_DIR_PIN4 GPIO_DIR_PIN4_Msk
#define GPIO_DIR_PIN5_Pos (5U)
#define GPIO_DIR_PIN5_Msk (0x1UL << GPIO_DIR_PIN5_Pos)
#define GPIO_DIR_PIN5 GPIO_DIR_PIN5_Msk
#define GPIO_DIR_PIN6_Pos (6U)
#define GPIO_DIR_PIN6_Msk (0x1UL << GPIO_DIR_PIN6_Pos)
#define GPIO_DIR_PIN6 GPIO_DIR_PIN6_Msk
#define GPIO_DIR_PIN7_Pos (7U)
#define GPIO_DIR_PIN7_Msk (0x1UL << GPIO_DIR_PIN7_Pos)
#define GPIO_DIR_PIN7 GPIO_DIR_PIN7_Msk

