kepler-444b/HC32F002/mcu/common/HC32F002.h
// GPIO_OPENDRAIN
#define GPIO_OPENDRAIN_PIN0_Pos (0U)
#define GPIO_OPENDRAIN_PIN0_Msk (0x1UL << GPIO_OPENDRAIN_PIN0_Pos)
#define GPIO_OPENDRAIN_PIN0 GPIO_OPENDRAIN_PIN0_Msk
#define GPIO_OPENDRAIN_PIN1_Pos (1U)
#define GPIO_OPENDRAIN_PIN1_Msk (0x1UL << GPIO_OPENDRAIN_PIN1_Pos)
#define GPIO_OPENDRAIN_PIN1 GPIO_OPENDRAIN_PIN1_Msk
#define GPIO_OPENDRAIN_PIN2_Pos (2U)
#define GPIO_OPENDRAIN_PIN2_Msk (0x1UL << GPIO_OPENDRAIN_PIN2_Pos)
#define GPIO_OPENDRAIN_PIN2 GPIO_OPENDRAIN_PIN2_Msk
#define GPIO_OPENDRAIN_PIN3_Pos (3U)
#define GPIO_OPENDRAIN_PIN3_Msk (0x1UL << GPIO_OPENDRAIN_PIN3_Pos)
#define GPIO_OPENDRAIN_PIN3 GPIO_OPENDRAIN_PIN3_Msk
#define GPIO_OPENDRAIN_PIN4_Pos (4U)
#define GPIO_OPENDRAIN_PIN4_Msk (0x1UL << GPIO_OPENDRAIN_PIN4_Pos)
#define GPIO_OPENDRAIN_PIN4 GPIO_OPENDRAIN_PIN4_Msk
#define GPIO_OPENDRAIN_PIN5_Pos (5U)
#define GPIO_OPENDRAIN_PIN5_Msk (0x1UL << GPIO_OPENDRAIN_PIN5_Pos)
#define GPIO_OPENDRAIN_PIN5 GPIO_OPENDRAIN_PIN5_Msk
#define GPIO_OPENDRAIN_PIN6_Pos (6U)
#define GPIO_OPENDRAIN_PIN6_Msk (0x1UL << GPIO_OPENDRAIN_PIN6_Pos)
#define GPIO_OPENDRAIN_PIN6 GPIO_OPENDRAIN_PIN6_Msk
#define GPIO_OPENDRAIN_PIN7_Pos (7U)
#define GPIO_OPENDRAIN_PIN7_Msk (0x1UL << GPIO_OPENDRAIN_PIN7_Pos)
#define GPIO_OPENDRAIN_PIN7 GPIO_OPENDRAIN_PIN7_Msk

// GPIO_PU
#define GPIO_PU_PIN0_Pos (0U)
#define GPIO_PU_PIN0_Msk (0x1UL << GPIO_PU_PIN0_Pos)
#define GPIO_PU_PIN0 GPIO_PU_PIN0_Msk
#define GPIO_PU_PIN1_Pos (1U)
#define GPIO_PU_PIN1_Msk (0x1UL << GPIO_PU_PIN1_Pos)
#define GPIO_PU_PIN1 GPIO_PU_PIN1_Msk
#define GPIO_PU_PIN2_Pos (2U)
#define GPIO_PU_PIN2_Msk (0x1UL << GPIO_PU_PIN2_Pos)
#define GPIO_PU_PIN2 GPIO_PU_PIN2_Msk
#define GPIO_PU_PIN3_Pos (3U)
#define GPIO_PU_PIN3_Msk (0x1UL << GPIO_PU_PIN3_Pos)
#define GPIO_PU_PIN3 GPIO_PU_PIN3_Msk
#define GPIO_PU_PIN4_Pos (4U)
#define GPIO_PU_PIN4_Msk (0x1UL << GPIO_PU_PIN4_Pos)
#define GPIO_PU_PIN4 GPIO_PU_PIN4_Msk
#define GPIO_PU_PIN5_Pos (5U)
#define GPIO_PU_PIN5_Msk (0x1UL << GPIO_PU_PIN5_Pos)
#define GPIO_PU_PIN5 GPIO_PU_PIN5_Msk
#define GPIO_PU_PIN6_Pos (6U)
#define GPIO_PU_PIN6_Msk (0x1UL << GPIO_PU_PIN6_Pos)
#define GPIO_PU_PIN6 GPIO_PU_PIN6_Msk
#define GPIO_PU_PIN7_Pos (7U)
#define GPIO_PU_PIN7_Msk (0x1UL << GPIO_PU_PIN7_Pos)
#define GPIO_PU_PIN7 GPIO_PU_PIN7_Msk

// GPIO_IN
#define GPIO_IN_PIN0_Pos (0U)
#define GPIO_IN_PIN0_Msk (0x1UL << GPIO_IN_PIN0_Pos)
#define GPIO_IN_PIN0 GPIO_IN_PIN0_Msk
#define GPIO_IN_PIN1_Pos (1U)
#define GPIO_IN_PIN1_Msk (0x1UL << GPIO_IN_PIN1_Pos)
#define GPIO_IN_PIN1 GPIO_IN_PIN1_Msk
#define GPIO_IN_PIN2_Pos (2U)
#define GPIO_IN_PIN2_Msk (0x1UL << GPIO_IN_PIN2_Pos)
#define GPIO_IN_PIN2 GPIO_IN_PIN2_Msk
#define GPIO_IN_PIN3_Pos (3U)
#define GPIO_IN_PIN3_Msk (0x1UL << GPIO_IN_PIN3_Pos)
#define GPIO_IN_PIN3 GPIO_IN_PIN3_Msk
#define GPIO_IN_PIN4_Pos (4U)
#define GPIO_IN_PIN4_Msk (0x1UL << GPIO_IN_PIN4_Pos)
#define GPIO_IN_PIN4 GPIO_IN_PIN4_Msk
#define GPIO_IN_PIN5_Pos (5U)
#define GPIO_IN_PIN5_Msk (0x1UL << GPIO_IN_PIN5_Pos)
#define GPIO_IN_PIN5 GPIO_IN_PIN5_Msk
#define GPIO_IN_PIN6_Pos (6U)
#define GPIO_IN_PIN6_Msk (0x1UL << GPIO_IN_PIN6_Pos)
#define GPIO_IN_PIN6 GPIO_IN_PIN6_Msk
#define GPIO_IN_PIN7_Pos (7U)
#define GPIO_IN_PIN7_Msk (0x1UL << GPIO_IN_PIN7_Pos)
#define GPIO_IN_PIN7 GPIO_IN_PIN7_Msk

// GPIO_OUT
#define GPIO_OUT_PIN0_Pos (0U)
#define GPIO_OUT_PIN0_Msk (0x1UL << GPIO_OUT_PIN0_Pos)
#define GPIO_OUT_PIN0 GPIO_OUT_PIN0_Msk
#define GPIO_OUT_PIN1_Pos (1U)
#define GPIO_OUT_PIN1_Msk (0x1UL << GPIO_OUT_PIN1_Pos)
#define GPIO_OUT_PIN1 GPIO_OUT_PIN1_Msk
#define GPIO_OUT_PIN2_Pos (2U)
#define GPIO_OUT_PIN2_Msk (0x1UL << GPIO_OUT_PIN2_Pos)
#define GPIO_OUT_PIN2 GPIO_OUT_PIN2_Msk
#define GPIO_OUT_PIN3_Pos (3U)
#define GPIO_OUT_PIN3_Msk (0x1UL << GPIO_OUT_PIN3_Pos)
#define GPIO_OUT_PIN3 GPIO_OUT_PIN3_Msk
#define GPIO_OUT_PIN4_Pos (4U)
#define GPIO_OUT_PIN4_Msk (0x1UL << GPIO_OUT_PIN4_Pos)
#define GPIO_OUT_PIN4 GPIO_OUT_PIN4_Msk
#define GPIO_OUT_PIN5_Pos (5U)
#define GPIO_OUT_PIN5_Msk (0x1UL << GPIO_OUT_PIN5_Pos)
#define GPIO_OUT_PIN5 GPIO_OUT_PIN5_Msk
#define GPIO_OUT_PIN6_Pos (6U)
#define GPIO_OUT_PIN6_Msk (0x1UL << GPIO_OUT_PIN6_Pos)
#define GPIO_OUT_PIN6 GPIO_OUT_PIN6_Msk
#define GPIO_OUT_PIN7_Pos (7U)
#define GPIO_OUT_PIN7_Msk (0x1UL << GPIO_OUT_PIN7_Pos)
#define GPIO_OUT_PIN7 GPIO_OUT_PIN7_Msk

// GPIO_BRR
#define GPIO_BRR_PIN0_Pos (0U)
#define GPIO_BRR_PIN0_Msk (0x1UL << GPIO_BRR_PIN0_Pos)
#define GPIO_BRR_PIN0 GPIO_BRR_PIN0_Msk
#define GPIO_BRR_PIN1_Pos (1U)
#define GPIO_BRR_PIN1_Msk (0x1UL << GPIO_BRR_PIN1_Pos)
#define GPIO_BRR_PIN1 GPIO_BRR_PIN1_Msk
#define GPIO_BRR_PIN2_Pos (2U)
#define GPIO_BRR_PIN2_Msk (0x1UL << GPIO_BRR_PIN2_Pos)
#define GPIO_BRR_PIN2 GPIO_BRR_PIN2_Msk
#define GPIO_BRR_PIN3_Pos (3U)
#define GPIO_BRR_PIN3_Msk (0x1UL << GPIO_BRR_PIN3_Pos)
#define GPIO_BRR_PIN3 GPIO_BRR_PIN3_Msk
#define GPIO_BRR_PIN4_Pos (4U)
#define GPIO_BRR_PIN4_Msk (0x1UL << GPIO_BRR_PIN4_Pos)
#define GPIO_BRR_PIN4 GPIO_BRR_PIN4_Msk
#define GPIO_BRR_PIN5_Pos (5U)
#define GPIO_BRR_PIN5_Msk (0x1UL << GPIO_BRR_PIN5_Pos)
#define GPIO_BRR_PIN5 GPIO_BRR_PIN5_Msk
#define GPIO_BRR_PIN6_Pos (6U)
#define GPIO_BRR_PIN6_Msk (0x1UL << GPIO_BRR_PIN6_Pos)
#define GPIO_BRR_PIN6 GPIO_BRR_PIN6_Msk
#define GPIO_BRR_PIN7_Pos (7U)
#define GPIO_BRR_PIN7_Msk (0x1UL << GPIO_BRR_PIN7_Pos)
#define GPIO_BRR_PIN7 GPIO_BRR_PIN7_Msk

// GPIO_BSRR
#define GPIO_BSRR_BSPIN0_Pos (0U)
#define GPIO_BSRR_BSPIN0_Msk (0x1UL << GPIO_BSRR_BSPIN0_Pos)
#define GPIO_BSRR_BSPIN0 GPIO_BSRR_BSPIN0_Msk
#define GPIO_BSRR_BSPIN1_Pos (1U)
#define GPIO_BSRR_BSPIN1_Msk (0x1UL << GPIO_BSRR_BSPIN1_Pos)
#define GPIO_BSRR_BSPIN1 GPIO_BSRR_BSPIN1_Msk
#define GPIO_BSRR_BSPIN2_Pos (2U)
#define GPIO_BSRR_BSPIN2_Msk (0x1UL << GPIO_BSRR_BSPIN2_Pos)
#define GPIO_BSRR_BSPIN2 GPIO_BSRR_BSPIN2_Msk
#define GPIO_BSRR_BSPIN3_Pos (3U)
#define GPIO_BSRR_BSPIN3_Msk (0x1UL << GPIO_BSRR_BSPIN3_Pos)
#define GPIO_BSRR_BSPIN3 GPIO_BSRR_BSPIN3_Msk
#define GPIO_BSRR_BSPIN4_Pos (4U)
#define GPIO_BSRR_BSPIN4_Msk (0x1UL << GPIO_BSRR_BSPIN4_Pos)
#define GPIO_BSRR_BSPIN4 GPIO_BSRR_BSPIN4_Msk
#define GPIO_BSRR_BSPIN5_Pos (5U)
#define GPIO_BSRR_BSPIN5_Msk (0x1UL << GPIO_BSRR_BSPIN5_Pos)
#define GPIO_BSRR_BSPIN5 GPIO_BSRR_BSPIN5_Msk
#define GPIO_BSRR_BSPIN6_Pos (6U)
#define GPIO_BSRR_BSPIN6_Msk (0x1UL << GPIO_BSRR_BSPIN6_Pos)
#define GPIO_BSRR_BSPIN6 GPIO_BSRR_BSPIN6_Msk
#define GPIO_BSRR_BSPIN7_Pos (7U)
#define GPIO_BSRR_BSPIN7_Msk (0x1UL << GPIO_BSRR_BSPIN7_Pos)
#define GPIO_BSRR_BSPIN7 GPIO_BSRR_BSPIN7_Msk
#define GPIO_BSRR_BRPIN0_Pos (16U)
#define GPIO_BSRR_BRPIN0_Msk (0x1UL << GPIO_BSRR_BRPIN0_Pos)
#define GPIO_BSRR_BRPIN0 GPIO_BSRR_BRPIN0_Msk
#define GPIO_BSRR_BRPIN1_Pos (17U)
#define GPIO_BSRR_BRPIN1_Msk (0x1UL << GPIO_BSRR_BRPIN1_Pos)
#define GPIO_BSRR_BRPIN1 GPIO_BSRR_BRPIN1_Msk
#define GPIO_BSRR_BRPIN2_Pos (18U)
#define GPIO_BSRR_BRPIN2_Msk (0x1UL << GPIO_BSRR_BRPIN2_Pos)
#define GPIO_BSRR_BRPIN2 GPIO_BSRR_BRPIN2_Msk
#define GPIO_BSRR_BRPIN3_Pos (19U)
#define GPIO_BSRR_BRPIN3_Msk (0x1UL << GPIO_BSRR_BRPIN3_Pos)
#define GPIO_BSRR_BRPIN3 GPIO_BSRR_BRPIN3_Msk
#define GPIO_BSRR_BRPIN4_Pos (20U)
#define GPIO_BSRR_BRPIN4_Msk (0x1UL << GPIO_BSRR_BRPIN4_Pos)
#define GPIO_BSRR_BRPIN4 GPIO_BSRR_BRPIN4_Msk
#define GPIO_BSRR_BRPIN5_Pos (21U)
#define GPIO_BSRR_BRPIN5_Msk (0x1UL << GPIO_BSRR_BRPIN5_Pos)
#define GPIO_BSRR_BRPIN5 GPIO_BSRR_BRPIN5_Msk
#define GPIO_BSRR_BRPIN6_Pos (22U)
#define GPIO_BSRR_BRPIN6_Msk (0x1UL << GPIO_BSRR_BRPIN6_Pos)
#define GPIO_BSRR_BRPIN6 GPIO_BSRR_BRPIN6_Msk
#define GPIO_BSRR_BRPIN7_Pos (23U)
#define GPIO_BSRR_BRPIN7_Msk (0x1UL << GPIO_BSRR_BRPIN7_Pos)
#define GPIO_BSRR_BRPIN7 GPIO_BSRR_BRPIN7_Msk

// GPIO_AFRL
#define GPIO_AFRL_AFSEL0_Pos (0U)
#define GPIO_AFRL_AFSEL0_Msk (0xFUL << GPIO_AFRL_AFSEL0_Pos)
#define GPIO_AFRL_AFSEL0 GPIO_AFRL_AFSEL0_Msk
#define GPIO_AFRL_AFSEL1_Pos (4U)
#define GPIO_AFRL_AFSEL1_Msk (0xFUL << GPIO_AFRL_AFSEL1_Pos)
#define GPIO_AFRL_AFSEL1 GPIO_AFRL_AFSEL1_Msk
#define GPIO_AFRL_AFSEL2_Pos (8U)
#define GPIO_AFRL_AFSEL2_Msk (0xFUL << GPIO_AFRL_AFSEL2_Pos)
#define GPIO_AFRL_AFSEL2 GPIO_AFRL_AFSEL2_Msk
#define GPIO_AFRL_AFSEL3_Pos (12U)
#define GPIO_AFRL_AFSEL3_Msk (0xFUL << GPIO_AFRL_AFSEL3_Pos)
#define GPIO_AFRL_AFSEL3 GPIO_AFRL_AFSEL3_Msk
#define GPIO_AFRL_AFSEL4_Pos (16U)
#define GPIO_AFRL_AFSEL4_Msk (0xFUL << GPIO_AFRL_AFSEL4_Pos)
#define GPIO_AFRL_AFSEL4 GPIO_AFRL_AFSEL4_Msk
#define GPIO_AFRL_AFSEL5_Pos (20U)
#define GPIO_AFRL_AFSEL5_Msk (0xFUL << GPIO_AFRL_AFSEL5_Pos)
#define GPIO_AFRL_AFSEL5 GPIO_AFRL_AFSEL5_Msk
#define GPIO_AFRL_AFSEL6_Pos (24U)
#define GPIO_AFRL_AFSEL6_Msk (0xFUL << GPIO_AFRL_AFSEL6_Pos)
#define GPIO_AFRL_AFSEL6 GPIO_AFRL_AFSEL6_Msk
#define GPIO_AFRL_AFSEL7_Pos (28U)
#define GPIO_AFRL_AFSEL7_Msk (0xFUL << GPIO_AFRL_AFSEL7_Pos)
#define GPIO_AFRL_AFSEL7 GPIO_AFRL_AFSEL7_Msk

