kepler-444b/HC32F002/mcu/common/HC32F002.h
// GPIO_HIGHIE
#define GPIO_HIGHIE_PIN0_Pos (0U)
#define GPIO_HIGHIE_PIN0_Msk (0x1UL << GPIO_HIGHIE_PIN0_Pos)
#define GPIO_HIGHIE_PIN0 GPIO_HIGHIE_PIN0_Msk
#define GPIO_HIGHIE_PIN1_Pos (1U)
#define GPIO_HIGHIE_PIN1_Msk (0x1UL << GPIO_HIGHIE_PIN1_Pos)
#define GPIO_HIGHIE_PIN1 GPIO_HIGHIE_PIN1_Msk
#define GPIO_HIGHIE_PIN2_Pos (2U)
#define GPIO_HIGHIE_PIN2_Msk (0x1UL << GPIO_HIGHIE_PIN2_Pos)
#define GPIO_HIGHIE_PIN2 GPIO_HIGHIE_PIN2_Msk
#define GPIO_HIGHIE_PIN3_Pos (3U)
#define GPIO_HIGHIE_PIN3_Msk (0x1UL << GPIO_HIGHIE_PIN3_Pos)
#define GPIO_HIGHIE_PIN3 GPIO_HIGHIE_PIN3_Msk
#define GPIO_HIGHIE_PIN4_Pos (4U)
#define GPIO_HIGHIE_PIN4_Msk (0x1UL << GPIO_HIGHIE_PIN4_Pos)
#define GPIO_HIGHIE_PIN4 GPIO_HIGHIE_PIN4_Msk
#define GPIO_HIGHIE_PIN5_Pos (5U)
#define GPIO_HIGHIE_PIN5_Msk (0x1UL << GPIO_HIGHIE_PIN5_Pos)
#define GPIO_HIGHIE_PIN5 GPIO_HIGHIE_PIN5_Msk
#define GPIO_HIGHIE_PIN6_Pos (6U)
#define GPIO_HIGHIE_PIN6_Msk (0x1UL << GPIO_HIGHIE_PIN6_Pos)
#define GPIO_HIGHIE_PIN6 GPIO_HIGHIE_PIN6_Msk
#define GPIO_HIGHIE_PIN7_Pos (7U)
#define GPIO_HIGHIE_PIN7_Msk (0x1UL << GPIO_HIGHIE_PIN7_Pos)
#define GPIO_HIGHIE_PIN7 GPIO_HIGHIE_PIN7_Msk

// GPIO_LOWIE
#define GPIO_LOWIE_PIN0_Pos (0U)
#define GPIO_LOWIE_PIN0_Msk (0x1UL << GPIO_LOWIE_PIN0_Pos)
#define GPIO_LOWIE_PIN0 GPIO_LOWIE_PIN0_Msk
#define GPIO_LOWIE_PIN1_Pos (1U)
#define GPIO_LOWIE_PIN1_Msk (0x1UL << GPIO_LOWIE_PIN1_Pos)
#define GPIO_LOWIE_PIN1 GPIO_LOWIE_PIN1_Msk
#define GPIO_LOWIE_PIN2_Pos (2U)
#define GPIO_LOWIE_PIN2_Msk (0x1UL << GPIO_LOWIE_PIN2_Pos)
#define GPIO_LOWIE_PIN2 GPIO_LOWIE_PIN2_Msk
#define GPIO_LOWIE_PIN3_Pos (3U)
#define GPIO_LOWIE_PIN3_Msk (0x1UL << GPIO_LOWIE_PIN3_Pos)
#define GPIO_LOWIE_PIN3 GPIO_LOWIE_PIN3_Msk
#define GPIO_LOWIE_PIN4_Pos (4U)
#define GPIO_LOWIE_PIN4_Msk (0x1UL << GPIO_LOWIE_PIN4_Pos)
#define GPIO_LOWIE_PIN4 GPIO_LOWIE_PIN4_Msk
#define GPIO_LOWIE_PIN5_Pos (5U)
#define GPIO_LOWIE_PIN5_Msk (0x1UL << GPIO_LOWIE_PIN5_Pos)
#define GPIO_LOWIE_PIN5 GPIO_LOWIE_PIN5_Msk
#define GPIO_LOWIE_PIN6_Pos (6U)
#define GPIO_LOWIE_PIN6_Msk (0x1UL << GPIO_LOWIE_PIN6_Pos)
#define GPIO_LOWIE_PIN6 GPIO_LOWIE_PIN6_Msk
#define GPIO_LOWIE_PIN7_Pos (7U)
#define GPIO_LOWIE_PIN7_Msk (0x1UL << GPIO_LOWIE_PIN7_Pos)
#define GPIO_LOWIE_PIN7 GPIO_LOWIE_PIN7_Msk

// GPIO_RISEIE
#define GPIO_RISEIE_PIN0_Pos (0U)
#define GPIO_RISEIE_PIN0_Msk (0x1UL << GPIO_RISEIE_PIN0_Pos)
#define GPIO_RISEIE_PIN0 GPIO_RISEIE_PIN0_Msk
#define GPIO_RISEIE_PIN1_Pos (1U)
#define GPIO_RISEIE_PIN1_Msk (0x1UL << GPIO_RISEIE_PIN1_Pos)
#define GPIO_RISEIE_PIN1 GPIO_RISEIE_PIN1_Msk
#define GPIO_RISEIE_PIN2_Pos (2U)
#define GPIO_RISEIE_PIN2_Msk (0x1UL << GPIO_RISEIE_PIN2_Pos)
#define GPIO_RISEIE_PIN2 GPIO_RISEIE_PIN2_Msk
#define GPIO_RISEIE_PIN3_Pos (3U)
#define GPIO_RISEIE_PIN3_Msk (0x1UL << GPIO_RISEIE_PIN3_Pos)
#define GPIO_RISEIE_PIN3 GPIO_RISEIE_PIN3_Msk
#define GPIO_RISEIE_PIN4_Pos (4U)
#define GPIO_RISEIE_PIN4_Msk (0x1UL << GPIO_RISEIE_PIN4_Pos)
#define GPIO_RISEIE_PIN4 GPIO_RISEIE_PIN4_Msk
#define GPIO_RISEIE_PIN5_Pos (5U)
#define GPIO_RISEIE_PIN5_Msk (0x1UL << GPIO_RISEIE_PIN5_Pos)
#define GPIO_RISEIE_PIN5 GPIO_RISEIE_PIN5_Msk
#define GPIO_RISEIE_PIN6_Pos (6U)
#define GPIO_RISEIE_PIN6_Msk (0x1UL << GPIO_RISEIE_PIN6_Pos)
#define GPIO_RISEIE_PIN6 GPIO_RISEIE_PIN6_Msk
#define GPIO_RISEIE_PIN7_Pos (7U)
#define GPIO_RISEIE_PIN7_Msk (0x1UL << GPIO_RISEIE_PIN7_Pos)
#define GPIO_RISEIE_PIN7 GPIO_RISEIE_PIN7_Msk

// GPIO_FALLIE
#define GPIO_FALLIE_PIN0_Pos (0U)
#define GPIO_FALLIE_PIN0_Msk (0x1UL << GPIO_FALLIE_PIN0_Pos)
#define GPIO_FALLIE_PIN0 GPIO_FALLIE_PIN0_Msk
#define GPIO_FALLIE_PIN1_Pos (1U)
#define GPIO_FALLIE_PIN1_Msk (0x1UL << GPIO_FALLIE_PIN1_Pos)
#define GPIO_FALLIE_PIN1 GPIO_FALLIE_PIN1_Msk
#define GPIO_FALLIE_PIN2_Pos (2U)
#define GPIO_FALLIE_PIN2_Msk (0x1UL << GPIO_FALLIE_PIN2_Pos)
#define GPIO_FALLIE_PIN2 GPIO_FALLIE_PIN2_Msk
#define GPIO_FALLIE_PIN3_Pos (3U)
#define GPIO_FALLIE_PIN3_Msk (0x1UL << GPIO_FALLIE_PIN3_Pos)
#define GPIO_FALLIE_PIN3 GPIO_FALLIE_PIN3_Msk
#define GPIO_FALLIE_PIN4_Pos (4U)
#define GPIO_FALLIE_PIN4_Msk (0x1UL << GPIO_FALLIE_PIN4_Pos)
#define GPIO_FALLIE_PIN4 GPIO_FALLIE_PIN4_Msk
#define GPIO_FALLIE_PIN5_Pos (5U)
#define GPIO_FALLIE_PIN5_Msk (0x1UL << GPIO_FALLIE_PIN5_Pos)
#define GPIO_FALLIE_PIN5 GPIO_FALLIE_PIN5_Msk
#define GPIO_FALLIE_PIN6_Pos (6U)
#define GPIO_FALLIE_PIN6_Msk (0x1UL << GPIO_FALLIE_PIN6_Pos)
#define GPIO_FALLIE_PIN6 GPIO_FALLIE_PIN6_Msk
#define GPIO_FALLIE_PIN7_Pos (7U)
#define GPIO_FALLIE_PIN7_Msk (0x1UL << GPIO_FALLIE_PIN7_Pos)
#define GPIO_FALLIE_PIN7 GPIO_FALLIE_PIN7_Msk

// GPIO_IFR
#define GPIO_IFR_PIN0_Pos (0U)
#define GPIO_IFR_PIN0_Msk (0x1UL << GPIO_IFR_PIN0_Pos)
#define GPIO_IFR_PIN0 GPIO_IFR_PIN0_Msk
#define GPIO_IFR_PIN1_Pos (1U)
#define GPIO_IFR_PIN1_Msk (0x1UL << GPIO_IFR_PIN1_Pos)
#define GPIO_IFR_PIN1 GPIO_IFR_PIN1_Msk
#define GPIO_IFR_PIN2_Pos (2U)
#define GPIO_IFR_PIN2_Msk (0x1UL << GPIO_IFR_PIN2_Pos)
#define GPIO_IFR_PIN2 GPIO_IFR_PIN2_Msk
#define GPIO_IFR_PIN3_Pos (3U)
#define GPIO_IFR_PIN3_Msk (0x1UL << GPIO_IFR_PIN3_Pos)
#define GPIO_IFR_PIN3 GPIO_IFR_PIN3_Msk
#define GPIO_IFR_PIN4_Pos (4U)
#define GPIO_IFR_PIN4_Msk (0x1UL << GPIO_IFR_PIN4_Pos)
#define GPIO_IFR_PIN4 GPIO_IFR_PIN4_Msk
#define GPIO_IFR_PIN5_Pos (5U)
#define GPIO_IFR_PIN5_Msk (0x1UL << GPIO_IFR_PIN5_Pos)
#define GPIO_IFR_PIN5 GPIO_IFR_PIN5_Msk
#define GPIO_IFR_PIN6_Pos (6U)
#define GPIO_IFR_PIN6_Msk (0x1UL << GPIO_IFR_PIN6_Pos)
#define GPIO_IFR_PIN6 GPIO_IFR_PIN6_Msk
#define GPIO_IFR_PIN7_Pos (7U)
#define GPIO_IFR_PIN7_Msk (0x1UL << GPIO_IFR_PIN7_Pos)
#define GPIO_IFR_PIN7 GPIO_IFR_PIN7_Msk

// GPIO_ICR
#define GPIO_ICR_PIN0_Pos (0U)
#define GPIO_ICR_PIN0_Msk (0x1UL << GPIO_ICR_PIN0_Pos)
#define GPIO_ICR_PIN0 GPIO_ICR_PIN0_Msk
#define GPIO_ICR_PIN1_Pos (1U)
#define GPIO_ICR_PIN1_Msk (0x1UL << GPIO_ICR_PIN1_Pos)
#define GPIO_ICR_PIN1 GPIO_ICR_PIN1_Msk
#define GPIO_ICR_PIN2_Pos (2U)
#define GPIO_ICR_PIN2_Msk (0x1UL << GPIO_ICR_PIN2_Pos)
#define GPIO_ICR_PIN2 GPIO_ICR_PIN2_Msk
#define GPIO_ICR_PIN3_Pos (3U)
#define GPIO_ICR_PIN3_Msk (0x1UL << GPIO_ICR_PIN3_Pos)
#define GPIO_ICR_PIN3 GPIO_ICR_PIN3_Msk
#define GPIO_ICR_PIN4_Pos (4U)
#define GPIO_ICR_PIN4_Msk (0x1UL << GPIO_ICR_PIN4_Pos)
#define GPIO_ICR_PIN4 GPIO_ICR_PIN4_Msk
#define GPIO_ICR_PIN5_Pos (5U)
#define GPIO_ICR_PIN5_Msk (0x1UL << GPIO_ICR_PIN5_Pos)
#define GPIO_ICR_PIN5 GPIO_ICR_PIN5_Msk
#define GPIO_ICR_PIN6_Pos (6U)
#define GPIO_ICR_PIN6_Msk (0x1UL << GPIO_ICR_PIN6_Pos)
#define GPIO_ICR_PIN6 GPIO_ICR_PIN6_Msk
#define GPIO_ICR_PIN7_Pos (7U)
#define GPIO_ICR_PIN7_Msk (0x1UL << GPIO_ICR_PIN7_Pos)
#define GPIO_ICR_PIN7 GPIO_ICR_PIN7_Msk

