kepler-444b/HC32F002/mcu/common/HC32F002.h
//********************    Bits Define For Peripheral GPIOAUX    ********************//
// GPIOAUX_CR1
#define GPIOAUX_CR1_TCLKSRC_Pos (0U)
#define GPIOAUX_CR1_TCLKSRC_Msk (0x3UL << GPIOAUX_CR1_TCLKSRC_Pos)
#define GPIOAUX_CR1_TCLKSRC GPIOAUX_CR1_TCLKSRC_Msk
#define GPIOAUX_CR1_TCLKDIV_Pos (3U)
#define GPIOAUX_CR1_TCLKDIV_Msk (0x3UL << GPIOAUX_CR1_TCLKDIV_Pos)
#define GPIOAUX_CR1_TCLKDIV GPIOAUX_CR1_TCLKDIV_Msk

// GPIOAUX_CR4
#define GPIOAUX_CR4_ATIM3CH0A_Pos (4U)
#define GPIOAUX_CR4_ATIM3CH0A_Msk (0x3UL << GPIOAUX_CR4_ATIM3CH0A_Pos)
#define GPIOAUX_CR4_ATIM3CH0A GPIOAUX_CR4_ATIM3CH0A_Msk
#define GPIOAUX_CR4_GTIMCH1_Pos (8U)
#define GPIOAUX_CR4_GTIMCH1_Msk (0x3UL << GPIOAUX_CR4_GTIMCH1_Pos)
#define GPIOAUX_CR4_GTIMCH1 GPIOAUX_CR4_GTIMCH1_Msk

//********************    Bits Define For Peripheral GTIM    ********************//
// GTIM_ARR
#define GTIM_ARR_ARR_Pos (0U)
#define GTIM_ARR_ARR_Msk (0xFFFFUL << GTIM_ARR_ARR_Pos)
#define GTIM_ARR_ARR GTIM_ARR_ARR_Msk

// GTIM_CNT
#define GTIM_CNT_CNT_Pos (0U)
#define GTIM_CNT_CNT_Msk (0xFFFFUL << GTIM_CNT_CNT_Pos)
#define GTIM_CNT_CNT GTIM_CNT_CNT_Msk

// GTIM_CMMR
#define GTIM_CMMR_CC0M_Pos (0U)
#define GTIM_CMMR_CC0M_Msk (0x7UL << GTIM_CMMR_CC0M_Pos)
#define GTIM_CMMR_CC0M GTIM_CMMR_CC0M_Msk
#define GTIM_CMMR_CC1M_Pos (4U)
#define GTIM_CMMR_CC1M_Msk (0x7UL << GTIM_CMMR_CC1M_Pos)
#define GTIM_CMMR_CC1M GTIM_CMMR_CC1M_Msk
#define GTIM_CMMR_CC2M_Pos (8U)
#define GTIM_CMMR_CC2M_Msk (0x7UL << GTIM_CMMR_CC2M_Pos)
#define GTIM_CMMR_CC2M GTIM_CMMR_CC2M_Msk
#define GTIM_CMMR_CC3M_Pos (12U)
#define GTIM_CMMR_CC3M_Msk (0x7UL << GTIM_CMMR_CC3M_Pos)
#define GTIM_CMMR_CC3M GTIM_CMMR_CC3M_Msk

// GTIM_CR1
#define GTIM_CR1_ETRFLT_Pos (4U)
#define GTIM_CR1_ETRFLT_Msk (0x7UL << GTIM_CR1_ETRFLT_Pos)
#define GTIM_CR1_ETRFLT GTIM_CR1_ETRFLT_Msk

// GTIM_CR0
#define GTIM_CR0_CEN_Pos (0U)
#define GTIM_CR0_CEN_Msk (0x1UL << GTIM_CR0_CEN_Pos)
#define GTIM_CR0_CEN GTIM_CR0_CEN_Msk
#define GTIM_CR0_MD_Pos (1U)
#define GTIM_CR0_MD_Msk (0x3UL << GTIM_CR0_MD_Pos)
#define GTIM_CR0_MD GTIM_CR0_MD_Msk
#define GTIM_CR0_TOGEN_Pos (3U)
#define GTIM_CR0_TOGEN_Msk (0x1UL << GTIM_CR0_TOGEN_Pos)
#define GTIM_CR0_TOGEN GTIM_CR0_TOGEN_Msk
#define GTIM_CR0_PRS_Pos (4U)
#define GTIM_CR0_PRS_Msk (0xFUL << GTIM_CR0_PRS_Pos)
#define GTIM_CR0_PRS GTIM_CR0_PRS_Msk
#define GTIM_CR0_OST_Pos (8U)
#define GTIM_CR0_OST_Msk (0x1UL << GTIM_CR0_OST_Pos)
#define GTIM_CR0_OST GTIM_CR0_OST_Msk
#define GTIM_CR0_TRS_Pos (9U)
#define GTIM_CR0_TRS_Msk (0x3UL << GTIM_CR0_TRS_Pos)
#define GTIM_CR0_TRS GTIM_CR0_TRS_Msk
#define GTIM_CR0_ETP_Pos (11U)
#define GTIM_CR0_ETP_Msk (0x1UL << GTIM_CR0_ETP_Pos)
#define GTIM_CR0_ETP GTIM_CR0_ETP_Msk

// GTIM_IER
#define GTIM_IER_UI_Pos (0U)
#define GTIM_IER_UI_Msk (0x1UL << GTIM_IER_UI_Pos)
#define GTIM_IER_UI GTIM_IER_UI_Msk
#define GTIM_IER_TI_Pos (1U)
#define GTIM_IER_TI_Msk (0x1UL << GTIM_IER_TI_Pos)
#define GTIM_IER_TI GTIM_IER_TI_Msk
#define GTIM_IER_CC0_Pos (2U)
#define GTIM_IER_CC0_Msk (0x1UL << GTIM_IER_CC0_Pos)
#define GTIM_IER_CC0 GTIM_IER_CC0_Msk
#define GTIM_IER_CC1_Pos (3U)
#define GTIM_IER_CC1_Msk (0x1UL << GTIM_IER_CC1_Pos)
#define GTIM_IER_CC1 GTIM_IER_CC1_Msk
#define GTIM_IER_CC2_Pos (4U)
#define GTIM_IER_CC2_Msk (0x1UL << GTIM_IER_CC2_Pos)
#define GTIM_IER_CC2 GTIM_IER_CC2_Msk
#define GTIM_IER_CC3_Pos (5U)
#define GTIM_IER_CC3_Msk (0x1UL << GTIM_IER_CC3_Pos)
#define GTIM_IER_CC3 GTIM_IER_CC3_Msk

// GTIM_IFR
#define GTIM_IFR_UI_Pos (0U)
#define GTIM_IFR_UI_Msk (0x1UL << GTIM_IFR_UI_Pos)
#define GTIM_IFR_UI GTIM_IFR_UI_Msk
#define GTIM_IFR_TI_Pos (1U)
#define GTIM_IFR_TI_Msk (0x1UL << GTIM_IFR_TI_Pos)
#define GTIM_IFR_TI GTIM_IFR_TI_Msk
#define GTIM_IFR_CC0_Pos (2U)
#define GTIM_IFR_CC0_Msk (0x1UL << GTIM_IFR_CC0_Pos)
#define GTIM_IFR_CC0 GTIM_IFR_CC0_Msk
#define GTIM_IFR_CC1_Pos (3U)
#define GTIM_IFR_CC1_Msk (0x1UL << GTIM_IFR_CC1_Pos)
#define GTIM_IFR_CC1 GTIM_IFR_CC1_Msk
#define GTIM_IFR_CC2_Pos (4U)
#define GTIM_IFR_CC2_Msk (0x1UL << GTIM_IFR_CC2_Pos)
#define GTIM_IFR_CC2 GTIM_IFR_CC2_Msk
#define GTIM_IFR_CC3_Pos (5U)
#define GTIM_IFR_CC3_Msk (0x1UL << GTIM_IFR_CC3_Pos)
#define GTIM_IFR_CC3 GTIM_IFR_CC3_Msk

// GTIM_ICR
#define GTIM_ICR_UI_Pos (0U)
#define GTIM_ICR_UI_Msk (0x1UL << GTIM_ICR_UI_Pos)
#define GTIM_ICR_UI GTIM_ICR_UI_Msk
#define GTIM_ICR_TI_Pos (1U)
#define GTIM_ICR_TI_Msk (0x1UL << GTIM_ICR_TI_Pos)
#define GTIM_ICR_TI GTIM_ICR_TI_Msk
#define GTIM_ICR_CC0_Pos (2U)
#define GTIM_ICR_CC0_Msk (0x1UL << GTIM_ICR_CC0_Pos)
#define GTIM_ICR_CC0 GTIM_ICR_CC0_Msk
#define GTIM_ICR_CC1_Pos (3U)
#define GTIM_ICR_CC1_Msk (0x1UL << GTIM_ICR_CC1_Pos)
#define GTIM_ICR_CC1 GTIM_ICR_CC1_Msk
#define GTIM_ICR_CC2_Pos (4U)
#define GTIM_ICR_CC2_Msk (0x1UL << GTIM_ICR_CC2_Pos)
#define GTIM_ICR_CC2 GTIM_ICR_CC2_Msk
#define GTIM_ICR_CC3_Pos (5U)
#define GTIM_ICR_CC3_Msk (0x1UL << GTIM_ICR_CC3_Pos)
#define GTIM_ICR_CC3 GTIM_ICR_CC3_Msk

// GTIM_CCR0
#define GTIM_CCR0_CCR_Pos (0U)
#define GTIM_CCR0_CCR_Msk (0xFFFFUL << GTIM_CCR0_CCR_Pos)
#define GTIM_CCR0_CCR GTIM_CCR0_CCR_Msk

// GTIM_CCR1
#define GTIM_CCR1_CCR_Pos (0U)
#define GTIM_CCR1_CCR_Msk (0xFFFFUL << GTIM_CCR1_CCR_Pos)
#define GTIM_CCR1_CCR GTIM_CCR1_CCR_Msk

// GTIM_CCR2
#define GTIM_CCR2_CCR_Pos (0U)
#define GTIM_CCR2_CCR_Msk (0xFFFFUL << GTIM_CCR2_CCR_Pos)
#define GTIM_CCR2_CCR GTIM_CCR2_CCR_Msk

// GTIM_CCR3
#define GTIM_CCR3_CCR_Pos (0U)
#define GTIM_CCR3_CCR_Msk (0xFFFFUL << GTIM_CCR3_CCR_Pos)
#define GTIM_CCR3_CCR GTIM_CCR3_CCR_Msk

//********************    Bits Define For Peripheral I2C    ********************//
// I2C_BRREN
#define I2C_BRREN_EN_Pos (0U)
#define I2C_BRREN_EN_Msk (0x1UL << I2C_BRREN_EN_Pos)
#define I2C_BRREN_EN I2C_BRREN_EN_Msk

// I2C_BRR
#define I2C_BRR_BRR_Pos (0U)
#define I2C_BRR_BRR_Msk (0xFFUL << I2C_BRR_BRR_Pos)
#define I2C_BRR_BRR I2C_BRR_BRR_Msk

// I2C_CR
#define I2C_CR_FLT_Pos (0U)
#define I2C_CR_FLT_Msk (0x1UL << I2C_CR_FLT_Pos)
#define I2C_CR_FLT I2C_CR_FLT_Msk
#define I2C_CR_AA_Pos (2U)
#define I2C_CR_AA_Msk (0x1UL << I2C_CR_AA_Pos)
#define I2C_CR_AA I2C_CR_AA_Msk
#define I2C_CR_SI_Pos (3U)
#define I2C_CR_SI_Msk (0x1UL << I2C_CR_SI_Pos)
#define I2C_CR_SI I2C_CR_SI_Msk
#define I2C_CR_STO_Pos (4U)
#define I2C_CR_STO_Msk (0x1UL << I2C_CR_STO_Pos)
#define I2C_CR_STO I2C_CR_STO_Msk
#define I2C_CR_STA_Pos (5U)
#define I2C_CR_STA_Msk (0x1UL << I2C_CR_STA_Pos)
#define I2C_CR_STA I2C_CR_STA_Msk
#define I2C_CR_EN_Pos (6U)
#define I2C_CR_EN_Msk (0x1UL << I2C_CR_EN_Pos)
#define I2C_CR_EN I2C_CR_EN_Msk

// I2C_DR
#define I2C_DR_DR_Pos (0U)
#define I2C_DR_DR_Msk (0xFFUL << I2C_DR_DR_Pos)
#define I2C_DR_DR I2C_DR_DR_Msk

