kepler-444b/HC32F002/mcu/common/HC32F002.h
// I2C_ADDR0
#define I2C_ADDR0_GC_Pos (0U)
#define I2C_ADDR0_GC_Msk (0x1UL << I2C_ADDR0_GC_Pos)
#define I2C_ADDR0_GC I2C_ADDR0_GC_Msk
#define I2C_ADDR0_ADDR0_Pos (1U)
#define I2C_ADDR0_ADDR0_Msk (0x7FUL << I2C_ADDR0_ADDR0_Pos)
#define I2C_ADDR0_ADDR0 I2C_ADDR0_ADDR0_Msk

// I2C_STAT
#define I2C_STAT_STAT_Pos (0U)
#define I2C_STAT_STAT_Msk (0xFFUL << I2C_STAT_STAT_Pos)
#define I2C_STAT_STAT I2C_STAT_STAT_Msk

// I2C_ADDR1
#define I2C_ADDR1_ADDR_Pos (1U)
#define I2C_ADDR1_ADDR_Msk (0x7FUL << I2C_ADDR1_ADDR_Pos)
#define I2C_ADDR1_ADDR I2C_ADDR1_ADDR_Msk

// I2C_ADDR2
#define I2C_ADDR2_ADDR_Pos (1U)
#define I2C_ADDR2_ADDR_Msk (0x7FUL << I2C_ADDR2_ADDR_Pos)
#define I2C_ADDR2_ADDR I2C_ADDR2_ADDR_Msk

// I2C_MATCH
#define I2C_MATCH_AD0F_Pos (0U)
#define I2C_MATCH_AD0F_Msk (0x1UL << I2C_MATCH_AD0F_Pos)
#define I2C_MATCH_AD0F I2C_MATCH_AD0F_Msk
#define I2C_MATCH_AD1F_Pos (1U)
#define I2C_MATCH_AD1F_Msk (0x1UL << I2C_MATCH_AD1F_Pos)
#define I2C_MATCH_AD1F I2C_MATCH_AD1F_Msk
#define I2C_MATCH_AD2F_Pos (2U)
#define I2C_MATCH_AD2F_Msk (0x1UL << I2C_MATCH_AD2F_Pos)
#define I2C_MATCH_AD2F I2C_MATCH_AD2F_Msk

//********************    Bits Define For Peripheral IWDT    ********************//
// IWDT_KR
#define IWDT_KR_KR_Pos (0U)
#define IWDT_KR_KR_Msk (0xFFFFUL << IWDT_KR_KR_Pos)
#define IWDT_KR_KR IWDT_KR_KR_Msk

// IWDT_CR
#define IWDT_CR_PRS_Pos (0U)
#define IWDT_CR_PRS_Msk (0xFUL << IWDT_CR_PRS_Pos)
#define IWDT_CR_PRS IWDT_CR_PRS_Msk
#define IWDT_CR_IE_Pos (4U)
#define IWDT_CR_IE_Msk (0x1UL << IWDT_CR_IE_Pos)
#define IWDT_CR_IE IWDT_CR_IE_Msk
#define IWDT_CR_ACTION_Pos (5U)
#define IWDT_CR_ACTION_Msk (0x1UL << IWDT_CR_ACTION_Pos)
#define IWDT_CR_ACTION IWDT_CR_ACTION_Msk
#define IWDT_CR_PAUSE_Pos (6U)
#define IWDT_CR_PAUSE_Msk (0x1UL << IWDT_CR_PAUSE_Pos)
#define IWDT_CR_PAUSE IWDT_CR_PAUSE_Msk

// IWDT_ARR
#define IWDT_ARR_ARR_Pos (0U)
#define IWDT_ARR_ARR_Msk (0xFFFUL << IWDT_ARR_ARR_Pos)
#define IWDT_ARR_ARR IWDT_ARR_ARR_Msk

// IWDT_SR
#define IWDT_SR_PRSF_Pos (0U)
#define IWDT_SR_PRSF_Msk (0x1UL << IWDT_SR_PRSF_Pos)
#define IWDT_SR_PRSF IWDT_SR_PRSF_Msk
#define IWDT_SR_ARRF_Pos (1U)
#define IWDT_SR_ARRF_Msk (0x1UL << IWDT_SR_ARRF_Pos)
#define IWDT_SR_ARRF IWDT_SR_ARRF_Msk
#define IWDT_SR_WINRF_Pos (2U)
#define IWDT_SR_WINRF_Msk (0x1UL << IWDT_SR_WINRF_Pos)
#define IWDT_SR_WINRF IWDT_SR_WINRF_Msk
#define IWDT_SR_OV_Pos (3U)
#define IWDT_SR_OV_Msk (0x1UL << IWDT_SR_OV_Pos)
#define IWDT_SR_OV IWDT_SR_OV_Msk
#define IWDT_SR_RUN_Pos (4U)
#define IWDT_SR_RUN_Msk (0x1UL << IWDT_SR_RUN_Pos)
#define IWDT_SR_RUN IWDT_SR_RUN_Msk

// IWDT_WINR
#define IWDT_WINR_WINR_Pos (0U)
#define IWDT_WINR_WINR_Msk (0xFFFUL << IWDT_WINR_WINR_Pos)
#define IWDT_WINR_WINR IWDT_WINR_WINR_Msk

//********************    Bits Define For Peripheral LPUART    ********************//
// LPUART_DR
#define LPUART_DR_DR_Pos (0U)
#define LPUART_DR_DR_Msk (0xFFUL << LPUART_DR_DR_Pos)
#define LPUART_DR_DR LPUART_DR_DR_Msk
#define LPUART_DR_DR8_Pos (8U)
#define LPUART_DR_DR8_Msk (0x1UL << LPUART_DR_DR8_Pos)
#define LPUART_DR_DR8 LPUART_DR_DR8_Msk

// LPUART_CR
#define LPUART_CR_RCIE_Pos (0U)
#define LPUART_CR_RCIE_Msk (0x1UL << LPUART_CR_RCIE_Pos)
#define LPUART_CR_RCIE LPUART_CR_RCIE_Msk
#define LPUART_CR_TCIE_Pos (1U)
#define LPUART_CR_TCIE_Msk (0x1UL << LPUART_CR_TCIE_Pos)
#define LPUART_CR_TCIE LPUART_CR_TCIE_Msk
#define LPUART_CR_DR8CFG_Pos (2U)
#define LPUART_CR_DR8CFG_Msk (0x3UL << LPUART_CR_DR8CFG_Pos)
#define LPUART_CR_DR8CFG LPUART_CR_DR8CFG_Msk
#define LPUART_CR_RXEN_Pos (4U)
#define LPUART_CR_RXEN_Msk (0x1UL << LPUART_CR_RXEN_Pos)
#define LPUART_CR_RXEN LPUART_CR_RXEN_Msk
#define LPUART_CR_ADRDET_Pos (5U)
#define LPUART_CR_ADRDET_Msk (0x1UL << LPUART_CR_ADRDET_Pos)
#define LPUART_CR_ADRDET LPUART_CR_ADRDET_Msk
#define LPUART_CR_MODE_Pos (6U)
#define LPUART_CR_MODE_Msk (0x3UL << LPUART_CR_MODE_Pos)
#define LPUART_CR_MODE LPUART_CR_MODE_Msk
#define LPUART_CR_TXEIE_Pos (8U)
#define LPUART_CR_TXEIE_Msk (0x1UL << LPUART_CR_TXEIE_Pos)
#define LPUART_CR_TXEIE LPUART_CR_TXEIE_Msk
#define LPUART_CR_OVER_Pos (9U)
#define LPUART_CR_OVER_Msk (0x3UL << LPUART_CR_OVER_Pos)
#define LPUART_CR_OVER LPUART_CR_OVER_Msk
#define LPUART_CR_CLKSRC_Pos (11U)
#define LPUART_CR_CLKSRC_Msk (0x3UL << LPUART_CR_CLKSRC_Pos)
#define LPUART_CR_CLKSRC LPUART_CR_CLKSRC_Msk
#define LPUART_CR_PEIE_Pos (13U)
#define LPUART_CR_PEIE_Msk (0x1UL << LPUART_CR_PEIE_Pos)
#define LPUART_CR_PEIE LPUART_CR_PEIE_Msk
#define LPUART_CR_STOP_Pos (14U)
#define LPUART_CR_STOP_Msk (0x3UL << LPUART_CR_STOP_Pos)
#define LPUART_CR_STOP LPUART_CR_STOP_Msk
#define LPUART_CR_RTSEN_Pos (18U)
#define LPUART_CR_RTSEN_Msk (0x1UL << LPUART_CR_RTSEN_Pos)
#define LPUART_CR_RTSEN LPUART_CR_RTSEN_Msk
#define LPUART_CR_CTSEN_Pos (19U)
#define LPUART_CR_CTSEN_Msk (0x1UL << LPUART_CR_CTSEN_Pos)
#define LPUART_CR_CTSEN LPUART_CR_CTSEN_Msk
#define LPUART_CR_CTSIE_Pos (20U)
#define LPUART_CR_CTSIE_Msk (0x1UL << LPUART_CR_CTSIE_Pos)
#define LPUART_CR_CTSIE LPUART_CR_CTSIE_Msk
#define LPUART_CR_FEIE_Pos (21U)
#define LPUART_CR_FEIE_Msk (0x1UL << LPUART_CR_FEIE_Pos)
#define LPUART_CR_FEIE LPUART_CR_FEIE_Msk
#define LPUART_CR_HDSEL_Pos (22U)
#define LPUART_CR_HDSEL_Msk (0x1UL << LPUART_CR_HDSEL_Pos)
#define LPUART_CR_HDSEL LPUART_CR_HDSEL_Msk

// LPUART_ADDR
#define LPUART_ADDR_ADDR_Pos (0U)
#define LPUART_ADDR_ADDR_Msk (0xFFUL << LPUART_ADDR_ADDR_Pos)
#define LPUART_ADDR_ADDR LPUART_ADDR_ADDR_Msk

// LPUART_ADDRMASK
#define LPUART_ADDRMASK_MASK_Pos (0U)
#define LPUART_ADDRMASK_MASK_Msk (0xFFUL << LPUART_ADDRMASK_MASK_Pos)
#define LPUART_ADDRMASK_MASK LPUART_ADDRMASK_MASK_Msk

// LPUART_ISR
#define LPUART_ISR_RC_Pos (0U)
#define LPUART_ISR_RC_Msk (0x1UL << LPUART_ISR_RC_Pos)
#define LPUART_ISR_RC LPUART_ISR_RC_Msk
#define LPUART_ISR_TC_Pos (1U)
#define LPUART_ISR_TC_Msk (0x1UL << LPUART_ISR_TC_Pos)
#define LPUART_ISR_TC LPUART_ISR_TC_Msk
#define LPUART_ISR_FE_Pos (2U)
#define LPUART_ISR_FE_Msk (0x1UL << LPUART_ISR_FE_Pos)
#define LPUART_ISR_FE LPUART_ISR_FE_Msk
#define LPUART_ISR_TXE_Pos (3U)
#define LPUART_ISR_TXE_Msk (0x1UL << LPUART_ISR_TXE_Pos)
#define LPUART_ISR_TXE LPUART_ISR_TXE_Msk
#define LPUART_ISR_PE_Pos (4U)
#define LPUART_ISR_PE_Msk (0x1UL << LPUART_ISR_PE_Pos)
#define LPUART_ISR_PE LPUART_ISR_PE_Msk
#define LPUART_ISR_CTSIF_Pos (5U)
#define LPUART_ISR_CTSIF_Msk (0x1UL << LPUART_ISR_CTSIF_Pos)
#define LPUART_ISR_CTSIF LPUART_ISR_CTSIF_Msk
#define LPUART_ISR_CTS_Pos (6U)
#define LPUART_ISR_CTS_Msk (0x1UL << LPUART_ISR_CTS_Pos)
#define LPUART_ISR_CTS LPUART_ISR_CTS_Msk

// LPUART_ICR
#define LPUART_ICR_RC_Pos (0U)
#define LPUART_ICR_RC_Msk (0x1UL << LPUART_ICR_RC_Pos)
#define LPUART_ICR_RC LPUART_ICR_RC_Msk
#define LPUART_ICR_TC_Pos (1U)
#define LPUART_ICR_TC_Msk (0x1UL << LPUART_ICR_TC_Pos)
#define LPUART_ICR_TC LPUART_ICR_TC_Msk
#define LPUART_ICR_FE_Pos (2U)
#define LPUART_ICR_FE_Msk (0x1UL << LPUART_ICR_FE_Pos)
#define LPUART_ICR_FE LPUART_ICR_FE_Msk
#define LPUART_ICR_PE_Pos (4U)
#define LPUART_ICR_PE_Msk (0x1UL << LPUART_ICR_PE_Pos)
#define LPUART_ICR_PE LPUART_ICR_PE_Msk
#define LPUART_ICR_CTSIF_Pos (5U)
#define LPUART_ICR_CTSIF_Msk (0x1UL << LPUART_ICR_CTSIF_Pos)
#define LPUART_ICR_CTSIF LPUART_ICR_CTSIF_Msk

