kepler-444b/HC32F002/mcu/common/HC32F002.h
//********************    Bits Define For Peripheral SYSCTRL    ********************//
// SYSCTRL_CR0
#define SYSCTRL_CR0_CLKSRC_Pos (0U)
#define SYSCTRL_CR0_CLKSRC_Msk (0x7UL << SYSCTRL_CR0_CLKSRC_Pos)
#define SYSCTRL_CR0_CLKSRC SYSCTRL_CR0_CLKSRC_Msk
#define SYSCTRL_CR0_HCLKPRS_Pos (3U)
#define SYSCTRL_CR0_HCLKPRS_Msk (0x7UL << SYSCTRL_CR0_HCLKPRS_Pos)
#define SYSCTRL_CR0_HCLKPRS SYSCTRL_CR0_HCLKPRS_Msk
#define SYSCTRL_CR0_PCLKPRS_Pos (6U)
#define SYSCTRL_CR0_PCLKPRS_Msk (0x3UL << SYSCTRL_CR0_PCLKPRS_Pos)
#define SYSCTRL_CR0_PCLKPRS SYSCTRL_CR0_PCLKPRS_Msk

// SYSCTRL_CR1
#define SYSCTRL_CR1_SWDIO_Pos (0U)
#define SYSCTRL_CR1_SWDIO_Msk (0x1UL << SYSCTRL_CR1_SWDIO_Pos)
#define SYSCTRL_CR1_SWDIO SYSCTRL_CR1_SWDIO_Msk
#define SYSCTRL_CR1_LOCKUP_Pos (1U)
#define SYSCTRL_CR1_LOCKUP_Msk (0x1UL << SYSCTRL_CR1_LOCKUP_Pos)
#define SYSCTRL_CR1_LOCKUP SYSCTRL_CR1_LOCKUP_Msk
#define SYSCTRL_CR1_WAKEUPCLK_Pos (2U)
#define SYSCTRL_CR1_WAKEUPCLK_Msk (0x1UL << SYSCTRL_CR1_WAKEUPCLK_Pos)
#define SYSCTRL_CR1_WAKEUPCLK SYSCTRL_CR1_WAKEUPCLK_Msk
#define SYSCTRL_CR1_RESIO_Pos (3U)
#define SYSCTRL_CR1_RESIO_Msk (0x1UL << SYSCTRL_CR1_RESIO_Pos)
#define SYSCTRL_CR1_RESIO SYSCTRL_CR1_RESIO_Msk
#define SYSCTRL_CR1_GTIMCFG_Pos (8U)
#define SYSCTRL_CR1_GTIMCFG_Msk (0x1UL << SYSCTRL_CR1_GTIMCFG_Pos)
#define SYSCTRL_CR1_GTIMCFG SYSCTRL_CR1_GTIMCFG_Msk

// SYSCTRL_CR2
#define SYSCTRL_CR2_RCHEN_Pos (0U)
#define SYSCTRL_CR2_RCHEN_Msk (0x1UL << SYSCTRL_CR2_RCHEN_Pos)
#define SYSCTRL_CR2_RCHEN SYSCTRL_CR2_RCHEN_Msk
#define SYSCTRL_CR2_RCLEN_Pos (2U)
#define SYSCTRL_CR2_RCLEN_Msk (0x1UL << SYSCTRL_CR2_RCLEN_Pos)
#define SYSCTRL_CR2_RCLEN SYSCTRL_CR2_RCLEN_Msk
#define SYSCTRL_CR2_EXTCLKEN_Pos (5U)
#define SYSCTRL_CR2_EXTCLKEN_Msk (0x1UL << SYSCTRL_CR2_EXTCLKEN_Pos)
#define SYSCTRL_CR2_EXTCLKEN SYSCTRL_CR2_EXTCLKEN_Msk

// SYSCTRL_CR3
#define SYSCTRL_CR3_CR3_Pos (0U)
#define SYSCTRL_CR3_CR3_Msk (0xFFFFUL << SYSCTRL_CR3_CR3_Pos)
#define SYSCTRL_CR3_CR3 SYSCTRL_CR3_CR3_Msk

// SYSCTRL_RCH
#define SYSCTRL_RCH_TRIM_Pos (0U)
#define SYSCTRL_RCH_TRIM_Msk (0x1FFUL << SYSCTRL_RCH_TRIM_Pos)
#define SYSCTRL_RCH_TRIM SYSCTRL_RCH_TRIM_Msk
#define SYSCTRL_RCH_DIV_Pos (9U)
#define SYSCTRL_RCH_DIV_Msk (0xFUL << SYSCTRL_RCH_DIV_Pos)
#define SYSCTRL_RCH_DIV SYSCTRL_RCH_DIV_Msk
#define SYSCTRL_RCH_STABLE_Pos (15U)
#define SYSCTRL_RCH_STABLE_Msk (0x1UL << SYSCTRL_RCH_STABLE_Pos)
#define SYSCTRL_RCH_STABLE SYSCTRL_RCH_STABLE_Msk

// SYSCTRL_RCL
#define SYSCTRL_RCL_TRIM_Pos (0U)
#define SYSCTRL_RCL_TRIM_Msk (0x3FFUL << SYSCTRL_RCL_TRIM_Pos)
#define SYSCTRL_RCL_TRIM SYSCTRL_RCL_TRIM_Msk
#define SYSCTRL_RCL_WAITCYCLE_Pos (10U)
#define SYSCTRL_RCL_WAITCYCLE_Msk (0x3UL << SYSCTRL_RCL_WAITCYCLE_Pos)
#define SYSCTRL_RCL_WAITCYCLE SYSCTRL_RCL_WAITCYCLE_Msk
#define SYSCTRL_RCL_STABLE_Pos (15U)
#define SYSCTRL_RCL_STABLE_Msk (0x1UL << SYSCTRL_RCL_STABLE_Pos)
#define SYSCTRL_RCL_STABLE SYSCTRL_RCL_STABLE_Msk

// SYSCTRL_PERICLKEN0
#define SYSCTRL_PERICLKEN0_LPUART0_Pos (2U)
#define SYSCTRL_PERICLKEN0_LPUART0_Msk (0x1UL << SYSCTRL_PERICLKEN0_LPUART0_Pos)
#define SYSCTRL_PERICLKEN0_LPUART0 SYSCTRL_PERICLKEN0_LPUART0_Msk
#define SYSCTRL_PERICLKEN0_LPUART1_Pos (3U)
#define SYSCTRL_PERICLKEN0_LPUART1_Msk (0x1UL << SYSCTRL_PERICLKEN0_LPUART1_Pos)
#define SYSCTRL_PERICLKEN0_LPUART1 SYSCTRL_PERICLKEN0_LPUART1_Msk
#define SYSCTRL_PERICLKEN0_I2C_Pos (4U)
#define SYSCTRL_PERICLKEN0_I2C_Msk (0x1UL << SYSCTRL_PERICLKEN0_I2C_Pos)
#define SYSCTRL_PERICLKEN0_I2C SYSCTRL_PERICLKEN0_I2C_Msk
#define SYSCTRL_PERICLKEN0_SPI_Pos (6U)
#define SYSCTRL_PERICLKEN0_SPI_Msk (0x1UL << SYSCTRL_PERICLKEN0_SPI_Pos)
#define SYSCTRL_PERICLKEN0_SPI SYSCTRL_PERICLKEN0_SPI_Msk
#define SYSCTRL_PERICLKEN0_ATIM3_Pos (11U)
#define SYSCTRL_PERICLKEN0_ATIM3_Msk (0x1UL << SYSCTRL_PERICLKEN0_ATIM3_Pos)
#define SYSCTRL_PERICLKEN0_ATIM3 SYSCTRL_PERICLKEN0_ATIM3_Msk
#define SYSCTRL_PERICLKEN0_IWDT_Pos (15U)
#define SYSCTRL_PERICLKEN0_IWDT_Msk (0x1UL << SYSCTRL_PERICLKEN0_IWDT_Pos)
#define SYSCTRL_PERICLKEN0_IWDT SYSCTRL_PERICLKEN0_IWDT_Msk
#define SYSCTRL_PERICLKEN0_ADC_Pos (16U)
#define SYSCTRL_PERICLKEN0_ADC_Msk (0x1UL << SYSCTRL_PERICLKEN0_ADC_Pos)
#define SYSCTRL_PERICLKEN0_ADC SYSCTRL_PERICLKEN0_ADC_Msk
#define SYSCTRL_PERICLKEN0_CTRIM_Pos (21U)
#define SYSCTRL_PERICLKEN0_CTRIM_Msk (0x1UL << SYSCTRL_PERICLKEN0_CTRIM_Pos)
#define SYSCTRL_PERICLKEN0_CTRIM SYSCTRL_PERICLKEN0_CTRIM_Msk
#define SYSCTRL_PERICLKEN0_FLASH_Pos (31U)
#define SYSCTRL_PERICLKEN0_FLASH_Msk (0x1UL << SYSCTRL_PERICLKEN0_FLASH_Pos)
#define SYSCTRL_PERICLKEN0_FLASH SYSCTRL_PERICLKEN0_FLASH_Msk

// SYSCTRL_PERICLKEN1
#define SYSCTRL_PERICLKEN1_PA_Pos (0U)
#define SYSCTRL_PERICLKEN1_PA_Msk (0x1UL << SYSCTRL_PERICLKEN1_PA_Pos)
#define SYSCTRL_PERICLKEN1_PA SYSCTRL_PERICLKEN1_PA_Msk
#define SYSCTRL_PERICLKEN1_PB_Pos (1U)
#define SYSCTRL_PERICLKEN1_PB_Msk (0x1UL << SYSCTRL_PERICLKEN1_PB_Pos)
#define SYSCTRL_PERICLKEN1_PB SYSCTRL_PERICLKEN1_PB_Msk
#define SYSCTRL_PERICLKEN1_PC_Pos (2U)
#define SYSCTRL_PERICLKEN1_PC_Msk (0x1UL << SYSCTRL_PERICLKEN1_PC_Pos)
#define SYSCTRL_PERICLKEN1_PC SYSCTRL_PERICLKEN1_PC_Msk
#define SYSCTRL_PERICLKEN1_PD_Pos (3U)
#define SYSCTRL_PERICLKEN1_PD_Msk (0x1UL << SYSCTRL_PERICLKEN1_PD_Pos)
#define SYSCTRL_PERICLKEN1_PD SYSCTRL_PERICLKEN1_PD_Msk
#define SYSCTRL_PERICLKEN1_WWDT_Pos (10U)
#define SYSCTRL_PERICLKEN1_WWDT_Msk (0x1UL << SYSCTRL_PERICLKEN1_WWDT_Pos)
#define SYSCTRL_PERICLKEN1_WWDT SYSCTRL_PERICLKEN1_WWDT_Msk
#define SYSCTRL_PERICLKEN1_GTIM_Pos (14U)
#define SYSCTRL_PERICLKEN1_GTIM_Msk (0x1UL << SYSCTRL_PERICLKEN1_GTIM_Pos)
#define SYSCTRL_PERICLKEN1_GTIM SYSCTRL_PERICLKEN1_GTIM_Msk

// SYSCTRL_PERIRESET0
#define SYSCTRL_PERIRESET0_LPUART0_Pos (2U)
#define SYSCTRL_PERIRESET0_LPUART0_Msk (0x1UL << SYSCTRL_PERIRESET0_LPUART0_Pos)
#define SYSCTRL_PERIRESET0_LPUART0 SYSCTRL_PERIRESET0_LPUART0_Msk
#define SYSCTRL_PERIRESET0_LPUART1_Pos (3U)
#define SYSCTRL_PERIRESET0_LPUART1_Msk (0x1UL << SYSCTRL_PERIRESET0_LPUART1_Pos)
#define SYSCTRL_PERIRESET0_LPUART1 SYSCTRL_PERIRESET0_LPUART1_Msk
#define SYSCTRL_PERIRESET0_I2C_Pos (4U)
#define SYSCTRL_PERIRESET0_I2C_Msk (0x1UL << SYSCTRL_PERIRESET0_I2C_Pos)
#define SYSCTRL_PERIRESET0_I2C SYSCTRL_PERIRESET0_I2C_Msk
#define SYSCTRL_PERIRESET0_SPI_Pos (6U)
#define SYSCTRL_PERIRESET0_SPI_Msk (0x1UL << SYSCTRL_PERIRESET0_SPI_Pos)
#define SYSCTRL_PERIRESET0_SPI SYSCTRL_PERIRESET0_SPI_Msk
#define SYSCTRL_PERIRESET0_ATIM3_Pos (11U)
#define SYSCTRL_PERIRESET0_ATIM3_Msk (0x1UL << SYSCTRL_PERIRESET0_ATIM3_Pos)
#define SYSCTRL_PERIRESET0_ATIM3 SYSCTRL_PERIRESET0_ATIM3_Msk
#define SYSCTRL_PERIRESET0_ADC_Pos (16U)
#define SYSCTRL_PERIRESET0_ADC_Msk (0x1UL << SYSCTRL_PERIRESET0_ADC_Pos)
#define SYSCTRL_PERIRESET0_ADC SYSCTRL_PERIRESET0_ADC_Msk
#define SYSCTRL_PERIRESET0_CTRIM_Pos (21U)
#define SYSCTRL_PERIRESET0_CTRIM_Msk (0x1UL << SYSCTRL_PERIRESET0_CTRIM_Pos)
#define SYSCTRL_PERIRESET0_CTRIM SYSCTRL_PERIRESET0_CTRIM_Msk

// SYSCTRL_PERIRESET1
#define SYSCTRL_PERIRESET1_PA_Pos (0U)
#define SYSCTRL_PERIRESET1_PA_Msk (0x1UL << SYSCTRL_PERIRESET1_PA_Pos)
#define SYSCTRL_PERIRESET1_PA SYSCTRL_PERIRESET1_PA_Msk
#define SYSCTRL_PERIRESET1_PB_Pos (1U)
#define SYSCTRL_PERIRESET1_PB_Msk (0x1UL << SYSCTRL_PERIRESET1_PB_Pos)
#define SYSCTRL_PERIRESET1_PB SYSCTRL_PERIRESET1_PB_Msk
#define SYSCTRL_PERIRESET1_PC_Pos (2U)
#define SYSCTRL_PERIRESET1_PC_Msk (0x1UL << SYSCTRL_PERIRESET1_PC_Pos)
#define SYSCTRL_PERIRESET1_PC SYSCTRL_PERIRESET1_PC_Msk
#define SYSCTRL_PERIRESET1_PD_Pos (3U)
#define SYSCTRL_PERIRESET1_PD_Msk (0x1UL << SYSCTRL_PERIRESET1_PD_Pos)
#define SYSCTRL_PERIRESET1_PD SYSCTRL_PERIRESET1_PD_Msk
#define SYSCTRL_PERIRESET1_WWDT_Pos (10U)
#define SYSCTRL_PERIRESET1_WWDT_Msk (0x1UL << SYSCTRL_PERIRESET1_WWDT_Pos)
#define SYSCTRL_PERIRESET1_WWDT SYSCTRL_PERIRESET1_WWDT_Msk
#define SYSCTRL_PERIRESET1_GTIM_Pos (14U)
#define SYSCTRL_PERIRESET1_GTIM_Msk (0x1UL << SYSCTRL_PERIRESET1_GTIM_Pos)
#define SYSCTRL_PERIRESET1_GTIM SYSCTRL_PERIRESET1_GTIM_Msk

// SYSCTRL_RESETFLAG
#define SYSCTRL_RESETFLAG_VCC_Pos (0U)
#define SYSCTRL_RESETFLAG_VCC_Msk (0x1UL << SYSCTRL_RESETFLAG_VCC_Pos)
#define SYSCTRL_RESETFLAG_VCC SYSCTRL_RESETFLAG_VCC_Msk
#define SYSCTRL_RESETFLAG_VCORE_Pos (1U)
#define SYSCTRL_RESETFLAG_VCORE_Msk (0x1UL << SYSCTRL_RESETFLAG_VCORE_Pos)
#define SYSCTRL_RESETFLAG_VCORE SYSCTRL_RESETFLAG_VCORE_Msk
#define SYSCTRL_RESETFLAG_LVD_Pos (2U)
#define SYSCTRL_RESETFLAG_LVD_Msk (0x1UL << SYSCTRL_RESETFLAG_LVD_Pos)
#define SYSCTRL_RESETFLAG_LVD SYSCTRL_RESETFLAG_LVD_Msk
#define SYSCTRL_RESETFLAG_IWDT_Pos (3U)
#define SYSCTRL_RESETFLAG_IWDT_Msk (0x1UL << SYSCTRL_RESETFLAG_IWDT_Pos)
#define SYSCTRL_RESETFLAG_IWDT SYSCTRL_RESETFLAG_IWDT_Msk
#define SYSCTRL_RESETFLAG_WWDT_Pos (4U)
#define SYSCTRL_RESETFLAG_WWDT_Msk (0x1UL << SYSCTRL_RESETFLAG_WWDT_Pos)
#define SYSCTRL_RESETFLAG_WWDT SYSCTRL_RESETFLAG_WWDT_Msk
#define SYSCTRL_RESETFLAG_LOCKUP_Pos (5U)
#define SYSCTRL_RESETFLAG_LOCKUP_Msk (0x1UL << SYSCTRL_RESETFLAG_LOCKUP_Pos)
#define SYSCTRL_RESETFLAG_LOCKUP SYSCTRL_RESETFLAG_LOCKUP_Msk
#define SYSCTRL_RESETFLAG_SYSREQ_Pos (6U)
#define SYSCTRL_RESETFLAG_SYSREQ_Msk (0x1UL << SYSCTRL_RESETFLAG_SYSREQ_Pos)
#define SYSCTRL_RESETFLAG_SYSREQ SYSCTRL_RESETFLAG_SYSREQ_Msk
#define SYSCTRL_RESETFLAG_RSTB_Pos (7U)
#define SYSCTRL_RESETFLAG_RSTB_Msk (0x1UL << SYSCTRL_RESETFLAG_RSTB_Pos)
#define SYSCTRL_RESETFLAG_RSTB SYSCTRL_RESETFLAG_RSTB_Msk

// SYSCTRL_DEBUGACTIVE
#define SYSCTRL_DEBUGACTIVE_CTRIM_Pos (7U)
#define SYSCTRL_DEBUGACTIVE_CTRIM_Msk (0x1UL << SYSCTRL_DEBUGACTIVE_CTRIM_Pos)
#define SYSCTRL_DEBUGACTIVE_CTRIM SYSCTRL_DEBUGACTIVE_CTRIM_Msk
#define SYSCTRL_DEBUGACTIVE_IWDT_Pos (8U)
#define SYSCTRL_DEBUGACTIVE_IWDT_Msk (0x1UL << SYSCTRL_DEBUGACTIVE_IWDT_Pos)
#define SYSCTRL_DEBUGACTIVE_IWDT SYSCTRL_DEBUGACTIVE_IWDT_Msk
#define SYSCTRL_DEBUGACTIVE_ATIM3_Pos (11U)
#define SYSCTRL_DEBUGACTIVE_ATIM3_Msk (0x1UL << SYSCTRL_DEBUGACTIVE_ATIM3_Pos)
#define SYSCTRL_DEBUGACTIVE_ATIM3 SYSCTRL_DEBUGACTIVE_ATIM3_Msk
#define SYSCTRL_DEBUGACTIVE_GTIM_Pos (14U)
#define SYSCTRL_DEBUGACTIVE_GTIM_Msk (0x1UL << SYSCTRL_DEBUGACTIVE_GTIM_Pos)
#define SYSCTRL_DEBUGACTIVE_GTIM SYSCTRL_DEBUGACTIVE_GTIM_Msk
#define SYSCTRL_DEBUGACTIVE_WWDT_Pos (16U)
#define SYSCTRL_DEBUGACTIVE_WWDT_Msk (0x1UL << SYSCTRL_DEBUGACTIVE_WWDT_Pos)
#define SYSCTRL_DEBUGACTIVE_WWDT SYSCTRL_DEBUGACTIVE_WWDT_Msk

//********************    Bits Define For Peripheral WWDT    ********************//
// WWDT_CR0
#define WWDT_CR0_WCNT_Pos (0U)
#define WWDT_CR0_WCNT_Msk (0x7FUL << WWDT_CR0_WCNT_Pos)
#define WWDT_CR0_WCNT WWDT_CR0_WCNT_Msk
#define WWDT_CR0_EN_Pos (7U)
#define WWDT_CR0_EN_Msk (0x1UL << WWDT_CR0_EN_Pos)
#define WWDT_CR0_EN WWDT_CR0_EN_Msk

// WWDT_CR1
#define WWDT_CR1_WINR_Pos (0U)
#define WWDT_CR1_WINR_Msk (0x7FUL << WWDT_CR1_WINR_Pos)
#define WWDT_CR1_WINR WWDT_CR1_WINR_Msk
#define WWDT_CR1_IE_Pos (9U)
#define WWDT_CR1_IE_Msk (0x1UL << WWDT_CR1_IE_Pos)
#define WWDT_CR1_IE WWDT_CR1_IE_Msk
#define WWDT_CR1_PRS_Pos (11U)
#define WWDT_CR1_PRS_Msk (0x7UL << WWDT_CR1_PRS_Pos)
#define WWDT_CR1_PRS WWDT_CR1_PRS_Msk

// WWDT_SR
#define WWDT_SR_POV_Pos (0U)
#define WWDT_SR_POV_Msk (0x1UL << WWDT_SR_POV_Pos)
#define WWDT_SR_POV WWDT_SR_POV_Msk

#ifdef __cplusplus
}
#endif

#endif /* __HC32F002_H__ */
